{"url": "https://es.wikipedia.org/wiki/Computadora_personal", "title": "Computadora personal", "summary": "Una computadora personal, computador personal u ordenador, conocida como PC (siglas en inglés de Personal Computer), es un tipo de microcomputadora diseñada en principio para ser utilizada por una sola persona. Habitualmente, la sigla PC se refiere a las computadoras IBM PC compatibles. Una computadora personal es generalmente de tamaño medio y es usada por un solo usuario (aunque hay sistemas operativos que permiten varios usuarios simultáneamente, lo que es conocido como multiusuario). Suele denominarse ordenador de sobremesa, debido a su posición estática e imposibilidad de transporte a diferencia de un ordenador portátil.\nUna computadora personal suele estar equipada para cumplir tareas comunes de la informática moderna, es decir, permite navegar por Internet, estudiar, escribir textos y realizar otros  trabajos de oficina o educativos, como editar textos y bases de datos, además de actividades de ocio, como escuchar música, ver videos, jugar, etc.\nEn cuanto a su movilidad podemos distinguir entre computadora de escritorio y computadora portátil.\n", "sections": [{"name": "Historia", "text": "Artículo principal:\nEl primer registro que se conoce del término en inglés, personal computer es el aparecido en 1964 en la revista New Scientist, en una serie de artículos llamados «El mundo en 1984». En un artículo titulado «The Banishment of Paper Work», Arthur L. Samuel, del Centro de Investigación Watson de IBM escribió: «Aunque será completamente posible obtener una educación en casa, a través del propio computador personal, la naturaleza humana no habrá cambiado, y todavía habrá necesidad de escuelas con laboratorios, aulas y profesores que motiven a los alumnos».\nLa primera PC es el Programma 101, producido por la empresa italiana Olivetti entre los años 1962 y 1964. Inventado por el ingeniero italiano Pier Giorgio Perotto que fue también el inventor de la tarjeta magnética. Programma 101 también fue utilizado en 1969 por la NASA para enviar el hombre a la Luna en la misión Apolo 11, en el canal de televisión estadounidense ABC para predecir las elecciones políticas de 1969 o por soldados estadounidenses para planificar operaciones en la Guerra de Vietnam. En 1968, Hewlett Packard creó una PC casi idéntica al Programma 101, la Hewlett-Packard 9100A, por lo que fue declarada culpable de plagio y debió pagar 900.000 dólares a Olivetti.[1]​\nFue el lanzamiento de la hoja de cálculo VisiCalc, en principio para Apple II y después para la IBM PC, la aplicación que logró convertir a la microcomputadora en una herramienta de trabajo. El bajo costo de las computadoras personales las hizo adquirir una gran popularidad tanto para las familias como para los trabajadores en los años ochenta; era mucho menos polifacética y potente que las computadoras de las empresas de aquel entonces, y en general eran utilizadas para jugar por los aficionados informáticos.\nEn los años 1990, el poder de las computadoras personales aumentó de manera radical, borrando la gran diferencia que había entre las computadoras personales y las computadoras de varios usuarios como las computadoras centrales. Hoy las computadoras de gama alta se distinguen de las computadoras personales por su mayor fiabilidad o su mayor habilidad para realizar multitaréas y no por la potencia de la CPU.\nLa mayoría de las computadoras personales utilizan una arquitectura de soporte físico compatible con la PC de IBM, usando procesadores compatibles con x86 realizados por Intel, AMD o Cyrix.\nA pesar de la enorme popularidad de la computadora personal, varias microcomputadoras incompatibles con IBM (también llamadas de manera general computadoras personales) son todavía populares para determinados usos específicos. Hasta hace poco, la principal alternativa era la computadora con procesador PowerPC, con el sistema operativo Mac OS X de Apple Computer (aunque otros sistemas operativos pueden correr sobre esta arquitectura), que se usa sobre todo para diseño gráfico y usos relacionados, sirviendo también perfectamente para un usuario doméstico. Hay que decir que a partir de 2006 las computadoras de Apple usan microprocesadores de Intel y ya no se fabrican PowerPC. Pese a ello siguen siendo incompatibles (las compatibles utilizan BIOS y las Mac EFI).\nLa computadora personal es en una palabra consumidor-amistosa para la segunda generación de computadoras de escritorio, que se incorporaron en el mercado a 1977 y llegaron a ser de uso común durante los años 1980. También se conocen como computadoras personales.\nLa computadora personal llegó a ser de fácil adquisición para el público en general debido a la producción en masa del microprocesador basado en el chip de silicio y como el nombre indica, pensada para ser utilizada en el hogar antes que en negocios o contextos industriales. También fueron diseñadas para ser inmediatamente útiles a los clientes no técnicos, en contraste con las microcomputadoras de la primera generación que vinieron como kits y requerían a menudo habilidades en electrónica. El uso del término “computadora personal” murió en gran parte hacia finales de la década (en los Estados Unidos) o en los primeros años 1990 (en Europa). Esto se debió a la aparición de la computadora personal compatible de la PC de IBM, y a la preferencia consiguiente por el término “PC” antes que “computadora personal”.\n", "subsections": [{"name": "Computadoras personales destacadas", "text": "La lista de abajo muestra las computadoras personales más populares e históricamente más significativas de los últimos años de los 60 a los años 1980. Incluye su año inicial del lanzamiento así también como su región o país de origen. Los lanzamientos más significativos en los Estados Unidos fueron: Olivetti Programma 101 (1965), Apple II (1977), IBM PC (1981), el ZX Spectrum (1982), el Commodore 64 (1982), y el Apple Macintosh (1984). Una plétora de computadoras personales surgió durante este período, pero no pudieron tener un impacto significativo en el mercado de los Estados Unidos o la historia de la computación doméstica y como tales no se mencionan (esto incluye las máquinas no vendidas o conocidas en los Estados Unidos). Diversos modelos en una línea de computadoras compatibles se enumeran en su totalidad, por ejemplo las familias del Apple II y del TRS-80.\n(Para una descripción más completa de las computadoras personales, es decir, no solamente de las más notables dadas abajo, ver la lista de las computadoras personales.)\n1977, junio: Apple II (EE. UU.), gráficos en color, ocho ranuras de expansión.\n1977, agosto: Tandy Radio Shack (TRS-80) (EE. UU.), primera computadora personal de menos de 600 dólares.\n1977, diciembre: Commodore PET (EE. UU.), primera computadora completa: teclado, pantalla y cinta.\n1979: Atari 400/800 (EE. UU.), primera computadora con un chipset específico y chip de video programable.\n1979: TI-99/4, primera computadora personal con un procesador de 16 bits.\n"}, {"name": "Los años 1980", "text": "1980: Commodore VIC-20 (por debajo de 300 dólares; primera computadora en el mundo en pasar la marca de un millón de unidades vendidas).\n1980: Computadora en color TRS-80 (Motorola 6809, trabajos múltiples opcionales OS-9).\n1980: Osborne Computer Company lanza el [Osborne 1]] (primera computadora \"portátil\").\n1981, junio: Texas Instruments TI-99/4A - basada en el menos exitoso TI-99/4, segunda computadora personal con una CPU de 16 bits, primera en agregar gráficos \"sprite\".\n1981, agosto: PC de IBM, versión original de la plataforma de hardware compatible de la PC de IBM. El modelo original fue denominado IBM 5150. Fue creado por un equipo de 12 ingenieros y diseñadores bajo la dirección de Estridge de la división de los sistemas de la entrada de IBM en Boca Ratón, Florida.\n1981: Sinclair ZX81 (Europa), el kit costaba 49,95 libras; 69,95 libras pre-construido. Fue lanzado como Timex Sinclair 1000 en Estados Unidos en 1982.\n1981: BBC Micro (Europa), computadora educativa del primer ministro del Reino Unido por una década; BASIC avanzado con el ensamblador integrado del código automático 6502; diseñado con una miríada de puertos de entrada-salida.\n1982: Kaypro lanza la computadora Kaypro II y Olivetti el ordenador Olivetti M20.\n1982, abril: Sinclair ZX Spectrum (Europa), la computadora personal británica más vendida; creó la industria británica del software.\n1982, agosto: Commodore 64, el modelo de computadora más vendido de todos los tiempos: 17 millones vendidos.\n1983: Coleco Adam.\n1983: MSX (Japón), diseño de referencia de ASCII y Microsoft, fabricado por varias compañías: 5 millones vendidos. Un intento de crear un estándar doméstico, similar a como era el video doméstico VHS.\n1983: VTech Laser 200, computadora de VTech de nivel de entrada dirigida siendo el más barato en mercado.\n1984, enero: Apple Macintosh (N.), Primer ratón comercialmente acertado conducido, hogar/computadora personal completamente GUI-basados; primer 16/32-bits.\n1984: Amstrad/Schneider CPC y PCW se extiende (Europa), estándar británico antes de la PC de IBM; ventas alemanas al lado de C64 y el Macintosh, de Apple.\n1985: Atari ST (N.), primero con la interfaz incorporada de MIDI; también RAM de 1MB por menos de 1000 dólares.\n1985, julio: Commodore lanza el Amiga 1000 que destaca por sus excelentes habilidades multimedia (video/audio), su OS GUI y primer OS multitarea apropiativa.\n1987: Acorn Archimedes (Europa), basada en el microprocesador Acorn, un desarrollo de gran alcance de ARM de 32 bit; la mayoría de la computadora personal de gran alcance en su clase en su principio.\n"}]}, {"name": "Tipos", "text": "", "subsections": [{"name": "Estación de trabajo", "text": "Busca fuentes: «Computadora personal» – noticias · libros · académico · imágenes\nEn informática una estación de trabajo (en inglés workstation) es un computador de altas prestaciones destinado para trabajo técnico o científico. En una red de computadoras, es una computadora que facilita a las personas el acceso a los servidores y periféricos de la red. A diferencia de una computadora aislada, tiene una tarjeta de red y está físicamente conectada por medio de cables u otros medios no guiados con los servidores. Los componentes para servidores y estaciones de trabajo alcanzan nuevos niveles de rendimiento informático, al tiempo que ofrecen fiabilidad, compatibilidad, escalabilidad y arquitectura avanzada ideales para entornos multiproceso.\nLo de las computadoras en general, las computadoras promedio de hoy en día son más poderosas que las mejores estaciones de trabajo de una generación atrás. Como resultado, el mercado de las estaciones de trabajo se está volviendo cada vez más especializado, ya que muchas operaciones complejas que antes requerían sistemas de alto rendimiento pueden ser ahora dirigidas a computadores de propósito general. Sin embargo, el hardware de las estaciones de trabajo está optimizado para situaciones que requieren un alto rendimiento y fiabilidad, donde generalmente se mantienen operativas en situaciones en las cuales cualquier computadora personal tradicional dejaría rápidamente de responder. \n"}, {"name": "Computadora de escritorio", "text": "Se denomina computadora de escritorio, computador de escritorio, ordenador de sobremesa u ordenador fijo[2]​ a un tipo de computadora personal, diseñada y fabricada para ser instalada en una ubicación estática, como un escritorio o mesa, a diferencia de otras computadoras similares, como la computadora portátil, cuya ubicación es dinámica. Los componentes del hardware suelen ser una caja de computadora que alberga la placa base con un microprocesador como CPU, una fuente de alimentación, las unidades de disco, la memoria RAM, una tarjeta de video, un ratón, un teclado y un monitor. Los sistemas operativos más populares en las computadoras de escritorio suelen ser Windows, MacOS y Linux. \n"}, {"name": "Computadora portátil", "text": "Una computadora portátil, computador portátil u ordenador portátil, a veces simplemente conocido como portátil o por los anglicismos laptop y notebook es una computadora personal que se puede mover o transportar con relativa facilidad. Los ordenadores portátiles son capaces de realizar todas las tareas que realizan las computadoras de escritorio y normalmente poseen conectividad inalámbrica Wi-Fi y Bluetooth. Una computadora portátil funciona con una batería recargable, contiene una pantalla LED o LCD, teclado, panel táctil o touchpad, una unidad de estado sólido o disco duro, puertos como USB o HDMI, cámara, etc. y puede tener diferentes sistemas operativos como MacOS, Linux, Windows y Chrome OS. Los portátiles que tienen este último sistema operativo son conocidos como Chromebooks.\nLas computadoras portátiles son pequeñas, livianas y están especialmente diseñadas para que sus baterías sean capaces de alimentarlas durante un período prolongado de tiempo (generalmente de cuatro a cinco horas). Esto tiene el costo de configuraciones de hardware más simplificadas, con poca memoria RAM que suele no superar los 8 gigabytes, una tarjeta gráfica generalmente integrada en el procesador, una velocidad de procesador que rara vez excede los 3,00 GHz y un disco duro con una capacidad de almacenamiento limitada casi siempre no mayor a 512 gigabytes. La medida de las pantallas van de las 11 a las 15 pulgadas, aunque las más comunes rondan las 14 pulgadas en formato de pantalla panorámica.\n"}]}, {"name": "Hardware", "text": "El hardware (pronunciado [xard.wer]), equipo o soporte físico[3]​ en informática se refiere a las partes físicas, tangibles, de un sistema informático, sus componentes eléctricos, electrónicos y electromecánicos.[4]​ Los cables, así como los muebles o cajas, los periféricos de todo tipo, y cualquier otro elemento físico involucrado, componen el hardware o soporte físico; contrariamente, el soporte lógico e intangible es el llamado software.\nEl término es propio del idioma inglés, y su traducción al español no tiene un significado acorde, por tal motivo se lo ha adoptado tal cual es y suena. La Real Academia Española lo define como «Conjunto de los componentes que integran la parte material de una computadora».[5]​ El término, aunque sea lo más común, no solamente se aplica a las computadoras, también es a menudo utilizado en otras áreas de la vida diaria y la tecnología. Por ejemplo, hardware también se refiere a herramientas y máquinas, y en electrónica hardware se refiere a todos los componentes electrónicos, eléctricos, electromecánicos, mecánicos, cableados y tarjetas de circuitos impresos.\nOtros ejemplos donde se aplica el término hardware son, en relación con los robots,[6]​[7]​ así como en relación con los teléfonos móviles, las cámaras fotográficas, los reproductores digitales, o cualquier otro dispositivo electrónico. Cuando dichos dispositivos también procesan datos, poseen firmware y/o software además de hardware.\nLa historia del hardware de computador se puede clasificar en cuatro generaciones, cada una caracterizada por un cambio tecnológico de importancia. Una primera delimitación podría hacerse entre hardware principal (véase figura), como el estrictamente necesario para el funcionamiento normal del equipo, y el «complementario», como el que realiza funciones específicas.\n", "subsections": []}, {"name": "Software", "text": "/ˈsɔftˌwɛr/\nLos componentes lógicos incluyen, entre muchos otros, las aplicaciones informáticas, tales como el procesador de texto, que permite al usuario realizar todas las tareas concernientes a la edición de textos; el llamado software de sistema, tal como el sistema operativo, que básicamente permite al resto de los programas funcionar adecuadamente, facilitando también la interacción entre los componentes físicos y el resto de las aplicaciones, y proporcionando una interfaz con el usuario.[9]​\nEl software, en su gran mayoría, está escrito en lenguajes de programación de alto nivel, ya que son más fáciles y eficientes para que los programadores los usen, porque son más cercanos al lenguaje natural respecto del lenguaje de máquina.[10]​ Los lenguajes de alto nivel se traducen a lenguaje de máquina utilizando un compilador o un intérprete, o bien una combinación de ambos. El software también puede estar escrito en lenguaje ensamblador, que es de bajo nivel y tiene una alta correspondencia con las instrucciones de lenguaje máquina; se traduce al lenguaje de la máquina utilizando un ensamblador.\n", "subsections": [{"name": "Sistema operativo", "text": "Un sistema operativo (SO) es el conjunto de programas de un sistema informático que gestiona los recursos del hardware y provee servicios a los programas de aplicación de software. Estos programas se ejecutan en modo privilegiado respecto de los restantes.[11]​\nUno de los propósitos del sistema operativo que gestiona el núcleo intermediario consiste en gestionar los recursos de localización y protección de acceso del hardware, hecho que alivia a los programadores de aplicaciones de tener que tratar con estos detalles. La mayoría de los aparatos electrónicos que utilizan microprocesadores para funcionar, llevan incorporado un sistema operativo (teléfonos móviles, reproductores de DVD, computadoras, enrutadores, etc.). En cuyo caso, son manejados mediante una interfaz gráfica de usuario, un gestor de ventanas o un entorno de escritorio, si es un celular, mediante una consola o control remoto si es un DVD y, mediante una línea de comandos o navegador web si es un enrutador.\n"}, {"name": "Software de aplicación", "text": "Las aplicaciones pueden ser empaquetadas con el ordenador y su software de sistema o bien ser publicadas por separado. Asimismo, pueden codificarse como proyectos propietarios, de código abierto o universitarios.[16]​ Las aplicaciones creadas para plataformas móviles se denominan aplicaciones móviles.\n"}]}, {"name": "Impacto ambiental", "text": "El reciclaje de ordenadores o reciclaje electrónico es el desmontaje y separación de componentes y materias primas de desechos electrónicos. Aunque los procedimientos de reutilización, donación y reparación no son estrictamente de reciclaje, estas son otras formas sostenibles comunes de eliminar los desechos de TI. \nEn 2009, el 38% de las computadoras y una cuarta parte del total de desechos electrónicos se reciclaron en los Estados Unidos, un 5% y un 3% más que tres años antes, respectivamente.[18]​[19]​ Desde su inicio a principios de la década de 1990, cada vez se reciclan más dispositivos en todo el mundo debido a una mayor conciencia e inversión. El reciclaje electrónico se produce principalmente para recuperar metales valiosos de tierras raras y metales preciosos, que escasean, así como plásticos y metales. Estos se revenden o utilizan en nuevos dispositivos después de la purificación, lo que crea una economía circular. Dichos procesos involucran instalaciones y locales especializados, pero dentro del hogar o el lugar de trabajo ordinario, los componentes de sonido de computadoras dañadas u obsoletas a menudo se pueden reutilizar, lo que reduce los costos de reemplazo.\n", "subsections": []}, {"name": "Véase también", "text": "Computadora, minicomputadora y supercomputadora\nIBM PC\nCompatible IBM PC\nInfluencia del IBM PC\nHistoria de la informática\nHistoria del hardware de computador\n", "subsections": []}, {"name": "Referencias", "text": "↑ «The incredible story of the first PC, from 1965». Pingdom. Archivado desde el original el 30 de agosto de 2012. Consultado el 28 de agosto de 2012. \n↑ «¿Ordenador fijo o portátil? Ventajas, inconvenientes y precios.». El Confidencial. \n↑ «Diccionario panhispánico de dudas.». RAE. \n↑ «Definición de Computadora». MasterMagazine. Portal de tecnología. Consultado el 26 de noviembre de 2021. \n↑ «hardware.». Diccionario de la lengua española. \n↑ «Computation of Customized Symbolic robot models on peripheral array processors». IEEE Xplore. \n↑ «Robotics and Automation Society». The IEEE Robotics and Automation Society. \n↑ Diccionario de la lengua española 2005 (2010).  wordreference.com, ed. «software» (diccionario). Espasa-Calpe. Consultado el 1 de febrero de 2010. \n↑ «SYSTEM SOFTWARE». 30 de mayo de 2001. Archivado desde el original el 30 de mayo de 2001. Consultado el 10 de febrero de 2018. \n↑ «Onderwijs Informatica en Informatiekunde | Department of Information and Computing Sciences». www.cs.uu.nl. Archivado desde el original el 2 de noviembre de 2013. Consultado el 10 de febrero de 2018. \n↑ Cfr., entre otros: Tanenbaum, A. (1992) Modern Operating Systems, Englewood Cliffs: Prentice-Hall; Haldar, S. y Aravind, A. A. (2010) Operating Systems, Pearson Education India, pp. 12 y ss.; Turner, R. W. (1986) Operating Systems: design and implementation, MacMillan.\n↑ «Desktop Operating System Market Share Worldwide». StatCounter Global Stats (en inglés). Consultado el 10 de octubre de 2020. \n↑ «Mobile & Tablet Operating System Market Share Worldwide». StatCounter Global Stats (en inglés). Consultado el 10 de octubre de 2020. \n↑ Pastor, Atreim (15 de noviembre de 2017). «Linux es líder absoluto en supercomputación, ¿por qué Windows o macOS no?». Xataka. Consultado el 10 de octubre de 2020. \n↑ a b «Application software». PC Magazine (en inglés). Ziff Davis. \n↑ Ryan, Thorne (14 de marzo de 2013). «Caffeine and computer screens: student programmers endure weekend long appathon» (en inglés). The Arbiter. Consultado el 12 de octubre de 2015. \n↑ «aplicación, alternativa a app». www.fundeu.es. Consultado el 3 de junio de 2020. \n↑ Nguemaleu, Raoul-Abelin Choumin,. Roadmap to greener computing. ISBN 978-1-4665-0694-7. OCLC 880455959. Consultado el 11 de octubre de 2020. \n↑ «Event Waste Clearance». Consultado el 8 de octubre de 2023. \n↑ National Computer Recycling Act of 2005, H.R. 425, 109th Cong. (2005–2006)\n", "subsections": []}, {"name": "Enlaces externos", "text": "Artículo sobre el futuro de los PC", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Computer_Space", "title": "Computer Space", "summary": "Computer Space  es un videojuego arcade lanzado en noviembre de 1971 por Nutting associates.[1]​ Creado por Nolan Bushnell y Ted Dabney[1]​, quienes más tarde fundarían Atari, es considerado el primer videojuego vendido de forma comercial que funcionaba con monedas.[1]​ El juego es una adaptación del mítico Spacewar! (1962)[1]​, y es similar al posteriormente famoso Asteroids (1979) con la diferencia de tener dos platillos voladores en vez de rocas. \n", "sections": [{"name": "Historia", "text": "Los esfuerzos anteriores en llevar a Spacewar!, un videojuego desarrollado en 1961 en el Instituto Tecnológico de Massachusettsen la minicomputadora PDP-1[1]​, al mercado masivo fueron centrados en el paradigma de las minicomputadoras de los campus universitarios donde se originaron - una computadora central que distribuía el software a varias terminales remotas. Computer Space fue innovador por establecer la forma básica de los juegos de tipo arcade que vendrían en el futuro - un sistema de cómputo dedicado a únicamente a un solo juego.[2]​\nComputer Space fue el primer videojuego arcade ampliamente disponible, aunque no tuvo mucho éxito. Para la gran mayoría el juego era muy complicado y terminaba muy rápidamente. Mientras que era bien recibido en los campus universitarios, no era muy popular en los bares y otros establecimientos.[1]​ En total vendió alrededor de 1500 unidades.[1]​ Bushnell reclutó entonces a Al Alcorn y creó un sistema más fácil de captar, el Pong, basado en el Tennis del sistema de videojuego casero Magnavox Odyssey, de Ralph Baer.\nSe produjeron cabinas separadas tanto para un solo jugador como para dos jugadores[1]​ en colores azul, verde, rojo, blanco y amarillo.\n", "subsections": []}, {"name": "Juego", "text": "El jugador controla un cohete que puede disparar a los platillos voladores (o incluso a sí mismo).[1]​ La pantalla muestra el tiempo en el juego (por lo general 100 segundos), el número de vidas perdidas, y el número de platillos que se han destruido. Se tiene un número de vidas ilimitadas durante el tiempo que dura el juego.\nEn la actualidad este juego se consideraría como un Matamarcianos multidireccional.\nSi el marcador del jugador es mayor que el número de platillos voladores tras 90 segundos, el jugador obtendrá otros 90 segundos de juego y los colores de la pantalla cambian al \"Hiperespacio\" (se cambiaban como un negativo de fotografía, de negro a blanco y de blanco a negro). Si tras estos otros 90 segundos el marcador del jugador todavía era mayor que los platillos voladores, el jugador recibía otros 90 segundos y los colores regresaban a la normalidad. Está secuencia se repetía indefinidamente.\n", "subsections": [{"name": "Puntuación", "text": "La puntuación se mantiene con un solo dígito que varía de cero a nueve; una vez que se alcanza el nueve, el siguiente golpe regresa el marcador a cero.\n"}]}, {"name": "Especificaciones técnicas", "text": "Computer Space no utiliza microprocesador, RAM o ROM. El sistema está basado en una máquina de estado fínita hecha de circuitos integrados de Tecnología TTL de la serie 74. Los elementos gráficos están contenidos en arreglos de diodos. La configuración está hecha de hasta tres circuitos impresos interconectados por un bus común. El despliegue es renderizado en una televisión de tubos de vacío en blanco y negro de 15\" de la marca General Electric, especialmente modificada para  Computer Space.[3]​\n", "subsections": []}, {"name": "Clones", "text": "Computer Space fue clonada/bootleg en 1972 por una compañía denominada For-Play y llamaron al juego Star Trek.[4]​[5]​\n", "subsections": []}, {"name": "Referencias", "text": "↑ a b c d e f g h i Eddy, Brian (2012). «In the biginning». Classic video games The golden age, 1971-1974 (en inglés). Great Britain: Shire Publications. pp. 5. ISBN 9780747810421. \n↑ Videotopia\n↑ Marvin Yagoda (2008). «1972 Nutting Associates Computer Space». Archivado desde el original el 30 de enero de 2009. \n↑ \n«Genre». Archivado desde el original el 3 de julio de 2008. Consultado el 10 de agosto de 2008. \n↑ «Star Trek Unlicensed». Consultado el 10 de agosto de 2008. \n", "subsections": []}, {"name": "Enlaces externos", "text": "Reseña del videojuego (en inglés)\nReseña del videojuego (en inglés)", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Consola_port%C3%A1til", "title": "Videoconsola portátil", "summary": "Una videoconsola portátil es un dispositivo electrónico  ligero que permite jugar videojuegos y en el que, a diferencia de una videoconsola de sobremesa, los controles, la pantalla, los altavoces y la alimentación (baterías) están integrados en la misma unidad y todo ello con un pequeño tamaño, para poder llevarla y jugar en cualquier lugar o momento.[1]​[2]​\nEn 1976 Mattel presentó el primer juego electrónico portátil con el lanzamiento de Auto Race.[3]​ Posteriormente varias compañías, como Coleco o Milton Bradley, lanzaron sus propios juegos o dispositivos electrónicos portátiles.[4]​ La primera videoconsola portátil con cartuchos intercambiables fue la MicroVision de Milton Bradley, lanzada en 1979.[5]​[6]​\nNintendo está considerada como la empresa que popularizó el concepto de videoconsola portátil con el lanzamiento de la Game Boy en 1989,[2]​[7]​ compañía que en 2014 y 2015 seguía dominando el mercado de las consolas portátiles con sus sistemas Nintendo DS y 3DS.[8]​[9]​[10]​ \n", "sections": [{"name": "Historia", "text": "", "subsections": [{"name": "Orígenes", "text": "Los orígenes de las videoconsolas portátiles se remontan a los dispositivos electrónicos de juegos portátiles y de sobremesa de la década de 1970 y principios de 1980. Estos dispositivos podían jugar un solo juego,[2]​ y cabían en la palma de la mano o sobre una mesa, y las había con distintos tipos de pantallas de vídeo, como led, VFD o LCD.[12]​ En 1978, los por entonces nuevos juegos electrónicos portátiles se describían en la revista Popular Electronics como juegos electrónicos «nonvideo» y «non-TV» para diferenciarlos de los dispositivos que requerían el uso de una pantalla de televisión.[13]​ A su vez, los juegos electrónicos portátiles encuentran sus orígenes en la síntesis de anteriores dispositivos electromecánicos portátiles y de mesa, como el Electronic Tic-Tac-Toe (1972) de la antigua compañía juguetera Waco,[12]​ el Periscope-Firing Range (1951) de Cragstan,[14]​ y el emergente mercado de calculadoras de pantalla optoelectrónica de principios de la década de 1970.[15]​[16]​ Esta síntesis se dio en 1976, con el nacimiento de los juegos electrónicos portátiles cuando Mattel comenzó a trabajar en una línea de juegos deportivos del tamaño de una calculadora utilizando la tecnología led.[17]​\nEl resultado fue el lanzamiento en 1976 del Mattel Electronics Auto Race,[3]​[18]​ seguido del de Football en 1977;[19]​[20]​ ambos juegos tuvieron tanto éxito que, según Katz, «estos simples juegos electrónicos de mano se convirtieron en una 'categoría de $400 millones'».[12]​ Posteriormente Mattel tuvo el honor de ser reconocido por la industria por su innovación en las pantallas de los dispositivos de juego portátiles.[21]​ Pronto otros fabricantes, como Coleco, Parker Brothers, Milton Bradley, Entex o Bandai, le siguieron con sus propios juegos portátiles.[4]​\nEn 1979 la MicroVision, basada en LCD, diseñada por Smith Engineering y distribuida por Milton Bradley,[22]​ se convirtió en la primera consola de juegos portátil y la primera en utilizar cartuchos intercambiables.[6]​ El juego para MicroVision Cosmic Hunter (1981) introdujo el concepto de la cruceta en los dispositivos portátiles de juego,[23]​ utilizando el pulgar para manipular el personaje en la pantalla en cualquier dirección.[24]​\nEn 1979 Gunpei Yokoi, un ingeniero de mantenimiento que trabajaba en Nintendo, durante un viaje en tren bala vio a un hombre de negocios aburrido jugando con una calculadora de LCD pulsando los botones, y se le ocurrió una idea para diseñar un reloj que hiciera las veces de una máquina de juegos en miniatura para matar el tiempo.[25]​ En 1980 Nintendo inició el lanzamiento de una serie de juegos electrónicos diseñados por Yokoi denominados juegos Game & Watch.[26]​ Haciendo uso de la tecnología utilizada en las calculadoras del tamaño de una tarjeta de crédito que acababan de aparecer en el mercado, Yokoi diseñó la serie de juegos basados en pantallas LCD que incluían la hora en formato digital en una esquina de la pantalla.[27]​ El dispositivo ideado por Yokoi tuvo un gran éxito comercial y popularizó el concepto de videojuego portátil, llegándose a vender más de 80 millones de unidades a nivel mundial. Posteriormente, para los juegos Game & Watch más complejos, inventó un controlador direccional en forma de cruz o cruceta para el manejo de los personajes que aparecen en pantalla.[28]​ También incluyó a su cruceta direccional en los mandos de la NES, y el dispositivo en forma de cruz manejable con el pulgar pronto se convirtió en un estándar en los controladores de las videoconsolas y omnipresente en toda la industria de los videojuegos desde entonces.[29]​[30]​ Cuando Yokoi comenzó a diseñar la primera consola de juegos portátil de Nintendo, se le ocurrió un dispositivo que unía elementos de sus dispositivos Game & Watch y la consola Famicom (NES),[31]​ incluida la cruceta. El resultado fue la Game Boy.\nEn 1982 la LCD Solarpower de Bandai fue el primer dispositivo de juego que funcionaba con energía solar. Algunos de sus juegos, como el Terror House, disponía de dos paneles LCD apilados uno sobre otro, dando un efecto estereoscópico precursor del 3D.[32]​ En 1983 la Tomytronic 3D de Takara Tomy simulaba un efecto 3D utilizando dos paneles LED iluminados por luz exterior mirando a través de una especie de binoculares en la parte superior del dispositivo, convirtiéndose en el primer hardware 3D especializado de vídeo doméstico.[32]​\n"}, {"name": "Inicios", "text": "El final de la década de 1980 y principios de la de 1990 vio los inicios de la industria de la consola de juegos portátil tal como la conocemos en la actualidad, después de la desaparición de la MicroVision. Como las consolas de juegos LCD retroiluminados con gráficos en color consumen una gran cantidad de energía, no eran muy amigables con las baterías como la no retroiluminada Game Boy original cuyos gráficos en blanco y negro permitían una mayor vida útil de la batería. Por aquel entonces la tecnología de las baterías recargables aún no había madurado, por lo que las consolas de juegos más avanzados de la época tales como la Game Gear de Sega y la Atari Lynx no tuvieron tanto éxito como la Game Boy.\nA pesar de que existían baterías recargables de terceros para las hambrientas consumidoras de energía alternativas a la Game Boy, estas baterías eran del tipo níquel cadmio y requerían estar completamente descargadas antes de recargarlas para garantizar su máxima eficiencia; las baterías de plomo y ácido se podrían utilizar con un adaptador que se enchufa al mechero del coche; pero las baterías tenían una portabilidad mediocre. Las baterías del tipo Ni-MH posteriores, que no necesitan estar descargadas para obtener la máxima eficiencia, no surgieron hasta finales de 1990, años después de que la Game Gear, la Atari Lynx y la Game Boy original se habían descatalogado. Durante la época en que las consolas portátiles tecnológicamente superiores tenían estrictas limitaciones técnicas, las baterías tenían un índice mAh y las de mayor potencia aún no estaban disponibles.\nLos sistemas de juego modernos como la Nintendo DS y la PlayStation Portable disponen de baterías recargables de ion de litio con formatos propietarios. Otras consolas de séptima generación, como la GP2X, utilizan baterías alcalinas estándar. Debido a que el índice mAh de las pilas alcalinas ha aumentado desde la década de 1990, la potencia necesaria para dispositivos portátiles como la GP2X puede ser suministrado por relativamente pocas baterías.\n"}, {"name": "Años 1980", "text": "Game Boy\nArtículo principal:\nLa compañía japonesa Nintendo lanzó la Game Boy el 21 de abril de 1989. El equipo de diseño dirigido por Gunpei Yokoi también había sido responsable del Game & Watch, así como los juegos para la NES Metroid y Kid Icarus. La Game Boy fue objeto de críticas por parte de algunos sectores de la industria, diciendo que su pantalla monocromática era demasiado pequeña, y su potencia de procesamiento era inadecuada. Sin embargo el equipo de diseño había considerado que bajo precio y escaso consumo de batería eran las cuestiones más importantes y, en comparación con la MicroVision, la Game Boy fue un gran paso adelante.\nYokoi reconoció que la Game Boy necesitaba una killer application, esto es, al menos un juego que definiera la consola y persuadiera a los clientes a comprarla. En junio de 1988 Minoru Arakawa, por entonces CEO de Nintendo América, vio una demostración del Tetris en una feria comercial. Nintendo compró los derechos sobre el juego, y se distribuyó con la consola. Fue un éxito inmediato: a finales de año se habían vendido más de un millón de unidades solo en los Estados Unidos.[33]​ A 31 de marzo de 2005, entre la Game Boy y la Game Boy Color habían vendido más de 118 millones de unidades en todo el mundo.[34]​\nAtari Lynx\nEn 1987 Epyx creó la Handy Game, un dispositivo que se convertiría en la Atari Lynx en 1989. Fue la primera consola portátil a color del mundo, y la primera con una pantalla retroiluminada. También ofrecía la posibilidad de jugar en red con hasta 17 jugadores, y un hardware avanzado que permitía la función de zum y el escalado de sprites. Además, la Lynx era reversible, para que fuera utilizada por los jugadores zurdos.[35]​ Sin embargo, todas estas características repercutieron en un precio muy elevado, lo que llevó a los consumidores a buscar alternativas más baratas. La Lynx también era muy difícil de manejar, consumía baterías muy rápidamente, y carecía del soporte de terceros del que gozaban sus competidoras. Debido a su alto precio, la corta vida de la batería, la escasa producción, la escasez de juegos atractivos y la agresiva campaña de marketing de Nintendo, y a pesar de su rediseño en 1991, la Lynx se convirtió en un fracaso comercial.[36]​[37]​ A pesar de ello, empresas como Telegames ayudaron a mantener vivo el sistema mucho más allá de su importancia comercial, y cuando Hasbro, el nuevo propietario de Atari, liberó los derechos de desarrollo de la consola para el dominio público, desarrolladores independientes como Songbird Productions han continuado lanzando nuevos juegos comerciales para el sistema cada año.[38]​\n"}, {"name": "Años 1990", "text": "TurboExpress\nLa TurboExpress era una versión portátil de la PC Engine. Fue lanzada en 1990 por la compañía japonesa NEC Corporation a un precio de 250 dólares, un precio elevado para la época.[39]​ En Japón se lanzó bajo el nombre PC Engine GT.\nEra la portátil más avanzada de su tiempo y podía jugar todos los juegos de la PC Engine (que se estaban disponibles en unas tarjetas de memoria del tamaño de una tarjeta de crédito denominadas HuCard).[40]​ Tenía una pantalla de 66 mm, la misma que la Game Boy original, pero con una resolución mucho más alta, y podría mostrar 64 sprites a la vez, 16 por scanline, en 512 colores (aunque el hardware sólo podía manejar 481 colores simultáneos). Tenía 8 kilobytes de memoria RAM y su CPU era un HuC6280 a 1,79 o 7,16 MHz. Funcionaba con 6 pilas AA o con un adaptador CA; la escasa duración de las pilas obligaba a utilizar a menudo el adaptador de corriente.[41]​[39]​\nFue la primera videoconsola portátil en disponer de un sintonizador de TV, el «TurboVision»,[40]​ dispositivo opcional que incluía una entrada de audio/vídeo RCA, lo que permitía a los usuarios utilizar la TurboExpress como un monitor de vídeo. El «TurboLink» posibilitaba el juego entre dos jugadores; Falcon, un simulador de vuelo de combate, incluía un modo de batalla cara a cara que sólo se podía acceder a través del TurboLink. Sin embargo, muy pocos juegos diseñados para la TurboExpress ofrecían ese modo de juego cooperativo.\nGamate\nLa Gamate, de la compañía taiwanesa Bit Corporation, fue el uno de los primeros sistemas de juego portátiles nacidos tras el éxito de la Game Boy de Nintendo.[42]​[43]​ Fue lanzada en Asia en 1990 y distribuida en todo el mundo en 1991.\nAl igual que la Sega Game Gear, era de diseño horizontal y, al igual que la Game Boy, requería 4 pilas AA que permitían unas 20 horas de juego.[43]​ A diferencia de muchos clones asiáticos de la Game Boy, los componentes internos de la Gamate eran ensamblados profesionalmente, aunque se suministró dos tipos de pantalla a lo largo de su vida, y una de ellas era de una calidad claramente inferior.[44]​ Incluso para los estándares de la época, su pantalla era bastante difícil de usar, y sufría de problemas de desenfoque de movimiento similares a los de la primera generación de Game Boy. Probablemente a causa de este hecho las ventas fueron bastante pobres, y Bit Corp cerró en 1992.[45]​ Sin embargo, continuaron saliendo nuevos juegos para el mercado asiático durante varios años.\nCuriosamente, juegos para la Gamate fueron diseñados con sonido estéreo, pero la consola sólo estaba equipado con un altavoz mono. Para apreciar la gama de sonidos completa, los usuarios debían conectar unos auriculares.[43]​\nGame Gear\nLa Game Gear, desarrollada por Sega, fue la tercera consola portátil a color, tras la Lynx y la TurboExpress. Lanzada en Japón en 1990 y en América del Norte y Europa en 1991,[46]​[47]​ se basaba en la Master System, lo que facilitaba a los desarrolladores de juegos portar los de la gran biblioteca existente para la Master System a la Game Gear.[47]​ Aunque sin alcanzar nunca el nivel de éxito disfrutado por Nintendo, la Game Gear demostró ser uno de sus mayores competidores, y duró más que cualquiera de las otras rivales de la Game Boy.[48]​\nTras el éxito de Sega con la Game Gear, comenzaron el desarrollo de un sucesor durante la década de 1990, que pretendía ofrecer una interfaz de pantalla táctil, muchos años antes de la Nintendo DS. Sin embargo, esta tecnología era muy costosa por entonces, y se estimó que tendría que venderse a un precio de 289 dólares en el caso de que se desarrollase. Sega finalmente optó por dejar de lado la idea y lanzar la Nomad, una versión portátil de la Mega Drive (conocida en Estados Unidos como Genesis), como su sucesora.[49]​\nWatara Supervision\nLa Watara Supervision fue lanzada en 1992 por la compañía Watara como otro intento asiático de competir con bajos precios con la Game Boy.[50]​ El primer modelo diseñado era muy parecido a un Game Boy, aunque de color gris y tenía una pantalla ligeramente más grande.[51]​ El segundo modelo se realizó con una bisagra en el centro y podía doblarse ligeramente para proporcionar una mayor comodidad para el usuario. Aunque el sistema disfrutó de cierto éxito, nunca afectó a las ventas de Nintendo o Sega. Fue rediseñada en varias ocasiones, la última como Magnum Supervision, similar una Game Boy Pocket, lanzada en cantidades limitadas y disponible en tres colores: amarillo, verde y gris. Aunque Watara desarrolló muchos de los juegos por sí misma, recibía apoyo de terceros, sobre todo de la compañía taiwanesa Sachen.\nDisponía de un adaptador de TV tanto en formato PAL como NTSC que podrían transferir la paleta en blanco y negro de la Supervision a 4 colores, de forma similar en algunos aspectos al Super Game Boy de Nintendo.[51]​\nHartung Game Master\nThe Hartung Game Master es una consola de mano oscura lanzada en un punto desconocido a principios de la década de 1990. Sus gráficos eran mucho más bajos que la mayoría de sus contemporáneos, de complejidad similar al Atari 2600. Estaba disponible en negro, blanco y morado, y sus distribuidores, como Delplay, Videojet y Virella, lo marcaban con frecuencia.\nSe desconoce el número exacto de juegos lanzados, pero es probable que alrededor de los 20. El sistema aparece con mayor frecuencia en Europa y Australia.\n"}, {"name": "Finales de los años 1990", "text": "A finales de los años 1990 la falta de un desarrollo significativo en la línea de productos de Nintendo permitió que sistemas más avanzados, como la Neo Geo Pocket Color o la WonderSwan Color lograran un éxito moderado.\nSega NOMAD\nLa Nomad fue lanzado en octubre de 1995 en América del Norte solamente.[52]​[53]​  El lanzamiento fue cinco años después del sega Génesis, con una biblioteca existente de más de 500 juegos de Génesis. Según el exjefe de investigación y desarrollo de Sega of America, Joe Miller, el Nomad no estaba destinado a ser el reemplazo de Game Gear y cree que había poca planificación por parte de Sega de Japón para la nueva consola portail.[54]​ Sega fue compatible con cinco consolas diferentes: Saturn, Genesis, Game Gear, Pico, y el Master System, así como los complementos como Sega CD 32X\nEn Japón, el Mega Drive nunca tuvo éxito y el Saturn tuvo más éxito que el PlayStation de Sony, por lo que el CEO de Sega Enterprises, Hayao Nakayama, decidió centrarse en el Saturn.[55]​ En 1999, el Nomad se vendía a menos de un tercio de su precio original.[56]​\nGame Boy Pocket\nEn 1996, Nintendo lanzó el Game Boy Pocket: una unidad más pequeña y ligera que requería menos baterías. Tiene espacio para dos pilas AAA, que proporcionan aproximadamente 10 horas de juego.[57]​ La unidad también está equipada con un conector de CC de 3 voltios, 2.35 mm x 0.75 mm que se puede utilizar para alimentar el sistema. El Pocket tiene un puerto de link más pequeño, que requiere un adaptador para vincularse con la Game Boy anterior. El diseño del puerto se utiliza en todos los modelos posteriores de Game Boy, excepto Game Boy Micro. La pantalla se cambió a una verdadera pantalla en blanco y negro, en lugar de la pantalla monocromática \"sopa de guisantes\" del Game Boy original..[58]​ Además, el Game Boy Pocket (GBP) tiene una pantalla más grande que el Game Boy Color (GBC) que más tarde lo reemplazó. La pantalla GBP tiene una altura de 65 milímetros (2,56 pulgadas), 48,5 milímetros (1,91 pulgadas) de ancho y 43,5 milímetros (1,71 pulgadas) de altura, en comparación con un 59 milímetros (2,32 pulgadas). ) diagonal para el GBC. Aunque, al igual que su predecesor, el Game Boy Pocket no tiene retroiluminación para permitir el juego en un área oscura, mejoró notablemente la visibilidad y el tiempo de respuesta de los píxeles (la mayoría eliminando las imágenes gosting).[59]​ La primera versión no tenía un LED de encendido. Esto pronto se agregó debido a la demanda del público, junto con nuevas unidades de Game Boy Pocket de diferentes colores (lanzadas el 28 de abril de 1997), algunas de ellas nuevas en la línea Game Boy. Hubo varios Game Boy Pockets de edición limitada, incluyendo una unidad metálica Blue Ice y una modelo rosa exclusiva de Japón.[cita requerida] Game Boy Pocket no era una nueva plataforma de software, jugaba el mismo software que el modelo original de Game Boy.[60]​\nApareció también una  edición esqueleto de Famitsu en 1997, que tenía solo 5.000 unidades lanzadas, y una edición amarilla clara.[cita requerida]\nGame.com\nLa Game.com fue una consola de juegos portátil lanzada por la compañía estadounidense Tiger Electronics (posteriormente integrada en Hasbro) en 1997.[61]​ Ofrecía muchas novedades en el mundo de las consolas portátiles y estaba dirigido a un mercado objetivo de mayor edad, con características y funciones tipo PDA, como la pantalla táctil y el puntero,[48]​ aunque Tiger esperaba que desafiaría a la Game Boy y también ganaría seguidores entre los jugadores más jóvenes. A diferencia de otras consolas de juego portátiles, las primeras consolas Game.com incluían dos ranuras para cartuchos de juegos, algo que no volvería a darse hasta los lanzamientos de la Tapwave Zodiac, la Nintendo DS o la DS Lite, y podrían conectarse a un módem de 14,4 kbit/s.[61]​ Los modelos posteriores tenían una única ranura para cartuchos.\nGame Boy Color\nLa Game Boy Color, generalmente conocida como GBC, era la sucesora de Nintendo para la Game Boy. Fue lanzada el 21 de octubre de 1998 en Japón y en noviembre del mismo año en los Estados Unidos. Contaba con una pantalla a color, y era ligeramente más grande que la Game Boy Pocket. Su procesador era dos veces más rápido que el de la Game Boy y tenía el doble de memoria. También tenía un puerto de comunicaciones por infrarrojos para comunicación inalámbrica que no se incluyó en las versiones posteriores de la Game Boy, como la Game Boy Advance.\nLa Game Boy Color fue una respuesta a la presión de los desarrolladores de juegos que demandaban un nuevo sistema, pues consideraban que la Game Boy, incluso en su última iteración, la Game Boy Pocket, era insuficiente. El producto resultante fue la primera consola portátil retrocompatible de la historia, lo que le permitió aprovecharse del enorme catálogo de juegos de su predecesora. Esta característica se aplicó posteriormente a todas las consolas de la línea Game Boy, una gran ventaja sobre sus competidoras al contar de salida con un catálogo muy extenso y conocido de juegos en sus respectivos lanzamientos. A 31 de marzo de 2005, entre la Game Boy y Game Boy Color habían vendido más de 118 millones de unidades en todo el mundo.[34]​\nLa consola podía mostrar en pantalla hasta 56 colores diferentes al mismo tiempo de su paleta de 32.768, y podría añadir un sombreado básico de cuatro colores a los juegos que se habían desarrollado para la Game Boy original. También daba a los sprites y fondos colores diferentes, para un total de más de cuatro colores.\nPocketStation\nPocketStation es la primera consola portátil de Sony, y la predecesora de la PSP. Esta consola únicamente salió en Japón el día 23 de enero de 1999, era la competencia de Game Boy Color, y funcionaba como una memory card común de la PlayStation, y algunos juegos como Ridge Racer Type 4, Metal Gear Solid: Integral, Mega Man X6, etc., eran compatibles con ésta memoria, y a pesar de que fue un sistema muy innovador, lastimosamente no pudo vender lo suficientemente para ser exportado a nivel mundial. Aun así, en Latinoamérica y Europa se pueden encontrar algunas unidades de esta portátil. Tan solo vendió 5 millones de unidades en Japón, y fue descontinuada en el 2002.\nNeo Geo Pocket Color\nLa Neo Geo Pocket Color (NGPC) fue lanzada en marzo de 1999 en Japón y en agosto y octubre del mismo año en Estados Unidos y Europa, respectivamente. Fue una consola de juegos portátil de 16 bits a color diseñada por la japonesa SNK, el fabricante de la consola de sobremesa y arcade Neo-Geo. Fue la sucesora de la portátil monocroma Neo Geo Pocket que había lanzado SNK en 1998 en Japón. \nTras un inicio con unas buenas ventas en los EE. UU. y Japón, con 14 títulos en el momento de su lanzamiento (un récord en ese momento),[62]​ el bajo apoyo a las ventas al por menor en EE. UU.,[63]​ la falta de comunicación con los desarrolladores de terceros por la administración estadounidense de SNK,[64]​ el extraordinario éxito de la franquicia Pokémon de Nintendo,[65]​ la anticipación de los 32 bits de la Game Boy Advance,[65]​ así como la fuerte competencia de la WonderSwan de Bandai en Japón, dio lugar a una fuerte disminución de las ventas en ambas regiones.[66]​\nFue la última consola de videojuegos de SNK, ya que la empresa se declaró en quiebra el 22 de octubre de 2001.[67]​[66]​\n"}, {"name": "Años 2000", "text": "WonderSwan Color\nLa WonderSwan Color fue una consola de juegos portátil diseñada por empresa de juguetes japonesa Bandai. Fue lanzada el 9 de diciembre de 2000 en Japón,[68]​ y tuvo un éxito moderado.\nLa WonderSwan original tenía una pantalla en blanco y negro. Aunque la WonderSwan Color era un poco más grande y más pesada (7 mm y 2 g) en comparación con la WonderSwan original, la versión en color contaba con 512 kB de RAM y una pantalla LCD a color más grande.[69]​ Sus juegos eran compatibles con la WonderSwan original.\nAntes del lanzamiento de la WonderSwan, Nintendo tenía prácticamente un monopolio en el mercado japonés de las portátiles de videojuegos. Tras el lanzamiento de la WonderSwan, Bandai se hizo con aproximadamente el 8% de la cuota de mercado en Japón, en parte debido a su bajo precio, de 6800 yenes (unos 65 dólares).[69]​\nOtra razón del éxito de la WonderSwan en Japón fue el hecho de que Bandai logró llegar a un acuerdo con Squaresoft para portar los juegos originales de Final Fantasy para la NES con gráficos y controles mejorados.[69]​ Sin embargo, con la llegada de la Game Boy Advance en marzo de 2001 y la reconciliación entre Squaresoft y Nintendo, la WonderSwan Color y su sucesora, la SwanCrystal, perdieron rápidamente su ventaja competitiva.[70]​\n"}, {"name": "Principios de los años 2000", "text": "El mercado de las videoconsolas portátiles al inicio de los años 2000 estuvo dominado sobre todo por Nintendo con su Game Boy Advance. En 2003 Nokia lanzó el N-Gage, un intento fallido de combinación entre consola portátil y teléfono móvil .\nGame Boy Advance\nEn 2001 Nintendo lanzó la Game Boy Advance, conocida generalmente como GBA, de formato horizontal y que añadía dos botones laterales, una pantalla más grande y mayor potencia de proceso que la Game Boy Color.\nSu diseño fue revisado y el resultado fue la Game Boy Advance SP, lanzada en marzo de 2003. Al igual que la GBA, era totalmente retrocompatible con sus antecesoras de la serie Game Boy, pero la SP tenía ofrecía un diseño bastante distinto del inicial, más compacto y plegable del tipo clamshell, y con algunas novedades, como la batería de ion de litio recargable y pantalla a color con iluminación frontal. Aunque al plegarse tenía la mitad de tamaño que la GBA original, la pantalla seguía siendo del mismo tamaño. \nEn 2005 se lanzó otra de sus iteraciones, la Game Boy Micro. En esta revisión se sacrificó tamaño de pantalla y la compatibilidad con sus antecesoras, para a cambio conseguir una notable reducción de tamaño total.\nLa GBA también introdujo el concepto novedoso: la posibilidad de conectarse mediante un cable opcional con la GameCube, lo que le permitía compartir información entre ambas y la posibilidad de utilizar el sistema portátil como un controlador de consola. Muchos juegos permitían utilizar esta función, como Animal Crossing, Pac-Man Vs., Final Fantasy Crystal Chronicles, The Legend of Zelda: Four Swords Adventures, The Legend of Zelda: The Wind Waker, Metroid Prime o Sonic Adventure 2: Battle.\nAl igual que sus antecesoras, fue un notable éxito comercial. A 31 de diciembre de 2007, la GBA, la GBA SP y la Game Boy Micro habían vendido en conjunto más de 80 millones de unidades en todo el mundo.[71]​\nGame Park 32\nLa Game Park 32 original, denominada habitualmente GP32, fue lanzada en noviembre de 2001 por la compañía surcoreana Game Park, y distribuida inicialmente solo en ese país. Contaba con una CPU ARM920 de 32 bits a 40-133 MHz, 8 MB de memoria RAM y una pantalla algo más grande que una GBA. Además contaba con reproductor de MP3 y DivX y lector de libros electrónicos. Como almacenamiento utilizaba tarjetas SmartMedia, con una capacidad de hasta 128 MB, o información descargada a través de un cable USB desde un ordenador personal.[72]​\nSe lanzaron tres versiones, cuya diferencia estaba fundamentalmente en la iluminación de la pantalla. La primera versión se denominó GP32 NLU, y carecía de iluminación. Fue rediseñada en 2003, añadiéndole una pantalla con iluminación frontal, bajo la denominación GP32 FLU. En verano de 2004 salió la GP32 BLU, esta vez con pantalla retroiluminada. Esta última se diseñó para su lanzamiento en Europa.[72]​\nAunque no fue un éxito comercial al nivel de los dispositivos portátiles convencionales, su mayor virtud fue que era de código abierto y, a diferencia de otros sistemas portátiles que utilizaban cartuchos patentados, la GP32 utilizaba tarjetas SmartMedia para almacenar programas y datos, y aunque disponía de unos pocos juegos comerciales se hizo sobre todo muy popular por los emuladores de consolas clásicas de 16 bits como la Mega Drive, la Super Nintendo o la NES y entre los desarrolladores aficionados que programaban sus propios juegos, especialmente en Visual C++.[73]​[72]​\nN-Gage\nEn octubre de 2003 la compañía finlandesa de comunicaciones Nokia lanzó el N-Gage. Fue diseñado como una combinación de teléfono móvil, PDA, reproductor de MP3, radio y dispositivo de juegos.\nEl sistema recibió muchas críticas por defectos en su diseño, como su pantalla con orientación vertical y la necesidad de retirar la batería para cambiar los cartuchos de juegos y, en su función como teléfono móvil, sobre todo porque el altavoz y el micrófono estaban situados en el lateral del terminal, no en su frontal, por lo que se tenía que hablar con el teléfono de lado, dando nacimiento a un fenómeno conocido como sidetalking.[74]​\nPara intentar solucionar algunos de estos problemas, en abril de 2004, tan solo seis meses después de su lanzamiento inicial, se puso a la venta el N-Gage QD. En este modelo se integró el micrófono y el altavoz en el frontal y se cambió su diseño a uno más redondeado, aunque se eliminaba la radio, el reproductor MP3 y la conexión USB. Sin embargo, aunque tuvo un éxito moderado en Europa, fue un fracaso comercial a nivel global.[75]​\nCybiko\nCybiko es una consola portátil rusa presentada en mayo de 2000 por la compañía de David Yang y diseñada para el público adolescente, con su propio sistema de mensajes de texto de radio bidireccional. Tiene más de 430 juegos y aplicaciones freeware \"oficiales\". Debido al sistema de mensajes de texto, presenta un teclado QWERTY que se usa con un lápiz. Se realizó un complemento de reproductor de MP3 para la unidad y un lector de tarjetas SmartMedia. La compañía dejó de fabricar las unidades después de dos versiones de productos y solo unos pocos años en el mercado. Los Cybikos se pueden comunicar entre sí hasta un alcance máximo de 300 metros (0,19 millas). Varios Cybikos pueden chatear entre sí en una sala de chat inalámbrica.\nCybiko Classic:\nHubo dos modelos del Clásico Cybiko. Visualmente, la única diferencia era que la versión original tenía un interruptor de encendido en el costado, mientras que la versión actualizada usaba la tecla \"escape\" para la administración de energía. Internamente, las diferencias entre los dos modelos se encontraban en la memoria interna y la ubicación del firmware.\nCybiko Xtreme:\nCybiko Xtreme era la consola de mano de Cybiko de segunda generación. Presentaba varias mejoras sobre el Cybiko original, como un procesador más rápido, más RAM, más ROM, un nuevo sistema operativo, un nuevo diseño de teclado y caja, mayor alcance inalámbrico, un micrófono, una salida de audio mejorada y un tamaño más pequeño.\nTapwave Zodiac\nLa Tapwave Zodiac fue una PDA y consola portátil lanzada por la compañía estadounidense Tapwave en octubre de 2003.\nUtilizaba una CPU Motorola i.MX1 ARM9 a 200 MHz y un chip gráfico ATI Imageon W4200. Estaba disponible inicialmente en dos modelos, la Zodiac 1, de 32MB, y la Zodiac 2, de 128 MB. Contaba además con reproductor de música, fotos y vídeos.\nDispuso de algunos títulos de juegos destacables, como Tony Hawk's Pro Skater 4, desarrollado por Neversoft y distribuido por Activision, Spy Hunter de Midway, Doom II: Hell on Earth de id Software, Golden Axe III y Altered Beast de Sega o Duke Nukem Mobile de 3D Realms.\nAunque recibió numerosos premios de la industria del sector, su distribución y soporte finalizó en julio de 2005.[76]​\n"}, {"name": "Finales de los años 2000", "text": "El año 2004 vio el lanzamiento de dos de las consolas de mayor éxito, la PlayStation Portable de Sony y, sobre todo, la Nintendo DS, la segunda videoconsola más vendida de la historia, y la primera portátil, solo superada por una consola de sobremesa, la PlayStation 2.\nNintendo DS\nLa Nintendo DS fue anunciada a finales de 2003 y salió al mercado en noviembre de 2004. Era una consola de 64 bits que ofrecía nuevas características, como la incorporación de dos pantallas, una de ellas táctil, conectividad inalámbrica y micrófono.\nLa pantalla inferior es sensible al tacto, diseñada para ser presionada con un puntero, con el dedo o con una pequeña almohadilla de plástico unida a la correa muñeca de la consola que se colocaba en el pulgar. Dispone de cuatro botones frontales, dos laterales, una cruceta y los botones «Select» y «Start». La consola también cuenta con capacidades en línea a través de la conexión Wi-Fi de Nintendo o otras redes inalámbricas, con posibilidad de jugar con hasta 16 jugadores en los juegos que disponían de la opción multijugador. Es retrocompatible con todos los juegos de Game Boy Advance, pero no con los juegos diseñados para la Game Boy o Game Boy Color.\nEn marzo de 2006 Nintendo lanzó en Japón una versión actualizada, la DS Lite, con diversos cambios en su diseño exterior, de menor tamaño (un 42 % más pequeña y un 21 % más ligera), mayor duración de la batería y pantallas más brillantes y de mayor calidad, con brillo ajustable. También ofrecía la posibilidad de conectarse de forma inalámbrica con la consola de sobremesa Wii.\nEn noviembre de 2008 en Japón, y en abril de 2009 en Estados Unidos y Europa, se lanzó la Nintendo DSi, con pantallas de 3,25 pulgadas y dos cámaras integradas. Disponía de una ranura para tarjetas SD de almacenamiento en lugar de la ranura de la Game Boy Advance, además de la memoria flash interna para almacenar juegos descargados.\nLa DS fue uno de los mayores éxitos comerciales de Nintendo, llegando a convertirse en la segunda videoconsola más vendida de todos los tiempos (marzo de 2016), y la primera portátil, con más de 154 millones de unidades vendidas incluyendo sus iteraciones posteriores, y solo superada por una consola de sobremesa, la PlayStation 2 de Sony.[34]​[77]​\nGame King\nEl GameKing es una consola  portátil lanzada por la compañía china TimeTop   El primer modelo lanzado en 2004. aunque original en diseño, tiene una gran parecido con la Game Boy Advance de Nintendo. Se cree que el segundo modelo, el GameKing 2, está inspirado en la PSP de Sony.[78]​ Este modelo también se actualizó con una pantalla retroiluminada, con un fondo que distrae (que se puede eliminar abriendo la consola).  el GameKing 3 fue el único modelo a color. pero solo se fabricó durante un tiempo breve y fue difícil de comprar fuera de Asia, Ya sea intencionalmente o no, el GameKing tiene los gráficos más primitivos de cualquier consola portátil lanzada desde el Game Boy de 1989.. [cita requerida]\nComo muchos de los juegos tienen una simplicidad \"de la vieja escuela\", el dispositivo ha desarrollado un pequeño seguimiento de culto. El parlante de Gameking es bastante ruidoso y los sofisticados bucles de sonido de los cartuchos (tomados de otras fuentes) están aparentemente en desacuerdo con sus gráficos primitivos.\nTimeTop creó al menos un dispositivo adicional etiquetado como \"GameKing\", pero si bien parece poseer gráficos más avanzados, es esencialmente un emulador que reproduce un puñado de multicards (como el GB Station Light II). Fuera de Asia (especialmente China), sin embargo, el Gameking sigue siendo relativamente inaudito debido a la perdurable popularidad de los dispositivos portátiles japoneses como los fabricados por Nintendo y Sony.\nPlayStation Portable\nLa PlayStation Portable, oficialmente abreviada como PSP,[79]​ es una consola de juegos portátil fabricada y comercializada por la empresa japonesa Sony Computer Entertainment.[80]​ El desarrollo de la consola fue anunciado por primera vez durante la Electronic Entertainment Expo de 2003,[81]​ y se presentó en mayo de 2004, en una conferencia de prensa de Sony antes de la Electronic Entertainment Expo de 2004.[82]​ El sistema fue lanzado en Japón el 12 de diciembre de 2004, en América del Norte en marzo de 2005, y en la región PAL en septiembre de 2005.[83]​[84]​[85]​\nFue la principal competidora de la Nintendo DS, y ofrecía varias mejoras tecnológicas sobre las demás portátiles del momento. La PSP fue la primera videoconsola portátil en utilizar un formato de disco óptico, el Universal Media Disc (UMD), como soporte para la distribución de sus juegos.[86]​ También se distribuyeron mediante discos UMD películas y programas de televisión. La PSP utiliza el formato Memory Stick Pro Duo de Sony/SanDisk como su principal medio de almacenamiento.[87]​[88]​ Otras de sus características distintivas son su gran pantalla de visualización, de 4,3 pulgadas, sus capacidades multimedia, y la conectividad con la consola de sobremesa PlayStation 3, otras PSP e Internet.[89]​[90]​[91]​[92]​\nEn 2007 Sony lanzó una versión ligera de la PSP, la PlayStation Portable Slim & Lite, y en 2008 la PSP 3000, con una pantalla de mayor definición y contraste respecto a la PSP Slim y un micrófono.\nGizmondo\nLa Gizmondo, de la compañía sueca Tiger Telematics, aunque se anunció para todo el mundo fue lanzada en el año 2005 solamente en el Reino Unido y en Estados Unidos. Esta videoconsola portátil estaba diseñada también para reproducir música y películas, contaba con una cámara de 1,3 megapíxeles para tomar y almacenar fotos, y disponía de funciones GPS y conexión a Internet. Ofrecía una alta calidad de gráficos gracias a su procesador ARM9 a 400Mhz como CPU y un chip NVIDIA dedicado exclusivamente para aceleración 2D y 3D, algo poco habitual en la época, con una pantalla de 2,8 pulgadas a una resolución de 320×240.[93]​ También podían enviarse SMS y MMS mediante GPRS. En su lanzamiento se indicaba que dispondría de correo electrónico, pero nunca llegó a estar disponible.\nA pesar de ser técnicamente avanzada en su época y contar con unas buenas expectativas iniciales para algunos medios de la época,[94]​ con solamente unas 25 000 unidades vendidas fue un gran fracaso comercial, llegando a ser calificada por la revista GamePro como la videoconsola portátil de mayor fracaso de la historia.[48]​ Tiger Telematics, acusada de la vinculación de miembros de su equipo directivo al mundo del crimen, se declaró en bancarrota a principios del 2006, por lo que se abandonó la producción de la consola, cancelando los juegos que habían proyectado.[95]​[93]​[96]​\nGP2X\nLa GP2X era una videoconsola portátil de código abierto basada en Linux lanzada por la compañía GamePark Holdings (creada por antiguos empleados de Game Park) en 2005 solo en Corea del Sur, diseñada tanto para desarrolladores de homebrew como para desarrolladores comerciales. Se utilizó sobre todo para ejecutar emuladores de consolas de juegos como Neo-Geo, Mega Drive, Master System, Sega Game Gear, NES, PC Engine o MAME.[97]​\nEn octubre de 2007 salió al mercado un nuevo modelo, la GP2X F-200, con pantalla táctil QVGA y se reemplazó el stick por una cruceta de 8 direcciones además de incluir soporte para tarjetas de memoria SDHC de hasta 32 GB. En 2009 se lanzó la GP2X Wiz y en 2010 la GP2X Caanoo.\nDingoo\nLa Dingoo es una videoconsola portátil de bajo precio, pequeño tamaño y de desarrollo abierto de la empresa china Dingoo Digital. Se lanzó en el año 2009 y cuenta con múltiples capacidades multimedia y de emulación.[98]​\nCon la instalación de Dingux, un Linux adaptado a la Dingoo A-320, su pueden instalar gran número de programas y emuladores de muchas consolas, de los que ya trae por defecto instalados los de GBA, NES, Neo-Geo, SNES, CPS 1, CPS 2 y Mega Drive.[99]​\nCuenta con una CPU Ingenic JZ4732 a 336 MHz, 32 MB de RAM, almacenamiento interno de 4 GB, ranura de tarjetas miniSD/SDHC, micrófono integrado, cruceta de control, cuatro botones en el frontal, dos superiores (L y R) y los de «Select» y «Start».[99]​\nTras el modelo inicial, el A-320, Dingo Digital desarrolló los modelos A-320, A-330 (también conocido como Geimi), A-360 y A-380.\nPSP Go\nLa PSP Go es una versión de la consola de juegos portátil PlayStation Portable fabricada por Sony. Fue lanzada el 1 de octubre de 2009 en Europa y América y el 1 de noviembre en Japón. Se presentó antes de la E3 2009 a través de Qore, la revista en línea de la PlayStation Network de Sony.\nSu diseño es significativamente diferente de las anteriores iteraciones de la PSP, aunque esta no es la única diferencia. Una de las principales es que no cuenta con una unidad de discos ópticos UMD sino que tiene 16 GB de memoria flash interna para almacenar juegos, vídeos, imágenes y otros medios, capacidad ampliable hasta los 32 GB utilizando una tarjeta de memoria Memory Stick Micro (M2). Otra diferencia con sus antecesoras es que la batería recargable de la PSP Go no es extraíble o reemplazable por el usuario. La pantalla es de 3,8 pulgadas con una resolución de 480×272, frente a las 4,3 pulgadas de las anteriores. El principal cambio en el diseño es que la pantalla se pliega y se desliza hacia arriba para mostrar los controles principales, de forma similar y con el mismo mecanismo de deslizamiento que La forma global y mecanismo de deslizamiento son similares a la del dispositivo Sony mylo.\nPandora\nPandora es un híbrido de videoconsola portátil, PC Ultra Móvil y PDA diseñado para aprovechar el software de código abierto existente para el desarrollo homebrew. Su sistema operativo es una distribución completa de Linux, y en su funcionalidad es como un pequeño ordenador ( teclado QWERTY incluido) con controles de juego.[100]​ Fue desarrollado por OpenPandora, empresa compuesta por antiguos distribuidores y miembros de la comunidad de las videoconsolas portátiles GP32 y GP2X, aunque a diferencias de estas, no se fabrica en China, sino en el Reino Unido y Alemania.[100]​\nOpenPandora comenzó a aceptar pedidos previos para un lote inicial de 4000 dispositivos en noviembre de 2008 y, tras varios retrasos en su fabricación, comenzó a enviarlos a los clientes el 21 de mayo de 2010.[101]​[102]​ Se lanzaron varios modelos de la serie, como el Pandora Classic, el Pandora Rebirth y el Pandora 1GHz.[103]​\n"}, {"name": "Años 2010", "text": "Nintendo 3DS\nLa 3DS es la sucesora de la Nintendo DS. Fue lanzada a principios de 2011, y su característica principal es poder mostrar gráficos en 3D sin necesidad de gafas especiales, gracias a la autoestereoscopia.[104]​\nEs retrocompatible con la Nintendo DS[nota 1]​ y con el software de DSiWare.[104]​ Dispone de un servicio en línea denominado Nintendo eShop, que permite a los usuarios descargar juegos, demos, aplicaciones e información sobre próximas películas y lanzamiento de juegos.\nTras su lanzamiento inicial se han desarrollado varias iteraciones. En 2012 se lanzó la 3DS XL, un modelo de mayor tamaño.[105]​ En 2013 se lanzó la 2DS, un modelo que no se pliega, a diferencia de todos los modelos anteriores de la serie DS, y que permite jugar todos los juegos de la DS y la 3DS pero solo en formato 2D (de ahí su nombre), al carecer de la función de autoestereoscopia.[106]​ En 2014 apareció la New Nintendo 3DS, con un procesador más potente, un segundo stick analógido (C-Stick), dos botones adicionales (ZR y ZL), mejoras en la visualización del 3D, soporte para tarjetas microSD y tecnología NFC, además de algunos cambios menores de diseño.[107]​[108]​ Al igual que la 3DS original, la New 3DS también tiene una variante de mayor tamaño, la New Nintendo 3DS XL.\nXperia Play\nEl Xperia PLAY es un teléfono inteligente y videoconsola portátil desarrollada por Sony Mobile (antes Sony Ericsson) dentro de su gama Xperia. Salió al mercado a principios de 2011.\nEl dispositivo funciona con Android 2.3, y fue el primero en formar parte del programa de certificación de PlayStation, lo que le permite jugar a juegos del framework PlayStation Mobile (antes PlayStation Suite). El dispositivo es un teléfono en formato horizontal deslizante, de forma similar al PSP Go. El control deslizante cuenta con una cruceta en la parte izquierda, un conjunto de botones estándar de PlayStation estándar(, ,  y ) a la derecha, un gran panel táctil rectangular en el medio, un botón de menú en la esquina inferior izquierda y dos botones laterales (L y R) en la parte posterior del dispositivo. Cuenta con un procesador Qualcomm Snapdragon a 1 GHz, una GPU Qualcomm Adreno 205, una pantalla de 4,0 pulgadas con una resolución 854×480, una cámara de 8 megapíxeles, 512 MB de RAM, memoria interna de 8 GB y un conector microUSB. Es compatible con tarjetas microSD, a diferencia de las variantes de Memory Stick que utilizan las consolas PSP.\nPlayStation Vita\nLa PlayStation Vita, conocida generalmente como PS Vita, es la sucesora de la PlayStation Portable, y la tercera y última consola portátil de Sony. Desarrollada por Sony, además de que fue la primera consola de la mencionada compañía, en ser creada por Mark Cerny, se lanzó en Japón en diciembre de 2011 y en el resto del mundo en febrero de 2012.\nEl sistema presenta una forma ovalada similar al diseño de la primera PSP, con una pantalla capacitiva de 5 pulgadas OLED multitáctil. Tiene dos sticks análogos, una cruceta, los cuatro botones clásicos de la PlayStation y dos botones (L y R). Su CPU es un ARM Cortex-A9 (Quad Core) a 444 MHz y su GPU un SGX543MP4+ (4 núcleos) a 400 MHz. El sistema también dispone de panel táctil trasero, una cámara frontal y otra trasera, micrófono, sistema sensor de movimiento de seis ejes, brújula electrónica de tres ejes, GPS, wifi, 3G y Bluetooth.[109]​[110]​\nAunque se vio bastante innovadora, desafortunadamente ninguna desarrolladora logró aprovechar su potencia, y no solo le dieron muy poco apoyo, sino que el apoyo que le dieron fue bastante vergonzoso, y Sony descontinuó la consola a nivel mundial en el 2019. Dejando de lado el mercado portátil, después de que sus portátiles fracasarán en frente de la Game Boy Color, Nintendo DS, y Nintendo 3DS, provocando que Sony ya no se enfocara en consola de mano.\nRazer Switchblade\nEl Razer Switchblade era un prototipo  de una consola portátil como un Nintendo DSi XL diseñado para ejecutar Windows 7, presentaba una pantalla LCD multitáctil y un teclado adaptable que cambiaba las teclas según el juego que jugabas. También iba contar con un mouse completo.\nSe presentó por primera vez el 5 de enero de 2011, en Consumer Electronics Show (CES). The Switchblade ganó el premio The Best of CES 2011 People's Voice. Desde entonces ha estado en desarrollo y la fecha de lanzamiento aún se desconoce. El dispositivo probablemente ha sido suspendido indefinidamente.\nNvidia Shield\nProject Shield es un sistema portátil desarrollado por Nvidia y anunciado en CES 2013. Se ejecuta en Android 4.2 y utiliza Nvidia Tegra 4 SoC. El hardware incluye una pantalla multitáctil de 5 pulgadas con soporte para gráficos HD (720p). La consola permite la transmisión de juegos que se ejecutan en una PC de escritorio o portátil compatible.\nNintendo Switch\nLa consola está diseñada para usarse como consola de sobremesa y consola portátil, su diseño es similar a una tablet y se le pueden acoplar los Joy-Con (Mandos de la consola) para usarse como consola portátil, también se puede conectar a un televisor para usarse como consola de sobremesa.\nLos Joy-Con incluyen cada uno un joystick, cuatro botones al frente y dos en la parte de arriba, el Joy-Con izquierdo cuenta con el botón Select y el botón Share (Similar al del Dualshock 4), y el Joy-Con derecho tiene el botón Start y el botón Home, ambos controles se pueden usar individualmente para 2 jugadores, los Joy-Con poseen sensor de movimiento como el Wiimote.\n"}, {"name": "Años 2020", "text": "Steam Deck\nLa Steam Deck es un PC de juegos portátil desarrollado por Valve Corporation. Lanzado el 25 de febrero de 2022, Steam Deck se puede usar como PC portátil o de sobremesa usando un monitor externo. Algo parecido a lo que ofrecen los PC portátiles, aunque con un factor forma distinto. El dispositivo está diseñada para soportar gran parte de la biblioteca de Steam utilizando SteamOS, un sistema operativo que estriba en un kernel Debian​. Esto permite el soporte de un gran número de juegos de PC de Windows a través de la capa de compatibilidad Proton utilizando Linux. El sistema es una plataforma abierta, permitiendo a los usuarios instalar otros juegos compatibles con el dispositivo o incluso otros sistemas operativos.\n"}]}, {"name": "Véase también", "text": "Videoconsola\nAnexo:Consolas de videojuegos más vendidas\n", "subsections": []}, {"name": "Nota aclaratoria", "text": "↑ Sin embargo su emulador Citra no es compatible con archivos DS.\n", "subsections": []}, {"name": "Referencias", "text": "↑ Li, Frederick W. B. (2008). «Computer Games». Wiley Encyclopedia of Computer Science and Engineering (Durham University): 4. \n↑ a b c Steinbock, Dan; Wilson, Johnny L. (2007). The Mobile Revolution. Kogan Page. p. 150. ISBN 978-0-7494-4850-9. \n↑ a b Loguidice, Bill; Barton, Matt (15 de agosto de 2008). «A History of Gaming Platforms: Mattel Intellivision». Gamasutra. Consultado el 16 de julio de 2016. \n↑ a b Demaria, Rusel; Wilson, Johnny L. (2002). High Score! The Illustrated History of Video games. McGraw-Hill. pp. 31-32. ISBN 978-0-07-222428-3. \n↑ Marriott, Scott Alan. «Milton Bradley Microvision». AllGame. Archivado desde el original el 14 de noviembre de 2014. Consultado el 16 de julio de 2016. \n↑ a b Wolf, Mark J. P. (2012). Encyclopedia of Video Games: The Culture, Technology, and Art of Gaming 2. ABC-CLIO. p. 298. ISBN 031337936X. \n↑ Vincent, James (21 de abril de 2014). «The Game Boy turns 25: How a 'grey brick' took over the world of portable gaming». The Independent. Consultado el 16 de julio de 2016. \n↑ Patsuris, Penelope (7 de junio de 2004). «Sony PSP Vs. Nintendo DS». Forbes. Consultado el 16 de julio de 2016. \n↑ Hutsko, Joe (25 de marzo de 2000). «88 Million and Counting; Nintendo Remains King of the Handheld Game Players». The New York Times. Consultado el 16 de julio de 2016. \n↑ «Global unit sales of current generation video game consoles from 2008 to 2015». Statista. Consultado el 16 de julio de 2016. \n↑ Demaria, Rusel; Wilson, Johnny L. (2002). High Score! The Illustrated History of Video games. McGraw-Hill. p. 30. ISBN 978-0-07-222428-3. \n↑ a b c Demaria, Rusel; Wilson, Johnny L. (2002). High Score! The Illustrated History of Video games. McGraw-Hill. p. 30. ISBN 978-0-07-222428-3. \n↑ Jensen, Kris (enero de 1978). «New 1978 Electronic Games». Popular Electronics: 33-43. Consultado el 16 de julio de 2016. \n↑ Morgan, Rik (2008). «Cragstan Periscope-Firing Range». Handheld Museum. Consultado el 16 de agosto de 2016. \n↑ «Optoelectronics Arrives». Time 99 (14). 3 de abril de 1972. Archivado desde el original el 21 de julio de 2013. Consultado el 16 de julio de 2016. \n↑ Morgan, Rik (2008). «Interview with Howard Cohen». Handheld Museum. Consultado el 16 de julio de 2016. \n↑ Kent, Steven (2001). The Ultimate History of Video Games. Prima Publishing. p. 200. ISBN 978-0-7615-3643-7. \n↑ Parish, Jeremy (28 de marzo de 2005). «PSPredecessors». 1UP.com. Archivado desde el original el 21 de julio de 2016. Consultado el 16 de julio de 2016. \n↑ «Mattel's Football (I) (1977, LED, 9 Volt, Model# 2024)». handheldmuseum.com. Consultado el 16 de julio de 2016. \n↑ «Mattel Electronics Football». Retroland. Archivado desde el original el 10 de julio de 2020. Consultado el 16 de julio de 2016. \n↑ «Winners of 59th Technology & Engineering Emmy Awards Announced by National Television Academy at Consumer Electronics Show». National Television Academy of Television Arts and Sciences. 1 de enero de 2008. Archivado desde el original el 21 de julio de 2016. Consultado el 16 de julio de 2016. \n↑ Herman, Leonard (2001). Phoenix: The Rise and Fall Of Video Games. Rolenta Press. p. 42. ISBN 0-9643848-5-X. \n↑ Silvester, Niko. «Sony's PlayStation Portable and Milton Bradley's Microvision - The PSP and the History of Handheld Video Gaming, Part 2». about.com. Archivado desde el original el 6 de agosto de 2020. Consultado el 16 de julio de 2016. \n↑ Morgan, Rik (2008). «CosmiHunter». Handheld Museum. Consultado el 16 de julio de 2016. \n↑ Crigger, Lara (6 de marzo de 2007). «The Escapist: Searching for Gunpei Yokoi». Escapistmagazine.com. Archivado desde el original el 13 de febrero de 2014. Consultado el 17 de julio de 2016. \n↑ Pollack, Andrew (9 de octubre de 1997). «Gunpei Yokoi, Chief Designer Of Game Boy, Is Dead at 56». The New York Times. Consultado el 17 de julio de 2016. \n↑ Sheff, David (1999). Game Over: Press Start to Continue. GamePress. p. 28. ISBN 978-0-9669617-0-6. \n↑ Buchanan, Levi (10 de septiembre de 2009). «From Janitor to Superstar Gunpei Yokoi, inventor of the Game Boy, would have been 67 this week». IGN. Consultado el 17 de julio de 2016. \n↑ Pfau, Jeffrey (2008). «The Game Controller: From the Beginning». 13 Things. Joukowsky Institute for Archaeology and the Ancient World. Brown University. Consultado el 17 de julio de 2016. \n↑ Natapov, D.; MacKenzie, I. S. (2010). «The trackball controller: Improving the analog stick» (PDF). Proceedings of the 2010 Conference on FuturePlay (New York: ACM): 175-182. \n↑ Sheff, David (1999). Game Over: Press Start to Continue. GamePress. p. 294. ISBN 978-0-9669617-0-6. \n↑ a b Davey Winder (1 de octubre de 2010). «The top ten retro gaming secrets». Alphr. Consultado el 17 de julio de 2016. \n↑ Ethan C. Nobles (22 de enero de 2011). «Game Boy — Nintendo dominates the portable market». First Arkansas News. Archivado desde el original el 23 de enero de 2011. Consultado el 17 de julio de 2016. \n↑ a b c «Historical Data: Consolidated Sales Transition by Region» (PDF). Nintendo. 27 de abril de 2016. Consultado el 17 de julio de 2016. \n↑ Lesser, Hartley; Lesser, Patricia; Lesser, Kirk (marzo de 1990). «The Role of Computers». Dragon (155): 95-101. \n↑ Mark Langshaw (27 de enero de 2013). «Atari retrospective: The rise and fall of a gaming giant». Digital Spy. Consultado el 17 de julio de 2017. \n↑ Steven Kent (5 de enero de 1995). «Virtual Fun - Nintendo Adds A New Dimension To Games». Seattle Times. Consultado el 17 de julio de 2017. \n↑ «Atari Lynx - Games and Accessories». Songbird Productions Online Catalog. 14 de julio de 2016. Archivado desde el original el 7 de julio de 2016. Consultado el 16 de julio de 2016. \n↑ a b Cyril Lachel (22 de febrero de 2012). «The TurboExpress Has Won the War». A Brief History of Gaming. Defunct Games. Consultado el 18 de julio de 2016. \n↑ a b Demaria, Rusel; Wilson, Johnny L. (2002). High Score! The Illustrated History of Video games. McGraw-Hill. pp. 234-235. ISBN 978-0-07-222428-3. \n↑ Roe R. Adams III (enero de 1991). «Firing Up the TurboExpress. NEC's Hot New Hand-Held System». Computer Gaming World (78): 64. \n↑ «Gamate. Compact Video Game System». Neo Fuji. Taizou. Consultado el 19 de julio de 2016. \n↑ a b c «Collector's Guide to the Bitcorp Gamate Handheld». RetroCollect. 20 de marzo de 2011. Archivado desde el original el 1 de julio de 2016. Consultado el 19 de julio de 2016. \n↑ «Gamate. Hardware». Neo Fuji. Taizou. Consultado el 18 de julio de 2016. \n↑ «Gamate. Bit Corporation». Neo Fuji. Taizou. Consultado el 19 de julio de 2016. \n↑ Forster, Winnie (2005). The Encyclopedia of Game.Machines: Consoles, Handhelds, and Home Computers 1972-2005. p. 139. ISBN 3-0001-5359-4. \n↑ a b «Retroinspection: Sega Game Gear». Retro Gamer Magazine (Imagine Publishing Ltd.) (41): 78-85. 2009. \n↑ a b c Snow, Blake (30 de julio de 2007). «The 10 Worst-Selling Handhelds of All Time». GamePro.com. Archivado desde el original el 18 de septiembre de 2008. Consultado el 19 de julio de 2016. \n↑ Travis Fahs (21 de abril de 2009). «IGN Presents the History of SEGA». IGN. p. 7. Consultado el 19 de julio de 2016. \n↑ «Retro Console Review: Quickshot / Watara Supervision». RetroCollect. 5 de febrero de 2011. Archivado desde el original el 16 de octubre de 2015. Consultado el 19 de julio de 2016. \n↑ a b «SuperVision Systems and Accessories». Syd Bolton's «World's First Supervision Page». Consultado el 19 de julio de 2016. \n↑ Snow, Blake (30 de julio de 2007). «The 10 Worst-Selling Handhelds of All Time». GamePro. Archivado desde el original el 12 de octubre de 2007. Consultado el 17 de enero de 2008. \n↑ Marriott, Scott Alan. «Sega Genesis Nomad - Overview». Allgame. Archivado desde el original el 14 de noviembre de 2014. Consultado el 18 de octubre de 2013. \n↑ Horowitz, Ken (7 de febrero de 2013). «Interview: Joe Miller». Sega-16. Consultado el 17 de noviembre de 2013. \n↑ Kent, Steven L. (2001). The Ultimate History of Video Games: The Story Behind the Craze that Touched our Lives and Changed the World. Roseville, California: Prima Publishing. pp. 508, 531. ISBN 0-7615-3643-4. \n↑ Retro Gamer staff. «Retroinspection: Sega Nomad». Retro Gamer (Imagine Publishing) (69): 46-53. \n↑ «The Incredible Shrinking Game Boy Pocket». Electronic Gaming Monthly (Ziff Davis) (84): 16. July 1996. \n↑ «Game Boy Relaunched». Next Generation (Imagine Media) (20): 26. August 1996. \n↑ «Pocket Cool». Electronic Gaming Monthly (Ziff Davis) (89): 204. December 1996. \n↑ «Show Notes». GamePro (IDG) (95): 16. August 1996. \n↑ a b Dave Beuscher. «game.com Biography». AllGame. All Media Network. Archivado desde el original el 14 de noviembre de 2014. Consultado el 19 de julio de 2016. \n↑ «Neo Geo Pocket Color». neogeopocket.co.ukl. Archivado desde el original el 29 de febrero de 2000. Consultado el 20 de julio de 2016. \n↑ «The end of an era: a cruel look at what we missed: Part 2». Kontek. junio de 2000. Consultado el 20 de julio de 2016. \n↑ «NeoGeo Pocket Color Feature». Captain Williams. Consultado el 20 de julio de 2016. \n↑ a b «Neo Geo Pocket Color 101, A beginner's guide». Racketboy. 4 de enero de 2012. Consultado el 20 de julio de 2016. \n↑ a b Provo, Frank (11 de junio de 2004). «The History of SNK». GameSpot. Consultado el 20 de julio de 2016. \n↑ IGN Staff (2 de noviembre de 2001). «A Sign Of The Times: Game Over For SNK». IGN UK. Consultado el 20 de julio de 2016. \n↑ «Bandai announces release of WonderSwan color». PromoDuck.com. 30 de agosto de 2000. Archivado desde el original el 20 de marzo de 2014. Consultado el 21 de julio de 2016. \n↑ a b c IGN Staff (30 de agosto de 2000). «WonderSwan Color Revealed». IGN. Consultado el 21 de julio de 2016. \n↑ Wild, Kim (2007). «Retroinspection: WonderSwan». Retro Gamer (36): 68-71. ISSN 1742-3155. Archivado desde el original el 6 de agosto de 2016. Consultado el 21 de julio de 2016. \n↑ «Consolidated Financial Highlights» (PDF). Nintendo. 24 de enero de 2008. p. 8. Consultado el 21 de julio de 2016. \n↑ a b c «Game Park GP32». RetroMaquinitas. Consultado el 23 de julio de 2016. \n↑ «Game Park 32. La gran desconocida». Briconsola. Consultado el 23 de julio de 2016. \n↑ «Nokia N-Gage: historia del clásico que cumple 10 años». Hipertextual. 7 de octubre de 2013. Consultado el 22 de julio de 2016. \n↑ Brad Stone (27 de agosto de 2007). «Play It Again, Nokia. For the 3rd Time». The New York Times. Consultado el 22 de julio de 2016. \n↑ «Tapwave Discontinues Zodiac Business». Palm Infocenter. 27 de julio de 2005. Consultado el 22 de julio de 2016. \n↑ Schreier, John (4 de enero de 2011). «Nintendo DS Line Outsells Playstation 2, Nintendo Says». Wired. Condé Nast Publications. Consultado el 6 de julio de 2016. \n↑ Gameking 2 Portable Game Machine. Gizmodo.com (April 30, 2005). Retrieved on 2013-08-23.\n↑ «PSP - About». Sony Computer Entertainment. Archivado desde el original el 13 de febrero de 2008. Consultado el 22 de julio de 2016. \n↑ «PSP Technical Specifications». Sony Computer Entertainment. Archivado desde el original el 13 de febrero de 2008. Consultado el 22 de julio de 2016. \n↑ «E3 2003: Sony Goes Handheld!». IGN. 13 de mayo de 2003. Archivado desde el original el 25 de agosto de 2011. Consultado el 22 de julio de 2016. \n↑ Stanley A. Miller II (11 de mayo de 2004). «Sony aims to take on rivals». Milwaukee Journal Sentinel. Consultado el 22 de julio de 2016. \n↑ 1Up Staff (11 de diciembre de 2004). «PSP Japanese launch impressions». 1UP. Archivado desde el original el 21 de julio de 2016. Consultado el 22 de julio de 2016. \n↑ Thorsen, Tor (24 de marzo de 2005). «The US PSP Launch». GameSpot. Consultado el 22 de julio de 2016. \n↑ «Sony PSP launches across Europe». The BBC. 1 de septiembre de 2005. Consultado el 22 de julio de 2016. \n↑ Gary B. Shelly y Misty E. Vermaat (2012). Discovering Computers Fundamentals: Your Interactive Guide to the Digital World. Cengage Learning. p. 48. ISBN 1285201337. \n↑ James Brightman (31 de diciembre de 2003). «E3 2003: PSP Press Release». gamedaily.com. Archivado desde el original el 23 de marzo de 2008. Consultado el 22 de julio de 2016. \n↑ «Support - PSP - Movies». Sony Computer Entertainment. Archivado desde el original el 15 de marzo de 2008. Consultado el 22 de julio de 2016. \n↑ Roper, Chris (28 de marzo de 2005). «Sony PSP vs. Nintendo DS». IGN. Consultado el 22 de julio de 2016. \n↑ «PSP - About - Multimedia». Sony Computer Entertainment. Archivado desde el original el 14 de febrero de 2008. Consultado el 22 de julio de 2016. \n↑ «User's Guide - Remote Play». Sony Computer Entertainment. Consultado el 22 de julio de 2016. \n↑ «Support - PSP - Connecting to the Internet». Sony Computer Entertainment. Archivado desde el original el 15 de marzo de 2008. Consultado el 22 de julio de 2016. \n↑ a b «Gizmondo, una gran consola, un gran culebrón». Feel The Byte. 21 de mayo de 2007. Consultado el 22 de julio de 2016. \n↑ Nick Haywood (16 de marzo de 2005). «CEBIT 2005: Gizmondo out this week. Gizmondo packs a lot into a small package». Hexus.net. Archivado desde el original el 1 de agosto de 2012. Consultado el 23 de julio de 2016. \n↑ Nick Haywood (12 de abril de 2005). «Gizmondo price drop - Hardware - News». Hexus.net. Consultado el 23 de julio de 2016. \n↑ Stuart Miles (7 de febrero de 2006). «Gizmondo Europe goes into liquidation». Pocket-Lint. Consultado el 23 de julio de 2016. \n↑ «GP2X, la consola libre». Feel The Byte. 25 de mayo de 2007. Consultado el 23 de julio de 2016. \n↑ Will Guyatt (13 de agosto de 2009). «Dingoo A320 Micro Game Station review». Techradar. Consultado el 24 de julio de 2016. \n↑ a b «Consolas portátiles de emulación y scene». NoSoloBits. 25 de abril de 2011. Consultado el 24 de julio de 2016. \n↑ a b «Frequently Asked Questions». OpenPandora. Consultado el 23 de julio de 2016. \n↑ «Official Blog: It finally happened!». OpenPandora. 22 de mayo de 2010. Consultado el 23 de julio de 2016. \n↑ «First shipping emails hit inboxes». Pandora Press. 21 de mayo de 2010. Archivado desde el original el 7 de marzo de 2012. Consultado el 23 de julio de 2016. \n↑ «Pandora Consoles». DragonBox. Archivado desde el original el 17 de mayo de 2016. Consultado el 23 de julio de 2016. \n↑ a b «Launch of New Portable Game Machine» (PDF). Nintendo. 23 de marzo de 2010. Consultado el 23 de julio de 2016. \n↑ McEntegart, Jane (23 de junio de 2012). «Nintendo 3DS XL Arriving in UK On July 28». Tom's Hardware. Consultado el 23 de julio de 2016. \n↑ Wesley Yin-Poole (28 de agosto de 2013). «Nintendo announces Nintendo 2DS handheld console». Eurogamer.net. Consultado el 23 de julio de 2016. \n↑ «New Nintendo 3DS And New Nintendo 3DS XL Announced, Are More Powerful». Siliconera. 29 de agosto de 2014. Consultado el 23 de julio de 2016. \n↑ «Nintendo’s new 3DS console hits shelves in Japan». Japan Times. 11 de octubre de 2014. \n↑ «Características del Playstation Vita». playstation.com. Consultado el 23 de julio de 2016. \n↑ Joseph Barron (24 de diciembre de 2013). «10 razones para comprar una PS Vita». IGN. Consultado el 23 de julio de 2016. ", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Controlador_de_videojuego", "title": "Controlador de videojuego", "summary": "Busca fuentes: «Controlador de videojuego» – noticias · libros · académico · imágenes\nVéanse también:\n, \n y \nUn controlador de videojuegos (palanca de mando, mando, volante, pistolas, etcétera) es un periférico de entrada usado para controlar videojuegos.\nNormalmente, un controlador está conectado a una consola de videojuegos (vídeoconsola) o a un ordenador.\nUn controlador de videojuegos puede ser un teclado, un ratón, una palanca de mando (joystick en inglés), un mando (gamepad en inglés), una palanca u otro dispositivo diseñado para jugar que pueda recibir entradas. También existen dispositivos especiales, como volantes (para videojuegos de carreras) y pistolas de luz (para videojuegos de disparos).\nAlgunos, como el teclado y los ratones, son dispositivos genéricos que además se utilizan como controladores de videojuegos.\n", "sections": [{"name": "Tipos de controladores", "text": "", "subsections": [{"name": "Arcade", "text": "Las máquinas arcade son las madres de las videoconsolas. Tienen varios botones y uno o más joysticks, que permiten al usuario mover el personaje por la pantalla y ejecutar acciones mediante el uso de los botones. Pueden ser consideradas como una combinación entre el mando y el joystick, pero son las precursoras de ambos.\n"}, {"name": "Mando", "text": "Artículo principal:\nEl gamepad, también conocido como joypad, es un tipo de controlador de videojuegos que se sujeta con las dos manos, de manera que los pulgares se usan para la entrada de datos. Estos mandos suelen tener una serie de botones de acción (manejados con el pulgar derecho) y una serie de botones de dirección (manejados con el pulgar izquierdo), lo cual es incómodo para las personas zurdas.\nMuchos de los controladores de juegos modernos son variaciones del gamepad estándar. Algunas de la adiciones más comunes que se le realizan son los botones situados a lo largo del los bordes del mando, los botones en el centro (para las funcionalidades de start, select y mode) y un motor interno que proporciona tecnología háptica.\nLos gamepads son el principal método de entrada para todas las videoconsolas modernas. Además están disponibles para computadoras, aunque pocos juegos para computadora soportan gamepads, sino que usan teclados y ratones. Sin embargo, muchos emuladores de videoconsolas para PC sí soportan gamepads.\n"}, {"name": "Paddle", "text": "Es un controlador que contiene una rueda giratoria y varios botones para disparar. Es usado normalmente para controlar los movimientos del jugador o de un objeto a lo largo de un único eje de la pantalla. El controlador de paddle fue uno de los primeros controladores analógicos. Han ido desapareciendo conforme los juegos \"paddle and ball\" han ido perdiendo popularidad..\n"}, {"name": "Palanca de mando", "text": "La palanca de mando o joystick puede conectarse mediante USB, en paralelo, etc.\nPalanca de mando de vuelo\nEs un periférico que es similar al control de mando de una aeronave. Consta de una palanca que gira sobre uno de los extremos, transmitiendo el ángulo de giro en dos o tres dimensiones a la computadora. A menudo es usado en simuladores de vuelo.  Los controladores HOTAS (hands on throttle-and-stick), que incluyen hardware adicional para simular controles de la válvula reguladora y de timón, son populares entre los fanáticos del género.\nPalanca de mando arcade\nEste dispositivo es un joystick que se asemeja a los usados en las máquinas arcade. Posee un mango con un agarrador en forma de esfera y varios botones para realizar acciones en el juego. Normalmente se tiene el joystick a la izquierda y los botones a la derecha. Hay ocasiones en las que esta disposición se presenta a la inversa, o con el joystick en el centro y los botones a ambos lados.\n"}, {"name": "Pantalla táctil", "text": "Una pantalla táctil es un dispositivo de entrada que permite al usuario interactuar con la computadora o dispositivo portátil tocando la pantalla. La primera vez que fue usada fue en la consola Game.com de Tiger. Nintendo popularizó su uso en videojuegos con la videoconsola Nintendo DS; otros sistemas, como la Tapwave Zodiac y la mayoría de las PDA y teléfonos móviles, han incluido este sistema.\nLas pantallas táctiles modernas usan una fina, duradera y transparente capa de plástico encima de la pantalla de cristal. La localización de la zona que tocamos es calculada por la densidad de carga de los ejes X e Y, la cual varía según en la zona en la que toquemos.\n"}, {"name": "Pistolas", "text": "Una pistola láser es un periférico usado para “disparar” a objetivos en la pantalla. Suelen recordar armas de fuego reales. Su uso está limitado a juegos de tipo “rail shooter”. La primera pistola láser fue lanzada por Magnavox Odyssey. Después, Nintendo lanzó un estándar para su Famicom y su NES (Nintendo Entertainment System). Nintendo además lanzará un cartucho para la Wii.\n"}, {"name": "Teclado y ratón", "text": "Artículos principales:\nEl teclado y el ratón son dispositivos de entrada típicos de una PC y son actualmente los principales controladores de juegos para computadoras. Algunas consolas de videojuegos también pueden funcionar con teclado y ratón. El teclado de la computadora está basado en el de la máquina de escribir y fue diseñado para introducir texto escrito. Un ratón es un dispositivo apuntador que se sujeta con la mano, usado como complemento al teclado. Para juegos, normalmente el teclado se usa para controlar los movimientos del personaje mientras que el ratón es usado para controlar la cámara o para apuntar.\nEl teclado numérico (conjunto de teclas con, al menos, los números del 0 al 9, situados en forma de cuadrado), que forma parte del teclado, es también usado como controlador de juegos. Puede encontrarse en un gran número de dispositivos, como en consolas actuales, y normalmente incrustado en un joystick o en un paddle.\n"}, {"name": "Trackball", "text": "Un trackball es un ratón invertido el cual es manipulado con la palma de la mano. Tiene la ventaja de que no se necesita mucho espacio para manipularlo y es tan rápido como se pueda girar la esfera.\n"}, {"name": "Volante", "text": "El volante, esencialmente una versión mayor del paddle, es usado para videojuegos de carreras como rFactor, Live for Speed, Gran Turismo, Forza Motorsport y Need for Speed. Muchos incluyen la tecnología force feedback, es decir, diseñados para dar la misma sensación que se tienen al conducir un coche real, (dureza en la dirección, tirada en curva, baches, etcétera) aunque el nivel de realismo alcanzado depende del juego y la configuración del mismo. Normalmente vienen con 2 pedales para controlar el acelerador y el freno, aunque en los volantes más avanzados se incluye un tercer pedal para controlar el embrague. Se puede cambiar de marcha con un paddle o Léva, con una palanca de cambios en modo secuencial que se mueve adelante o atrás o con una palanca en \"H\" que simula el cambio de .los vehículos reales utilizando un embrague. La mayoría de los volantes giran sólo 200 o 270 grados, pero algunos, como el Logitech Driving Force Pro, Logitech G25, y Logitech G27, pueden girar 900 grados como un vehículo real.\nEl paddle Namco JogCon estuvo disponible para el juego  R4: Ridge Racer Type 4 de PlayStation. Al contrario que los volantes de videojuegos “reales”, el JogCon estaba diseñado para ajustarse a la mano del jugador. Su tamaño menor (su diámetro era como el de una lata de coca-cola) le hace parecerse al volante jog-and-shuttle utilizado en algunas VCRs (Videograbadora).\n"}, {"name": "Otros", "text": "En menor escala, otros hardwares como el controlador de trenes (disponible después de que el Simulador de Trenes de Microsoft fuera lanzado), controladores de pinball y consolas con mini-botones para juegos de estrategia, fueron lanzados en el pasado, pero su popularidad fue limitada a los fanáticos del género.\nEl dance pad, esencialmente un gamepad consistente en una rejilla sensible a la presión de las pisadas que se muestra en forma de alfombra, ha sido muy exitoso gracias a la popularidad de los juegos rítmicos como Dance Dance Revolution y Pump It Up. El dance pad fue introducido por Atari 2600 con el nombre de \"Exux Foot Craz pad\". Posteriormente, Nintendo compró la tecnología de Bandai y la usó en su \"Power Pad\", para las consolas Famicom y Nes.\nLos controladores de juegos rítmicos se parecen a instrumentos musicales como guitarras y baterías (Guitar Hero, GITADORA), timbales (Donkey Konga), maracas (Samba de Amigo) o el control Nemsys (Sound Voltex). Tienen también bastante éxito en máquinas recreativas y consolas caseras. En juegos de DJ como beatmania IIDX incluye un disco además de una serie de teclas (sin contar START ni SELECT).\nUn ejemplo reciente de la especialización de los controladores de juego es los cuatro pulsadores incluidos en los juegos de PlayStation 2 Buzz! (2005, 2006), que consisten en un concurso de preguntas. Estos controladores están claramente inspirados en los concursos de la televisión.\nEl sistema Wii de Nintendo utiliza un nuevo tipo de controlador llamado Wii Remote. Está provisto de sensores de movimiento y puede detectar su localización exacta y orientación en el espacio tridimensional. Más tarde su rival Sony creó para la PlayStation 3 el PlayStation Move\nNeGcon es un controlador para juegos de carreras de PlayStation. Físicamente es como un gamepad pero sus mitades derecha e izquierda pueden girar respecto de la otra mitad, haciendo de este una variación de los paddles.\nEl Atari Driving Controller fue el controlador de la Atari 2600, diseñado específicamente para el juego Indy 500. Se parece a un paddle pero su volante puede girarse continuamente en ambas direcciones. La fricción evita que el volante gane fuerza.\nAlgunos juegos han tenido éxito al usar un casco o un micrófono como controladores secundarios, como Hey You Pikachu! y las series SOCOM: U.S. Navy SEALs. El uso de estos micrófonos permite a los jugadores dar órdenes al juego, controlando compañeros de equipo (como en SOCOM) y otros personajes con inteligencia artificial (Pikachu) o poder cantar en compañía de otros jugadores como  Singstar.\nAlgunos juegos utilizan una cámara como método de entrada como EyeToy o Kinect. Juegos como Dance Evolution o Just Dance han popularizado el uso de esa cámara.\n"}]}, {"name": "Evolución de los controladores de videojuegos", "text": "Los primeros controladores de videojuegos fueron bastante simples. Uno de los primeros controladores fue el \"Brown Box\" de Magnavox, lanzado en 1972, que tenía solo un par de botones y una palanca de mando. Otros primeros controladores, como el de la Atari 2600, eran similares en diseño y función.\nEn la década de 1980, los controladores de videojuegos[1]​ comenzaron a evolucionar con la adición de más botones y palancas de mando. Los controladores de la consola NES de Nintendo, por ejemplo, tenían un diseño icónico con dos botones de acción y una cruz de control de ocho direcciones.\nLa década de 1990 vio la introducción de controladores con joysticks analógicos y gatillos, como el DualShock de Sony para la PlayStation original y el controlador de la consola Nintendo 64.\nEn la década de 2000, los controladores inalámbricos se hicieron populares, lo que permitió a los jugadores moverse libremente sin cables incómodos. Además, los controladores comenzaron a incorporar pantallas táctiles, como en el caso del controlador Wii U de Nintendo.\nEn la última década, los controladores han seguido evolucionando para mejorar la experiencia de juego. Los controladores de realidad virtual, como los controladores Oculus Touch, ofrecen una experiencia más inmersiva y realista. Además, los controladores personalizados y la capacidad de conectar múltiples controladores para una experiencia de juego cooperativo se han vuelto cada vez más comunes.\n", "subsections": []}, {"name": "Estrategia en tiempo real y controladores programables", "text": "Hay algunos controladores específicamente usados para videojuegos de estrategia en tiempo real y algunos juegos de tipo arcade. Estos controladores pueden ser programados para permitir la emulación de teclas y macros. Fueron desarrollados porque algunos de estos juegos requerían un teclado para jugar, y algunos jugadores encontraban esto difícil para realizar algunas tareas.\n", "subsections": []}, {"name": "Longevidad del hardware", "text": "Dado el número de piezas de goma móviles y delicadas presentes en los controladores, es de esperar que tras un uso prolongado, algunos de los botones pierdan sensibilidad debido al deterioro de la goma que los conecta con el circuito integrado. Incluso las cubiertas externas de plástico de los joysticks y volantes pueden romperse si se usan violentamente. La trituración de botones y el bamboleo de joysticks fueron responsables de la rotura de muchos controladores hasta mediados de la era de los 16-bits, cuando tales juegos fueron pasando de moda.\nIncluso joypads mejor construidos, capaces de aguantar el desgaste mecánico durante años, pueden quedar inservibles por el desarrollo de juegos que requieren más botones o funciones, o cambios en las interfaces usadas, dejándolos así obsoletos. Por ejemplo, el aumento de botones y ejes requeridos por los simuladores de vuelo y el desuso de la interfaz del puerto de juegos de la PC han dejado muchos controladores funcionales de PC inservibles. El fin de una generación de consolas suele implicar la obsolescencia de una consola y sus controladores.\n", "subsections": []}, {"name": "La salud y los videojuegos", "text": "Debido a que el controlador es el modo más común de interactuar con un videojuego, este debe ser diseñado ergonómicamente para resultar cómodo a la mayoría de sus usuarios potenciales y así evitar daños como el síndrome del túnel carpiano. La mayoría de los controladores están diseñados para adoptar una posición relajada de la mano, lo que ha dado origen a los \"cuernos\".\nSin embargo, es casi imposible encontrar una solución ideal ya que la edad de un jugador habitual de videoconsolas abarca un gran rango (desde niños de corta edad hasta adultos y ancianos). La videoconsola Xbox, por ejemplo, tenía un controlador demasiado grande para la mayoría de los jugadores cuando fue lanzada al mercado; sin embargo, algunos jugadores con dedos largos se sentían más cómodos con esta primera versión que con la más pequeña que salió después (modelo Type-S).[cita requerida]\nLos \"Dedos de Nintendo\" fue un término acuñado a principios de los años 1990 después de que los jugadores de videojuegos tuvieran sus pulgares muy doloridos e incluso presentaran ampollas debido a la dureza de los botones. Un fenómeno más común y menos peligroso, conocido como el \"Calambre de Nintendo\", consistía en calambres en los pulgares y en la palma de la mano. Esto suele ocurrir cuando se usan controladores más pequeños. En realidad, esto último puede ocurrir en cualquier dedo si se mantiene una posición arqueada de la mano por un largo tiempo, y es menos dañino que los \"Dedos de Nintendo\".\n", "subsections": []}, {"name": "Referencias", "text": "↑ «Mouse Viper Razer». \n", "subsections": []}, {"name": "Véase también", "text": "Arcade\nGamepad\nPaddle (controlador de videojuegos)\nPalanca de mando\nPantalla táctil\nPeriférico de entrada\nPistola de luz\nRatón (Informática)\nTeclado (informática)\nCámara Kinect\nTrackball\nVideoconsola\nVolante (videojuegos)\nWii Remote", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Controversia", "title": "Controversia", "summary": "Una controversia es la discusión de opiniones contrapuestas entre dos o más personas.[1]​\nÁreas perennes de controversia son la religión, filosofía, política, ciencia, deportes e incluso entretenimiento. La controversia en temas de teología tradicionalmente ha sido de excepcional preocupación y la misma en general se considera divisora en una sociedad dada; algunos temas controvertidos son considerados tabú o muy delicados para ciertos sectores, a menos que un grupo dado de personas puedan tratar el tema desde una perspectiva común para discutir y compartir las posturas personales de cada quien sobre la cuestión.\n", "sections": [{"name": "Controversia y polémica", "text": "A menudo se considera que controversia es sinónimo de polémica y si bien es verdad, este último se usa más en relación con el cuestionamiento o la duda de aceptación acerca de algo o alguien.\n", "subsections": []}, {"name": "Ejemplos de controversias", "text": "Controversia sobre la existencia de dioses.\nControversia sobre el calentamiento global.\nControversia sobre la energía nuclear.\nControversia de la biopsiquiatría.\nControversia en los videojuegos.\nControversia en la preferencias políticas.\nControversia sobre el deporte\n", "subsections": []}, {"name": "Véase también", "text": "consenso\ndebate\nopinión\nTodas las páginas que comienzan por «Controversia».\nArtículos que contienen el término \"controversia\" en Wikipedia.\n", "subsections": []}, {"name": "Referencias", "text": "↑ http://dle.rae.es/?w=controversia&m=form&o=h", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Controversia_en_los_videojuegos", "title": "Controversia en los videojuegos", "summary": "Diversas controversias en los videojuegos giran alrededor de asuntos como la violencia gráfica, escenas violentas y sangrientas, desnudez total o parcial, representación de conducta criminal, racismo y otro tipo de materiales que pueden resultar provocativos o desagradables. Los videojuegos son a menudo estudiados para saber si se vincula a la afición y la agresión. Los meta-análisis más tempranos (un análisis de varios estudios) estaban en desacuerdo. Un estudio de 2001, encontró que la exposición a estos medios violentos causa al menos un aumento temporal de la agresión y que esta exposición tiene correlación con la agresión en el mundo real. Una disminución en el comportamiento pro social (preocupando por el bienestar y los derechos de otros) también fue notada.[1]​ Otros meta-análisis de 2001 que usa métodos similares junto a un estudio de 2009 más reciente que se enfoca expresamente en el comportamiento agresivo, concluye que la violencia del videojuego no está relacionada con el comportamiento agresivo en la vida real. A día de hoy se han propuesto muchos efectos potenciales positivos. Otras investigaciones sugieren que aún algunos juegos con alto contenido de violencia pueden tener un efecto de bienestar social en algunos contextos. Por ejemplo, el jugar en equipo.\n", "sections": [{"name": "Impacto social positivo", "text": "En cuanto a los efectos positivos, educadores y científicos del aprendizaje han debatido sobre cómo aprovechar la motivación de los estudiantes hacia los videojuegos para utilizarlos con fines educativos y pedagógicos. Malone, por ejemplo, explora las cualidades intrínsecamente motivadoras que los juegos tienen y cómo podrían ser útiles en el diseño de juegos educativos.[2]​ Malone y Lepper (1987) recomendaron cuatro heurísticas principales: desafío, fantasía, curiosidad y control de los diseñadores de juegos e investigadores para mejorar la interfaz de interacción con el usuario.[3]​\nPor otro lado, según una investigación realizada en el 2006 por parte de la Universidad de Salamanca, España, tenemos que los videojuegos pueden tener distintos enfoques positivos tomando como modelo el concepto de cerebro Triúnico. Algunos de ellos son: Mejoría de la agudeza en la percepción visual y los reflejos, aumento en gran medida de la autoestima, la seguridad personal y la capacidad de autosuperación.  \nEn la misma investigación de la Universidad de Salamanca, se tiene que: \"Los videojuegos constituyen una excelente herramienta de alfabetización digital a través del cual se transmiten formas, valores, maneras de comportamiento, de relacionarse con otros, así como también... los códigos y valores culturales y políticos predominantes en los países en los que se encuentran los mayores centros de producción y diseño de videojuegos, ubicados [por lo general] en los países desarrollados... ejerciendo de esta manera su influencia en sus propios países y en aquellos mayoritariamente \"consumidores\" de videojuegos.\" [4]​ \n", "subsections": []}, {"name": "Impacto social negativo", "text": "Existen numerosos ejemplos de los impactos negativos que los videojuegos pueden llegar a tener. La cuestión planteada con mayor frecuencia  por los medios de comunicación y el público en general tiene que ver con la violencia de los mismos. Los posibles efectos que los videojuegos jugados, en particular los que cuentan con elementos agresivos o violentos, podrían tener en los niños y jóvenes son la estimulación del comportamiento agresivo en los jugadores, según la teoría del aprendizaje social,[5]​ ya que estos se convierten en un participante activo (en oposición a un observador pasivo como el caso de la agresión en el cine y la televisión). Por otra parte, la teoría de la catarsis implica que los videojuegos agresivos tendrían un efecto contrario al canalizar la agresividad latente, lo que resulta en un efecto positivo en los jugadores.[6]​\nPor otro lado, según un artículo publicado en la Revista Internacional de Comunicación Audiovisual, Publicidad y Literatura en 2009, señala que los videojuegos pueden traer consigo efectos tales como la adicción, la agresión, el aislamiento social y ciertas conductas delictivas.[7]​\nUn estudio hecho por Institute of Psychology, University of Innsbruck, Innsbruck & Austria analizó a individuos que al jugar videojuegos en línea con un cierto grado de violencia, estos reaccionaban a estímulos y emociones de agresividad y violencia por periodos de corto tiempo. Cabe mencionar que aquellos que jugaron en línea mostraban más niveles de agresividad, lo que les llevaba a concluir que los juegos violentos sacaban a relucir este tipo de actitudes agresivas y violentas.[8]​\nExpertos en medicina y salud mental han mostrado preocupación por ello y la Organización Mundial de la Salud llegó a incluirlo como «juego patológico» en la undécima revisión de su Clasificación Internacional de Enfermedades entre otras adicciones a nuevas tecnologías. Sin embargo; otros expertos en la materia, entre los que se incluye la Asociación Estadounidense de Psiquiatría, han afirmado que no hay evidencias suficientes de que los videojuegos puedan producir tendencias violentas o inducir a un comportamiento adictivo,[9]​ aunque están de acuerdo que los videojuegos típicamente hacen uso del «bucle de compulsión» en su diseño el cual puede crear dopamina y esta puede ayudar a reforzar el deseo de continuar jugando a través de ese bucle de compulsión y potencialmente llevar a comportamientos violentos o adictivos.[10]​[11]​[12]​ La industria del videojuego reaccionó a la decisión de la OMS alegando que no hay consenso ni evidencias lo suficiente robustas como para tomar esa decisión.[13]​[14]​ Otros medios han puesto de manifiesto que la inclusión es algo cuestionable dado que no todos los juegos presentan un diseño que incluya mecanismos etiológicos como sí lo hacen los juegos que incluyen cajas de botín por su similitud con los juegos de azar.[15]​\n", "subsections": []}, {"name": "Funcionalidad de los videojuegos", "text": "Una investigación más sociológica ha tratado de alejarse de las ideas simplistas de juego, ya sea como \"negativo\" o \"positiva\", sino más bien trata de comprender su función y ubicación en las complejidades de la vida cotidiana.[16]​ Por ejemplo, en su libro Life on the screen, Sherry Turkle exploró cómo las personas que participaron en los juegos multijugador en línea, tales como MUD , utilizan sus experiencias con el juego para explorar cuestiones personales de identidad[17]​\nUna mayor comprensión de la correcta utilización de los videojuegos puede evitar las consecuencias negativas del medio, tales como el desarrollo de dificultades psicosociales en los niños y riesgos en la salud.[18]​\nUna funcionalidad de los videojuego se ha podido ver en la educación primaria. Según la  International Journal of Technology and Educational Innovation tras una revisión se llegó a ver como en materias como matemáticas, lengua castellana y literatura, ciencias sociales, educación física, educación plástica y visual y música se vio que los niños mejoraban su motivación con juegos como Portal 2, Wii Music, entre otros.\n", "subsections": []}, {"name": "Violencia en los videojuegos", "text": "Los porcentajes de violencia dentro de los videojuegos son altas ya que un 98% de los videojuegos contienen este tipo de violencia y no es un hecho que pase por alto.[19]​\nExponerse a corto plazo a videojuegos que incluyen violencia, incrementan la agresión a través sistema cognitivo primario incrementando el despertar, y la creación de un estado agresivo[19]​\nCraig A. Anderson dice que ahora ya se puede demostrar que los videojuegos violentos sí afectan a los niños y los adolescentes que los juegan, ya que, en estos estudios, se han comprobado que después de que los niños y adolescentes juegan este tipo de videojuegos adoptan algunas actitudes agresivas. En Japón, en cambio, los estudios en cuanto a niveles de agresión fueron más bajos pero el estudio demostró que no sólo era en niños y adolescentes, sino también estos videojuegos afectaban a los adultos. En este estudio, las personas que se convirtieron en los objetos de estudio, meses después fueron tachados por sus profesores y compañeros como personas violentas.[20]​[21]​\nAlgunos videojuegos en la actualidad han sido más que cínicos en el uso de la violencia dentro del juego, según la CNN, algunos de los videojuegos más violentos de la historia han sido: Death Race (1976), Mortal Kombat (1992), Doom (1993), Grand Theft Auto entre otros, en estos juegos definitivamente se aprecia de una forma muy evidente violencia extrema.[22]​\n", "subsections": []}, {"name": "Casos por violencia en videojuegos", "text": "La CNN reporta el caso de un niño de 8 años que le disparó a su abuela de 90 años por jugar un videojuego violento. Aunque al principio todo parecía un accidente, al interrogar al niño se descubrió que lo hizo a propósito tras haber jugado el famoso juego Grand Theft Auto IV.[23]​\nEl Servicio Secreto de Estados Unidos y el Departamento de Educación han emitido un reporte que estudió 24 casos de violencia escolar y descubrió que: «Casi la mitad de los atacantes haya demostrado cierto interés en la violencia a través de películas, videojuegos, libros u otros medios».[24]​\n", "subsections": []}, {"name": "Representación de la orientación sexual y la identidad de género", "text": "Los personajes de lesbianas, gais, bisexuales y transgénero (LGBT) se han representado en algunos videojuegos desde la década de 1980, con Caper in the Castro en 1989 como uno de los primeros juegos centrados en temas LGBT.[25]​ El contenido LGBT ha estado sujeto a reglas y regulaciones cambiantes por parte de las compañías de juegos. Estas reglas son generalmente ejemplos de heterosexismo en el sentido de que la heterosexualidad se normaliza mientras que la homosexualidad está sujeta a censura o ridículo adicional.[26]​[27]​ La orientación sexual y la identidad de género fueron significativas en algunos juegos de consola y PC, con una tendencia hacia una mayor visibilidad de las identidades LGBT, particularmente en la cultura popular japonesa[28]​ y los juegos comercializados para consumidores LGBT.[29]​[30]​[31]​\nUno de los casos más recientes de una controversia sobre la representación de la orientación sexual en videojuegos fue en el videojuego The last of us part II, en la presentación de gameplay del 2018 se mostro una escena donde la protagonista besando a una chica, eso provocó una ola de odio hacia el estudio Naughty Dog creadores del juego. En su salida el juego recibió un boicot en la página de críticas Metacritic entre muchas cosas que fue criticado lo que más resaltaba era la sexualidad de varios personajes.\n", "subsections": []}, {"name": "Casos en los que los videojuegos han ayudado", "text": "Diversos portales dedicados a las noticias del mundo de los videojuegos y el entretenimiento anunciaron en el año 2018 que una mujer llamada Jessica Prime, a través de su cuenta de Twitter, mencionó que su hijo le confesó su decisión por no suicidarse tras haber concluido Hellblade: Senua's Sacrifice desarrollado por Ninja Theory. La historia del juego nos relata la travesía de una mujer con problemas mentales para rescatar a su esposo del infierno nórdico. Cabe destacar que el juego contiene alto porcentaje de violencia, así como de crudeza por las diversas situaciones que la protagonista debe atravesar.\n", "subsections": []}, {"name": "Véase también", "text": "Combo (videojuegos)\n", "subsections": []}, {"name": "Referencias", "text": "↑ Freedman J. (2002). Media violence and its effect on aggression: assessing the scientific evidence. Toronto: University of Toronto Press]]. ISBN 0-8020-8425-7. \n↑ Malone, Thomas W. (1980). What Makes Things Fun to Learn? A Study of Intrinsically Motivating Computer Games. p. 89. \n↑ Malone, Thomas (1987). «Making learning fun: A taxonomy of intrinsic motivations for learning». Aptitude, Learning and Instruction III: Conative and Affective Process Analyses 3: 223-253. \n↑ Marcano Lárez, Beatriz E. (2006). ESTIMULACIÓN EMOCIONAL DE LOS VIDEOJUEGOS: EFECTOS EN EL APRENDIZAJE. Teoría de la Educación. Educación y Cultura en la Sociedad de la Información, 7(2), undefined-undefined. Consultado el 4 de Diciembre de 2019. ISSN:. Disponible en: https://www.redalyc.org/articulo.oa?id=2010/201017296008\n↑ Bandura, Albert (1986). Social Foundations of Thought and Action: A Social Cognitive Theory. Prentice-Hall. pp. 617. \n↑ Feshbach, Seymour; Singer, Robert D. (1971). Television and Aggression: An Experimental Field Study. Proquest Info & Learning. \n↑ Tejeiro Salguero, R., Pelegrina del Río, M. y Gómez Vallecillo, J.L. (2009). Efectos psicosociales de los videojuegos. Revista Internacional de Comunicación Audiovisual, Publicidad y Literatura, 1 (7), 235-250.\n↑ Jack Hollingdale; Tobias Greitemeyer (1 de noviembre de 2014). «The Effect of Online Violent Video Games on Levels of Aggression» (en inglés). School of Psychology, University of Sussex, Brighton, United Kingdom, Institute of Psychology, University of Innsbruck, Innsbruck & Austria. Consultado el 7 de febrero de 2023. \n↑ Draper, Kevin (5 de agosto de 2019). «Video Games Aren't Why Shootings Happen. Politicians Still Blame Them.». The New York Times (en inglés). Archivado desde el original el 26 de abril de 2020. Consultado el 22 de agosto de 2019. \n↑ Barrus, Michael M.; Winstanley, Catharine A. (20 de enero de 2016). «Dopamine D3 Receptors Modulate the Ability of Win-Paired Cues to Increase Risky Choice in a Rat Gambling Task». The Journal of Neuroscience (en inglés) 36 (3): 785-794. PMC 6602008. PMID 26791209. S2CID 23617462. doi:10.1523/JNEUROSCI.2225-15.2016. \n↑ Kim, Joseph (23 de marzo de 2014). «The Compulsion Loop Explained». Gamasutra (en inglés). Archivado desde el original el 14 de agosto de 2020. Consultado el 3 de febrero de 2020. \n↑ Parkin, Simon (8 de agosto de 2019). «No, Video Games Don't Cause Mass Shootings. But The Conversation Shouldn't End There». Time (en inglés). Archivado desde el original el 3 de septiembre de 2020. Consultado el 3 de febrero de 2020. \n↑ Javier Jiménez (18 de junio de 2018). «Ya es oficial: la \"adicción a los videojuegos\" acaba de ser reconocida como enfermedad por la Organización Mundial de la Salud». xataka.com. Consultado el 7 de febrero de 2023. \n↑ José Ángel Mateo (26 de mayo de 2019). «La OMS añade la adicción a los videojuegos en la Clasificación Internacional de Enfermedades». esports.xataka.com. Consultado el 7 de febrero de 2023. \n↑ Javier Jiménez (14 de febrero de 2018). «La \"adicción a los videojuegos\" es un tema serio sobre el que tenemos que hablar: ni el alarmismo, ni la negación aportan nada». xataka.com. Consultado el 7 de febrero de 2023. \n↑ Crawford, Garry (2012). Video Gamers. Routledge. p. 200. \n↑ Turkle, Sherry (1997). Life on the Screen: Identity in the Age of the Internet. Simon & Schuster. p. 352. \n↑ Druzhinenko, Daria A.; Podolskiy, Andrey I.; Podolskiy, Oleg A.; Schmoll, Patrick (1997). using videogames to treat childhood obesity (7): 352. doi:10.11621/pir.2014.0405. \n↑ a b Nicolas L. Carnagey, And Craig A. Anderson (2005). «The Effects of reward and punishment in violent video games on agressive affect, cognition and behavior» (en inglés). American Psychological Society. Archivado desde el original el 9 de agosto de 2017. Consultado el 11 de noviembre de 2016. \n↑ A.Anderson, Craig (30 de octubre de 2003). «An update on the effects of playing violent video games». Journal of Adolescence. Archivado desde el original el 13 de diciembre de 2016. Consultado el 11 de noviembre de 2016. \n↑ [1]\n↑ Gross, Doug (4 de julio de 2011). «Los 10 videojuegos violentos más polémicos». CNN en español. Consultado el 11 de noviembre de 2016. \n↑ Reuters (25 de agosto de 2013). «Un niño mata a su abuela con un arma luego de jugar un videojuego violento». Expansión. Consultado el 11 de noviembre de 2016. \n↑ Sutter, John D. (20 de abril de 2012). «La masacre en Noruega revive el debate de la violencia en videojuegos». Expansión. Consultado el 11 de noviembre de 2016. \n↑ Henley, Stacey (7 de julio de 2020). «Never Mind The Last Of Us, Here's The Real Game With The First LGBT+ Protagonist». USGamer. Archivado desde el original el 16 de julio de 2020. Consultado el 17 de julio de 2020. \n↑ Rippling M. \"The two phantasy stars\". Camineet website. Consultado el 29 de enero de 2010.\n↑ \"Sexual moments in video game history\". Archivado el 9 de junio de 2011 en Wayback Machine. Mockery website. Consultado el 4 agosto de 2009.\n↑ McLelland M. \"Male homosexuality and popular culture in modern Japan\". Archivado el 2 de agosto de 2019 en Wayback Machine. Intersection website.\n↑ Seabrook J. \"Will Wright, Game Master\". Archivado el 1 de julio de 2014 en Wayback Machine. The New Yorker 6 de noviembre de 2006.\n↑ Sung L. \"Homosexuality in video games\". Archivado el 30 de abril de 2019 en Wayback Machine. Neo Seeker website news.\n↑ Fahey M. \"How not to address homosexuality in gaming\". Archivado el 4 de noviembre de 2016 en Wayback Machine. Kotaku website.\n", "subsections": []}, {"name": "Enlaces externos", "text": "Esta obra contiene una traducción  derivada de «Video game controversy» de Wikipedia en inglés, concretamente de esta versión, publicada por sus editores bajo la Licencia de documentación libre de GNU y la Licencia Creative Commons Atribución-CompartirIgual 4.0 Internacional.", "subsections": []}]}
