{"url": "https://es.wikipedia.org/wiki/Auriculares", "title": "Auricular", "summary": "Un auricular[1]​ (también conocido como audífono en América;[2]​ generalmente se usa uno en cada oído, por lo que es frecuente emplear el nombre en plural: auriculares, audífonos o también cascos[3]​) es un transductor que recibe una señal eléctrica originada desde una fuente electrónica (como por ejemplo una radio, sintoamplificador o reproductor de audio) y que por su diseño permite colocar cerca de los oídos unos altavoces para generar ondas sonoras audibles.[4]​\nLos auriculares son normalmente desmontables e intercambiables, es decir, que pueden enchufarse o desenchufarse con facilidad del equipo que los requiere. Los mismos auriculares pueden ser usados por diversos sistemas de audio.\nEn el contexto de las telecomunicaciones, los auriculares se refieren a un tipo de aparato que consiste en una combinación de auriculares y micrófono para la comunicación bidireccional. Por ejemplo, un teléfono móvil.\n", "sections": [{"name": "Terminología", "text": "En Hispanoamérica, el término audífono se aplica sobre todo a los dispositivos para escuchar música y el término auricular a la pieza de ciertos dispositivos que sirve para escuchar;[5]​ en España, se suele usar el término audífono para estos últimos.[6]​\n", "subsections": []}, {"name": "Historia", "text": "Los auriculares empezaron a usarse mucho a partir de la telefonía y la radio. Las señales eléctricas débiles de los tempranos instrumentos eléctricos (todavía no electrónicos) requerían una amplificación personalizada para el ámbito de la telefonía.\nA la empresa llamada Beyerdynamic se le atribuye oficialmente el invento, a finales de los años 1930, y como la primera empresa en vender auriculares al público en general: modelo DT48 en 1937.[7]​\nSu empleo se masificó a partir del surgimiento de los sistemas de audio personales: radios portátiles y reproductores portátiles de casete; posteriormente el fenómeno se acrecentó con el uso del reproductor de CD, el reproductor de audio digital, la computadora personal y los teléfonos inteligentes.\nCon el avance de la electrónica se han incorporado el receptor de radio AM/FM y han adquirido otras capacidades, como la comunicación inalámbrica (por medio de infrarrojos, bluetooth, o wifi) para recibir señales.\n", "subsections": []}, {"name": "Tipos", "text": "Por posición relativa al oído, se suelen clasificar en:[8]​\nCircumaurales: Rodean completamente la oreja. Estos auriculares, cuando son cerrados, permiten el aislamiento sonoro casi por completo del sujeto que escucha. Asimismo impiden que el sonido reproducido salga al exterior, por eso sus aplicaciones suelen estar más dedicadas al campo profesional, como monitorización de amplificación en vivo (típicamente operación de consola de mezcla en recitales) o mezcla para los DJ en clubs. La principal característica de estos dos tipos es que, al estar ligeramente separados del oído, generan una mayor sensación natural del campo estéreo y una reproducción de frecuencias más lineal y precisa.\nSupraaurales: Los altavoces cubren la mayor parte del pabellón auditivo, siendo este diseño el estándar en sonido Hi-Fi domésticos, pero también en los sistemas de mezcla profesional. Son \"portátiles\" por ser más ligeros y menos voluminosos que los circumaurales.\nIntraurales o intrauriculares: Son pequeños auriculares, aproximadamente del tamaño de un botón que se introducen dentro del canal auditivo, y permiten al oyente un mayor aislamiento, movilidad y confort subjetivo (la sensación de comodidad difiere según el usuario). Su mayor defecto es que el sonido parece que viniera del interior de la cabeza, por lo que se pierde la sensación auditiva natural, en la que el sonido llega del exterior. También por su tamaño ofrecen menor rendimiento sonoro que un dispositivo de mayor tamaño. Su uso está generalizadamente extendido para la escucha de reproductores portátiles (reproductor MP3, reproductor MP4). También se les llama pinganillos.\nDe conducción ósea: Este tipo de dispositivos, al no generar una onda de presión acústica (\"ondas sonoras audibles\" en la definición) y por no trabajar con variaciones de presión atmosférica, no entran dentro de la categoría de \"auriculares\" y formalmente no lo son. Sin embargo, dado que comparte con los auriculares uso y funciones, así como métodos de transmisión de datos o modos de carga, conviene listarlos como una alternativa funcional. Los dispositivos de conducción ósea emiten vibraciones a través de la piel y el cráneo, de forma que hacen vibrar la cóclea (en el oído interno) pero sin usar el conducto auditivo externo. La principal ventaja es que nos mantiene en contacto con el entorno exterior, por lo que son ideales para actividades deportivas o peligrosas en las que se necesita percibir también otras fuentes sonoras a través del oído externo.\nSegún el mecanismo de soporte:[8]​\nDe diadema o cascos: Los auriculares van acoplados en los extremos de una diadema. Los hay de diversos tipos de materiales y formas. Los más comunes suelen ser de plástico y metal acolchados. En cambio, «auricules» se utiliza para que están sueltos.\nInternos: Se insertan en el canal auditivo y logran bloquear el sonido externo mediante gomas o siliconas que se amoldan a cada usuario. Están entre los más transportables, pero también los que llegan de forma más directa al oído interno gracias a introducirse en el conducto auditivo externo.\nDe botón: Se colocan en el oído externo, por lo que es un punto medio entre los auriculares internos y los de diadema. Son tal vez los más utilizados, ya que suelen venir acompañando a los reproductores de música y a los teléfonos móviles.\nDe clip: Son prácticamente iguales que los de botón o los internos, con la diferencia de que cuentan con una estructura, en general plástica o de silicona, para colocarlos alrededor de la oreja. Son ideales para salir a correr, para el gimnasio u otras actividades, puesto que no se salen con facilidad.\nDe nuca: También llamados de contorno de cuello o cervicales, son similares a los de clip, pero además cuentan con una cinta que va por la nuca y comprime los auriculares hacia la cabeza.\nPinganillos: Similares a los de clip, son unos intrauriculares inalámbricos que no disponen de cable o estructura de unión entre ambos auriculares y tampoco en torno a la oreja, y por tanto son más pequeños, llegando a ser casi indetectables. También pueden venderse por separado, y han sido tradicionalmente usados en los platós de televisión para ocultar al máximo el auricular a través del que reciben información del regidor.\nSi llevan micrófono se pueden dividir en:\nMicroauricular: El micrófono va acoplado a uno de los auriculares en forma de brazo articulado. Suelen usarse en entornos profesionales, aviación, jugadores, etc. Si solo llevan un auricular se les llama monoaurales. También se les llama microcascos.\nMicroauricular de botón: Intraauriculares, normalmente el micrófono va acoplado en el cable. Son los que hoy en día se usan con los teléfonos móviles.\nPor el principio de funcionamiento:\nElectrodinámicos: Son los más utilizados. Tienen buena reproducción de agudos y son económicos.\nElectrostáticos: Tienen buena respuesta en frecuencia.\nPiezoeléctricos: Se emplean para equipos pequeños (ayuda para la sordera, etc.).\nPor el conexionado:\nCableados\nInalámbricos: Se trata de la utilización de tecnologías de conectividad inalámbrica entre los audífonos y un dispositivo con el que estén emparejados.\nAuriculares infrarrojos: Este tipo de transmisión provee ciertas ventajas como su relativo bajo coste con respecto a otras tecnologías, pero también ofrece varias desventajas, entre las cuales se encuentra el alcance (que ronda solo los seis metros) lo que además está íntimamente ligado a la fidelidad del sonido cuando se aleja de la base emisora, es decir que cuanto más nos se aleje el usuario del punto de emisión de señal, existen más probabilidades de perder sonido.\nRadiofrecuencia: Este tipo de auriculares son los más extendidos en el mercado para aplicaciones de alta fidelidad. Además de brindar un buen alcance efectivo de la transmisión, pueden transmitir hasta casi cien metros de distancia en un arco de 360°. Sin embargo, como desventaja, las ondas emitidas por dispositivos inalámbricos, redes inalámbricas o campos eléctricos, pueden añadir estática y zumbidos a esta conexión.\nAuriculares Bluetooth: La tecnología Bluetooth es utilizada para la intercomunicación entre diversos tipos de dispositivos, y algunos fabricantes han decidido emplear este tipo de técnica para incorporarla a sus modelos de auriculares por su calidad y velocidad de transmisión. Como desventaja, se puede destacar que, mientras más se aleje el usuario del dispositivo con el que estén emparejados los auriculares, se producirán más microcortes en la conexión degradando su calidad hasta que se pierda totalmente el enlace.[9]​\nPor el tipo de sonido:\nAuriculares con sonido estéreo: Este tipo de auriculares son los más comunes en el mercado. En este tipo de sistema de sonido, el audio llega hasta los oídos mediante dos canales: izquierdo y derecho. Es justamente lo que lo diferencia del sonido mono, también llamado monoaural y que está en desuso hoy día.\nAuriculares con sonido envolvente: Este tipo de auriculares se caracterizan por emplear sonido 5.1 o 7.1 surround. Realmente este tipo de sonido surgió como un estándar de cine para casa y el número (5.1 o 7.1) definía cuantos altavoces había en la sala para crear una sensación de inmersión sonora. La forma en que este tipo de sonido llegó a los auriculares fue con la llegada al mercado de los cascos gaming, ya que los fabricantes empezaron a introducir este estándar para aquellos juegos donde el sonido posicional jugaba un papel importante. En los auriculares gaming, al tener los altavoces pegados a las orejas, los ingenieros de audio replicaron esa sensación inmersiva de sonido jugando con la orientación de los altavoces internos, para que tengamos la sensación de que el sonido procede de distintos lugares, aunque realmente no sea así, es lo que se conoce como sonido envolvente virtual.[10]​\n", "subsections": []}, {"name": "Características", "text": "La cancelación de ruido es una característica parcialmente nueva que se puede encontrar en algunos modelos de auriculares. Básicamente lo que generan son ondas sonoras que chocan con las ondas provenientes del exterior y tienen el efecto de atenuar notablemente el ruido generado alrededor para que el oyente se pueda concentrar exclusivamente en la música.\nEsta tecnología es buena para DJs o para escuchar música en entornos muy ruidosos. En algunos diseños es posible activar o desactivar esta función. Casi todos estos modelos se alimentan actualmente de baterías para hacer funcionar la cancelación de ruido.\nSe trata del rango de sonidos que pueden desplegar los auriculares. Se mide en hercios e incluye desde las frecuencias más altas hasta los bajos más profundos. Normalmente hay un rango compatible con cada modelo, por ejemplo, 18 Hz a 30 000 Hz. Cuanto más grande sea el rango mejor, así se logra mayor sensibilidad en graves y agudos. Como referencia, el ser humano puede escuchar frecuencias de entre 20 Hz y 20 000 Hz.\nEs la resistencia al paso de corriente eléctrica; a menor impedancia, mayor volumen, por lo que se pueden hacerlos funcionar apropiadamente con fuentes de corriente pequeñas como el iPod (impedancias de 60 ohmios o menores). Si la impedancia es grande, por encima de 100 ohmios, se deberá usar un amplificador de audio.\nEl decibelio es la unidad con la que se mide la intensidad de sonido. Más decibelios significa mayor volumen del sonido. Casi todos los auriculares soportan hasta 100 dB.\nEl uso de auriculares a su vez puede producir cambios en la salud humana si se utilizan con un volumen muy alto de sonido. Se recomienda no exceder los 110 dB en el empleo habitual para evitar problemas de oído.\nDentro de la cubierta de cada audífono, la electricidad en el alambre de cobre y la membrana del audífono crea un campo magnético que atrae al alambre y a la membrana hacia el imán permanente (elaborado de samario-cobalto); los cambios en la intensidad de la corriente eléctrica hacen que la membrana vibre, y las vibraciones mueven el aire, y así se genera el sonido.[11]​\n", "subsections": []}, {"name": "Beneficios y limitaciones", "text": "Los auriculares se utilizan para evitar que otras personas puedan o tengan que escuchar el sonido, como en sitios públicos, bibliotecas, etcétera, o para el aislamiento. Además, pueden proporcionar una calidad de sonido superior a la mayor parte de los altavoces, incluso de alta gama. Esto es especialmente notable en frecuencias bajas, donde en sistemas de altavoces domésticos es necesario el uso de un subwoofer, e incluso subwoffers de alta calidad pueden tener distorsiones en frecuencias muy bajas (en el caso de los auriculares, es mucho menos común a frecuencias muy bajas como 20 Hz).\nLos auriculares también permiten un avanzado sistema de posicionamiento 3D de audio, muy usado en el cine y sobre todo en videojuegos, donde se puede juzgar la posición a partir de las fuentes de sonido (como los pasos de un enemigo) antes de aparecer en pantalla. Sin embargo, hay que destacar que el posicionamiento de sonido tridimensional está mucho más avanzado en el caso de sistemas de sonido 5.1 y 7.1. Para recrear un efecto similar con auriculares se utiliza la holofonía, sistema de audio que recrea casi a la perfección cualquier ambiente sonoro. Sin embargo, se usa muy poco debido a la necesidad de grabar las fuentes de sonido con micrófonos especiales y, por tanto, imposible de realizar en tiempo real. Esto hace que muchas veces la mayoría de las grabaciones que se escuchan sean grabadas en un estéreo diseñado para altavoces, que crean el efecto sonoro donde el sonido proviene del \"centro de la cabeza\" del oyente. Para simular los efectos tales como la reverberación de una estancia o sonidos que provienen de la parte de atrás, es necesario recrear dichas condiciones en la propia grabación, ya que los auriculares, al ir directamente al oído, no crean por sí mismos dichos efectos. Las grabaciones binaurales (las utilizadas para la holofonía) precisamente sirven para eso; sin embargo, por las razones antes mencionadas, son poco comunes en el cine y en la música.\n", "subsections": []}, {"name": "Peligros", "text": "Usar los auriculares en un nivel de volumen suficientemente alto puede causar el deterioro y/o la sordera temporal o permanente de oído debido a un efecto llamado enmascarar. El volumen del auricular tiene que competir con el ruido de fondo, especialmente en lugares excesivamente ruidosos, tales como estaciones del subterráneo, aviones y grandes multitudes. Esto conduce a la aparición del dolor normal asociado a niveles más altos de volúmenes, y los períodos prolongados del volumen excesivamente ruidosos son extremadamente perjudiciales.También entre los daños que se dan por el abuso del auriculaes a nivel alto, se encuentra el tinnitus.\nExiste una creencia que afirma que los auriculares pequeños pueden causar más daño que los grandes debido a que se introducen directamente en el oído. Sin embargo, esto es falso, puesto que los daños se producen en el oído interno, no en el externo. Así que el volumen, no el tamaño, influye en el nivel de riesgo.\nEn estos últimos años, el interés se ha vuelto a centrar netamente en la protección de la audición, y las compañías han respondido. Por ejemplo, la AVLS de Sony corrige diferencias en volúmenes de la pista mientras se están reproduciendo, y el chequeo de los sonidos de Apple normaliza los volúmenes máximos de pistas seleccionadas en iTunes. Al igual, la nueva tecnología de la marca Beats ha desarrollado sistemas de protección extensiva para el oído, creando límites de DB. Se pueden manipular también las etiquetas de volumen del archivo MP3; este método se debe hacer manualmente por el usuario por medio de software de terceros.\nEl gobierno francés ha impuesto un límite a todos los reproductores de música vendidos en el país: no deben ser capaces de producir más de 100 dB (el umbral de daño la audición durante su uso extendido es 80 dB, y el umbral del dolor, o de la pérdida de oído inmediata, es 130 dB).\nOtros riesgos se presentan por el conocimiento reducido de sonidos externos; algunas jurisdicciones regulan el uso de auriculares mientras se conducen vehículos, limitando generalmente el uso de auriculares a un solo oído. También suelen limitar el volumen del sonido.\n", "subsections": []}, {"name": "Véase también", "text": "Altavoz\nAmplificador\nAudífono\nConector de audio analógico\nVolumen (sonido)\n", "subsections": []}, {"name": "Referencias", "text": "↑ Real Academia Española. «auricular». Diccionario de la lengua española (23.ª edición).  En los aparatos telefónicos y, en general, en todos los empleados para percibir sonidos, parte de ellos o pieza aislada que se aplica a los oídos.\n↑ Real Academia Española. «audífono». Diccionario de la lengua española (23.ª edición).  Aparato para percibir mejor los sonidos, especialmente usado por los sordos.\n↑ Real Academia Española. «casco». Diccionario de la lengua española (23.ª edición).  Acepción 21, en plural: Aparato que consta de dos auriculares unidos por una tira de metal curvada o algo semejante, que se ajusta a la cabeza y se usa para una mejor recepción de los sonidos.\n↑ «auricular». Diccionario Español de Ingeniería (1.0 edición). Real Academia de Ingeniería de España. 2014. Consultado el 11 de mayo de 2014. \n↑ Definición de auricular en el Diccionario del español de México, editado por El Colegio de México. (Consultado jueves, 16 de septiembre del 2021.)\n↑ Definición de audífono en el Diccionario de la lengua española, editado por la Real Academia Española. (Consultado jueves, 16 de septiembre del 2021.)\n↑ «Beyerdynamic, historia». Archivado desde el original el 30 de noviembre de 2012. Consultado el 9 de noviembre de 2012. \n↑ a b «Headphone buying guide» (en inglés). CNET.com. Consultado el 9 de noviembre de 2012. \n↑ «Auriculares inalámbricos: sin cables y sin molestias». Consultado el 11 de septiembre de 2017. \n↑ «SonidoGaming, Guía de compra, ¿Qué Cascos Gaming comprar?». https://sonidogaming.com/. Consultado el 14 de agosto de 2022. \n↑ Artículo \"¿Qué significa cuando los audífonos se magnetizan?\", de Clare Edwards, en techlandia.com (Consultado jueves, 16 de septiembre del 2021.)", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Caja_de_recompensas", "title": "Caja de recompensas", "summary": "Busca fuentes: «Caja de recompensas» – noticias · libros · académico · imágenes\nEn el mundo de los videojuegos, una caja de recompensas (en inglés: loot box, loot crate o prize crate), también conocida caja de botín o cofre de recompensas, es un artículo virtual de un videojuego el cual puede ser redimido para recibir una selección aleatoria de diversos artículos de ese juego, variando de simple elementos de personalización para el propio avatar del comprador hasta equipamiento con gran impacto en la experiencia del juego como armas y armadura.\nUn loot box es típicamente una manera de monetización donde los jugadores o bien compran directamente (tanto con dinero real como virtual ganado en el juego) o reciben estas cajas durante la partida como recompensa. También cabe destacar sistemas en los que se requiere una llave para abrir esas cajas.\nLoot box se podría traducir como caja de recompensa o de botín, estos son originarios de los MMO (Juegos multijugador masivos en línea) y en los juegos gratuitos para plataformas móviles.\n", "sections": [{"name": "Historia", "text": "Las cajas de botín son una extensión de los sistemas de recompensas aleatorias de videojuegos anteriores, utilizados con frecuencia para otorgar recompensas aleatorias en juegos de rol en línea masivos (videojuego multijugador en línea masivo o MMORPG) u juegos similares.[1]​[2]​ Las cajas de botín adoptaron este enfoque y formularon un enfoque de monetización utilizado por juegos free-to-play en juegos móviles.[1]​ Las cajas de botín también incorporan elementos de la aleatoriedad de adquirir juguetes en cápsulas gachapon.\nLa primera instancia conocida de un sistema de cajas de botín se cree que es un objeto llamado \"Gachapon ticket\" que se introdujo en la versión japonesa de MapleStory, un MMORPG de desplazamiento lateral, en junio de 2004. Estos boletos se vendían a un precio de 100 yenes japoneses por boleto. Al igual que las máquinas de gachapon en la vida real, los jugadores obtenían artículos de juego elegidos al azar cuando usaban el boleto en \"Gachapon\", un puesto dentro del juego que se distribuía en todo el mundo del juego.[3]​\nEl juego chino free-to-play ZT Online (o simplemente Zhengtu), lanzado en 2007 por la red Zhengtu, también se considera uno de los primeros ejemplos de videojuegos que incluían cajas de botín como parte de su sistema de juego. Los jugadores en países asiáticos generalmente no tienen los fondos para comprar juegos a precio completo y utilizan cibercafés o PC bangs para jugar de forma gratuita, o recurren a la infracción de derechos de autor para obtener copias de juegos de forma gratuita. En lugar de tratar de cambiar este enfoque, juegos asiáticos como ZT Online introdujeron cajas de botín como medio para asegurar la monetización de un juego del cual de otra manera no obtendrían ingresos por la venta base.[4]​ En un año, Zhengtu Network informó ingresos mensuales de ZT Online que superaban los US$15 millones, justificando la rentabilidad de este esquema.[5]​[6]​ Esto llevó al enfoque de lanzar juegos como free-to-play con microtransacciones sobre el título.[4]​ Muchos juegos móviles free-to-play en regiones asiáticas ofrecerían enfoques de cajas de botín, siendo Puzzle & Dragons, lanzado en 2011, uno de los más destacados, utilizando su enfoque gacha para ser el primer juego móvil en ganar más de US$1 mil millones con su esquema de monetización.\nEn las regiones occidentales (América del Norte y Europa) alrededor de 2009, la industria de los videojuegos experimentó el éxito de Zynga y otros grandes editores de juego de redes sociales que ofrecían juegos de forma gratuita en sitios como Facebook, pero incluían microtransacciones para acelerar el progreso en el juego, lo que permitía a los editores depender de los ingresos de transacciones posteriores a la venta en lugar de la venta inicial.[4]​ Uno de los primeros juegos en introducir mecánicas similares a las cajas de botín fue FIFA 09, creado por Electronic Arts (EA), en marzo de 2009, que permitía a los jugadores crear un equipo de jugadores de fútbol asociación a partir de paquetes de cartas en el juego que abrían usando moneda en el juego obtenida mediante el juego regular o a través de microtransacciones.[7]​ Otro juego temprano con mecánicas de cajas de botín fue Team Fortress 2 en septiembre de 2010, cuando Valve agregó la capacidad de ganar \"cajas\" aleatorias para abrirlas con llaves compradas. Robin Walker de Valve afirmó que la intención era crear \"efectos de red\" que atraerían a más jugadores al juego, para que hubiera más jugadores que obtuvieran ingresos de las llaves para desbloquear cajas.[4]​ Valve luego hizo la transición a un modelo free-to-play, informando un aumento en el número de jugadores de más de 12 veces después de la transición,[6]​ y contrató a Yanis Varoufakis para investigar las economías virtuales.[8]​ En los siguientes años, muchos MMO y juegos de arena de batalla en línea multijugador (MOBA) también hicieron la transición a un modelo de negocio free-to-play para ayudar a aumentar su base de jugadores, muchos de ellos agregando la monetización de cajas de botín en el proceso,[6]​[9]​ siendo los primeros dos tanto Star Trek Online[10]​ como The Lord of the Rings Online en diciembre de 2011.\nPor separado, la serie FIFA incluyó un \"Modo FIFA Ultimate Team\" que permitía a los jugadores utilizar cartas de intercambio virtuales para construir un equipo. Inicialmente lanzado como contenido descargable (DLC), el \"Modo FIFA Ultimate Team\" hizo la transición a un complemento gratuito para el juego base con el lanzamiento de 2010, con la posibilidad de comprar paquetes de cartas como medio para generar ingresos para el juego.[4]​ EA aprovechó el éxito de esta transición para Mass Effect 3 en marzo de 2012. Mass Effect 3 ofrecía \"paquetes\" que contenían equipo inusual, que de otra manera solo se podía obtener \"moliendo\" a través del juego en línea. Según Jesse Houston, productor del juego, se utilizaron como medio para compensar el costo de desarrollo del modo multijugador del juego. El equipo de Mass Effect 3 trabajó en estrecha colaboración con el equipo de FIFA para lanzar adecuadamente estos paquetes, que Houston comparó con abrir un paquete de cartas de refuerzo de Magic: The Gathering para hacer que el jugador sienta que siempre estaba obteniendo valor del paquete.[4]​[11]​\nOtros ejemplos tempranos de juegos empaquetados con cajas de botín incluyen Counter-Strike: Global Offensive en agosto de 2013, que añadió \"cajas de armas\" en una actualización,[12]​ y Battlefield 4 en octubre de 2013, que añadió \"battlepacks\", aunque no se podían comprar hasta mayo de 2014 y nunca otorgaban objetos duplicados.[13]​ Call of Duty: Advanced Warfare, lanzado en noviembre de 2014, incluyó \"suministros\" que contenían objetos aleatorios, incluyendo diferentes variantes de las armas del juego, equipamiento de personajes y puntos de experiencia que se podían utilizar para personalizar el personaje.[14]​\nCon el éxito financiero de Overwatch y sus sistemas de cajas de botín, varios juegos, especialmente de franquicias populares, incluyeron la mecánica como parte de su metajuego en 2016 y 2017. Esto incluyó Call of Duty: WWII, Halo Wars 2, Gears of War 4, Assassin's Creed Origins, Middle-earth: Shadow of War y Forza Motorsport 7.[15]​[16]​ Para octubre de 2017, esto llevó a una revisión crítica de la práctica. En particular, el muy visible Star Wars Battlefront II, lanzado en medio de críticas a sus sistemas de cajas de botín en noviembre de 2017, llevó a discusiones renovadas en varios niveles gubernamentales sobre la legalidad de estos sistemas.[17]​[18]​ El agregador de reseñas OpenCritic anunció planes para incluir un \"intrusismo en el modelo de negocio\" para juegos que proporcionen una métrica sobre cuánto pueden afectar el sistema de botín y DLC del juego.[19]​ La reacción a las cajas de botín en la segunda mitad de 2017 fue considerada una de las principales tendencias en la industria de los videojuegos en 2017.[20]​[21]​[22]​\n", "subsections": []}, {"name": "Diseño", "text": "Las cajas de recompensas suelen denominarse de diversas maneras dependiendo del género del juego en el que se encuentren. En juegos de disparos se suelen denominar “loot boxes” o “loot crate”, mientras que en juego de azar, especialmente en juego de cartas se suelen denominar como “boosters packs” como se hace tradicionalmente en los juegos de cartas clásicos.[23]​ \nEstas cajas de recompensas suelen contener mejoras estéticas que no afectan al contenido del juego en el caso de los juegos de disparos u otros géneros como los MOBA, a diferencia de las cajas de recompensa de los juegos de azar que suelen incluir contenidos que afectan de manera directa el juego.[24]​\nLas cajas de botín usualmente se pueden obtener de diversas maneras dentro del juego, como recompensa en ciertos eventos como subir de nivel o completar una partida. Otras maneras de obtención sería a través de promociones fuera del juego o directamente comprándolas con fondos reales.\nLas cajas de recompensas generalmente son obtenidas mediante interfaces integradas dentro del juego que suelen contener efectos visuales y sonoros para captar la atención del jugador. Algunos juegos diseñan estas interfaces para asemejarse a máquinas tragaperras, ruletas u otros elementos relacionados con juegos clásicos de azar. En estas interfaces también es común que, una vez abierta la caja de recompensas, sea muy sencillo poder obtener otra para incitar su consumo.[25]​\n", "subsections": []}, {"name": "Aparición", "text": "Su primera aparición data de entre 2007 a 2010. Concretamente se cree que apareció en el juego gratuito Chino ZT Online (también conocido como Zhengtu) publicado en 2007 por Zhengtu Network; desde ese momento se fue extendiendo en gran variedad de juegos tanto gratuitos como de pago. Uno de los primeros juegos de pago donde además tenías la opción de abrir un \"sobre\" con diferentes ítems del juego fue el popular modo Ultimate Team de la saga Fifa. El primero de esta en incorporar el modo y los sobres. \nLas loot box o \"cajas de botín\" están reguladas bajo las leyes de China, Japón, Australia y la Isla de Man y están siendo sujeto de investigación por los reguladores de juegos de azar (que pueden causar ludopatía) de varios países. Han sido criticadas por ir en contra del consumidor cuando son implementadas en juegos de pago. También por su uso en los juegos p2w(paga para ganar) donde afectan directamente a la experiencia de juego y las mecánicas de este.\nPor otro lado Ragnarok Online disponía de loot box desde el año 2004 con la cual podías adquirir cosméticos, objetos para mascota y equipamiento, entre otros.\n", "subsections": []}, {"name": "Polémica", "text": "Los sistemas de botín se hicieron más evidentes con la aparición del famoso juego Overwatch de Blizzard en 2016 y una gran cantidad de juegos en 2017 adoptaron este mismo sistema de juego de azar virtual haciendo que los sistemas de botín fueran ampliamente criticados durante la segunda mitad del 2017, en particular Star Wars: Battlefront II llegando a conseguir el comentario más negativo de la historia del foro más grande de internet: Reddit. \nTras su lanzamiento, Battlefront II recibió opiniones mixtas de los críticos. El juego recibió críticas generalizadas sobre el estado de loot boxes, lo que podría dar a los jugadores ventajas sustanciales en el juego si compran botines con dinero real. Una respuesta del equipo de la comunidad de Electronic Arts en Reddit sobre el tema se convirtió en el comentario más desfavorecido en la historia del sitio, y en respuesta EA finalmente eliminó temporalmente las microtransacciones del juego.\nDurante el prelanzamiento de la beta, el juego, publicado por EA fue criticado por los jugadores y la prensa de juegos por la introducción de los sistemas de monetizacion conocidos como loot box, que da a los jugadores sustanciales ventajas a través de los elementos adquiridos en el juego con dinero real a pesar de que tales elementos pudieran también ser comprados con dinero del juego, los jugadores en promedio tienen que jugar rutinariamente aproximadamente 40 horas para desbloquear un único personaje, tales como Darth Vader. Los desarrolladores han tenido que adaptar el número de objetos del juego, que el jugador recibe simplemente jugando. Sin embargo, después de que el juego entró en prelanzamiento algunos jugadores y periodistas que recibieron la copia del juego informaron de características controvertidas de juego, como las recompensas, de ser ajenas a la actuación del jugador en el juego.\nEl 12 de noviembre de 2017, un usuario de Reddit se quejó de que a pesar de que pagó 80 dólares en comprar la Edición de Lujo del juego, Darth Vader seguía siendo inaccesible para jugar, y el uso de este personaje requiere una gran cantidad de créditos de juego. Se necesitarían 40 horas de juego para acumular suficientes créditos para desbloquear un solo héroe. En respuesta a la comunidad del juego, el equipo de la comunidad EA defendió los polémicos cambios diciendo que su intención de hacer que los usuarios pudieran ganar créditos para desbloquear héroes era dar a los usuarios un sentimiento de «orgullo y satisfacción» después de desbloquear un héroe. Esto hizo que muchos usuarios de Reddit se sintieran frustrados por la respuesta, lo que generó más de 670 000 votos negativos, convirtiéndose en el comentario con más votos negativos en la historia de la plataforma. En respuesta a la indignación de los usuarios, EA redujo el costo de los créditos para desbloquear héroes en un 75%. Los créditos de recompensa por completar la campaña también se redujeron. EA retiró temporalmente las microtransacciones por la gran avalancha de quejas de los usuarios.\n", "subsections": []}, {"name": "Regulación y legislación", "text": "Debido a la posibilidad aleatoria de obtener artículos tras comprometer fondos del mundo real, los juegos que usan el sistema de cajas de botín podrían considerarse una forma de juego de azar, pudiendo generar ludopatía en los jugadores. Si bien las leyes de juego varían de un país a otro, las cajas de botín suelen distinguirse de los juegos de azar ya que no se puede transformar el contenido de una caja de botín en dinero del mundo real por medios legítimos dentro del videojuego, y, por muy pequeña que sea, siempre se obtiene alguna recompensa en estas cajas.\nLos juegos con sistemas de cajas de botín han pasado a estar sujetos a reglamentación en varios países asiáticos, mientras su regulación está siendo considerada en algunos países occidentales.\n", "subsections": [{"name": "Asia y Oceanía", "text": "China\nEn diciembre de 2016, el  Ministerio de Cultura de China anunció una legislación que obligaría a los editores de juegos en línea, a partir de mayo de 2017,a hacer público la \"probabilidad de extracción de todos los elementos y servicios virtuales\".[26]​ Cuando la ley entró en vigor, los editores cumplieron, lo que resultó en la publicación de una variedad de estadísticas que cuantificaron las probabilidades de que los jugadores chinos recibieran diferentes categorías de artículos de cada caja de botín, algunas de las cuales eran tan bajas como 0.1%.[27]​ Otros cambios exigidos por las nuevas regulaciones requerían que los editores limitaran la cantidad de compras de cajas de botín que cualquier jugador puede comprar en un día (incluida la limitación del tamaño de varios paquetes de paquetes de cajas de botín) y requieren que el editor otorgue probabilidades más favorables al jugador para que obtenga artículos raros con la cantidad de cajas de botín que han abierto, lo que le asegura al jugador que recibirá un artículo raro abriendo una cantidad fija de cajas de botín. Un documento de 2021 evaluó el estado de muchos juegos chinos que usaban cajas de botín, y encontró que de los 100 mejores juegos actuales que se ofrecen en la tienda de aplicaciones de Apple de China, 91 de esos juegos incluían cajas de botín, pero solo alrededor del 5% de estos cumplían una adecuada divulgación de las probabilidades de las cajas de botín a la ley de China.\nLa ley también prohibió a los editores de juegos vender directamente \"boletos de lotería\", como cajas de botín. En junio de 2017,[28]​ Blizzard Entertainment anunció que, de acuerdo con las nuevas leyes y regulaciones, las cajas de botín en su juego  Overwatch ya no estarían disponibles para su compra en China. En su lugar, los jugadores comprarían moneda del juego y recibirían cajas de botín como \"regalo\" por realizar la compra.[29]​\nA partir de noviembre de 2019, la Administración General de Prensa y Publicaciones de China prohibió la venta de cajas de botín a usuarios menores de ocho años y restringió su venta a usuarios mayores menores de 18 años a un límite máximo de gasto mensual que oscila entre 200 renminbi y 400 renminbi.\nJapón\nJapón es el lugar de nacimiento de las “Gacha” o “Gachapon” (es el término japonés para lo que más tarde se conocería como \"caja de recompensa\" en el resto del mundo). En 2004 los desarrolladores empezaron a implementar estos mecanismos gacha en los móviles y en 2007, incluso antes de la introducción de los teléfonos inteligentes, ya introducían aplicaciones de juegos gratuitos en teléfonos destacados.\nCon el éxito de este modelo gacha, se quiso aumentar los beneficios implementando un nuevo modelo que se denominó “kompu gacha” o “gacha completo” que consiste en vender una serie de artículos que uniéndolos se convertirían en otro artículo aún más raro y valioso, con el fin de alentar a seguir comprando sin asegurar que en algún momento llegues a conseguir el artículo que te falta. En mayo de 2012, La Agencia Nacional de Asuntos al Consumidor de Japón (“CAA”) prohibió esta práctica mediante la emisión de una opinión legal de que los artículos virtuales podrían considerarse “premios” según la legislación redactada en 1977.\nLos desarrolladores de juegos móviles japoneses, incluidos Gree y DeNA  , trabajaron para establecer un grupo industrial autorregulado, la Asociación de Juegos Sociales de Japón.[30]​\nCorea Del Sur\nEn marzo de 2015, los miembros de la Asamblea Nacional de Corea del Sur , dirigido por el Partido Libertad de Corea, propuso una enmienda a la industria de los juegos existentes en el país que hicieran pública “la 'información sobre el tipo, la relación de composición, y la probabilidad de adquisición” de artículos otorgados por cajas de recompensas. Aunque la enmienda no fue aprobada, dio lugar a intentos de autorregulación por parte de la industria de juegos de Corea del Sur.  Esto no ha convencido a los miembros de la asamblea, que han continuado proponiendo regulaciones estatutarias. Sin embargo, ha habido varias revisiones a la autorregulación (la más reciente, en julio de 2018), que ahora requiere que todos los videojuegos muestren claramente las tasas de pago de los elementos de las cajas de botín para el jugador. También hay planes en un futuro próximo para expandir el alcance de esta regulación para incluir otras compras dentro del juego, como la tasa de éxito de un artículo consumible pagado cuyo propósito es mejorar otro artículo virtual.\nLa Comisión de Comercio Justo de Corea aún supervisa los problemas de los consumidores relacionados con las cajas de botín y los videojuegos; En abril de 2018, emitió una multa de US $ 875,000[31]​ contra Nexon relacionada con su juego Sudden Attack por prácticas engañosas de botín, así como dos multas menores a otras compañías. \nSingapur\nEn octubre de 2014, el parlamento de Singapur aprobó la Ley de Juego Remoto, que introdujo la prohibición de los sitios web de juegos de azar sin licencia y multas para cualquiera que la viole. La definición de juego de la ley incluía apostar \"créditos virtuales, monedas virtuales, fichas virtuales, objetos virtuales o cualquier cosa similar que se compre... en relación con un juego de azar\",[32]​  lo que genera preocupaciones de que requeriría que los productores de cualquier juego en el que los jugadores pagaron dinero y recibieron un resultado aleatorio para buscar una licencia para operar del gobierno. \nEn respuesta al cabildeo de la industria de los juegos, el ministro de Asuntos Internos, S. Iswaran, aclaró la ley en el parlamento, afirmando que \"el proyecto de ley no tiene la intención de cubrir los juegos sociales en los que los jugadores no juegan para adquirir una oportunidad de ganar dinero y donde el diseño del juego no lo hace. permitir que el jugador convierta los créditos del juego en dinero o mercadería real fuera del juego \". El ministro también excluyó específicamente las plataformas que ofrecían \"monedas virtuales que pueden usarse para comprar o canjear otros productos de entretenimiento\", como Steam , de las disposiciones del proyecto de ley.[33]​\nSin embargo, el ministro también dijo:\nEl hecho es que la línea divisoria entre los juegos sociales y los juegos de azar se está volviendo cada vez más borrosa. Lo que hoy puede parecer benigno puede transformarse rápidamente en algo mucho más siniestro mañana en respuesta a las oportunidades del mercado y las tendencias de los consumidores. Es por eso que la legislación tiene un formato amplio.\nLa Ley de Juego Remoto fue revisada por el Ministerio del Interior de Singapur en 2021 con el objetivo de enmendar la ley para que sea independiente de la tecnología, y podría incluir regulaciones para cajas de botín entre otros tipos de productos de juego no tradicionales.[34]​\nAustralia\nDentro de Australia, el debate sobre los juegos con cajas de recompensas es, si estos se pueden jugar \"por dinero o por cualquier otra cosa de valor\"; la pregunta sigue siendo si los elementos que solo existen dentro del juego tienen un \"valor\" que se pueda cuantificar o si esto está relacionado con el prestigio de un elemento.  La Comisión Victoriana de Regulación de los Juegos de Azar y las Bebidas Alcohólicas ha declarado que considera que las cajas de recompensas son juegos de azar, pero no tiene autoridad para enjuiciar a las empresas registradas en el extranjero. La comisión ha sugerido \"una calificación R inmediata \" para cualquier juego que incluya cajas de recompensas como solución a esta limitación. En marzo de 2018,La oficina australiana eSafety publicó una lista de directrices de seguridad sobre los peligros de las cajas de recompensas.\nEl Senado australiano aprobó una moción, encabezada por Jordon Steele-John , en junio de 2018 para que el Comité de Referencias de Medio Ambiente y Comunicaciones investigue las cajas de recompensas e informe al Senado en septiembre de 2018. La investigación, que comenzó en agosto de 2018, evaluó el uso de cajas de recompensas en videojuegos y las consideró en temas relacionados con el juego y los efectos en los niños. El informe, publicado a mediados de septiembre de 2018, encontró que las cajas de recompensas son \"psicológicamente similares al juego\", y que los juegos con cajas de recompensas están potencialmente \"explotando los trastornos del juego entre sus clientes\". El Comité recomendó que los juegos con cajas de botín se etiqueten para advertir sobre la orientación de los padres e indicar que contienen \"contenido de juegos de apuestas\" y sugerir que dichos juegos se clasifiquen para representar la edad legal para los juegos de azar en el país.[35]​ En el informe final, el Comité instó al gobierno australiano a \"emprender una revisión exhaustiva de las cajas de recompensas en los videojuegos\" mediante un esfuerzo multidepartamental para determinar qué medidas legislativas y de otro tipo deben tomarse.\nUn informe de febrero de 2020 del Comité Permanente de Política Social y Asuntos Legales de la Cámara de Representantes de Australia que se centró en el contenido de Internet que debería bloquearse detrás de las puertas de verificación de edad recomendó que la Oficina del Comisionado de eSafety u organismo similar \"informe al gobierno australiano sobre las opciones para restringir el acceso a cajas de botín y otros elementos de juego simulado en juegos de computadora y video a adultos mayores de 18 años, incluso mediante el uso de verificación de edad obligatoria \".\nPara agosto de 2020, la Junta de Clasificación de Australia (ACB) había actualizado sus regulaciones de que los juegos con cualquier micro transacción, incluidas las cajas de recompensas, deben etiquetarse en su portada como que contienen \"compras dentro del juego\".\nEl diputado Andrew Wilkie anunció en julio de 2021 sus intenciones de presentar un proyecto de ley en agosto de 2021 que requeriría que los videojuegos con cajas de recompensas fueran clasificados automáticamente por la ACB como R18+. Según la ley vigente, la venta de juegos R18+ está restringida a menores. Wilkie declaró que creía que las cajas de recompensas en los videojuegos preparaban a los menores \"para apostar en el futuro\" como una razón fundamental para el proyecto de ley.\nNueva Zelanda\nEn Nueva Zelanda prefieren optar por una postura neutral, Trish Millard, un gerente del Departamento de Asuntos Internos de Nueva Zelanda, explica que su equipo ha seguido muy de cerca el debate internacional sobre las cajas de recompensas y que tras analizar con detenimiento los diversos usos de las cajas de recompensas, se dieron cuenta de que ninguno entra en la clasificación de apuesta según lo que establece el Acta de Apuestas de Nueva Zelanda que se redactó en 2003. Además, por otro lado, el gobierno local considera que no sería ilegal para los neozelandeses incurrir en apuestas digitales si el proveedor de servicios se encuentra en otro país.[36]​\n"}, {"name": "América", "text": "Estados Unidos\nActualmente no hay leyes en los Estados Unidos que se dirijan a las cajas de botín, aunque a partir de mediados de 2017 destacaron varias preocupaciones sobre el uso de artículos virtuales con fines de juego.  En la jurisprudencia anterior, los tribunales han dictaminado que los juegos de azar con moneda virtual dentro de un videojuego no son ilegales siempre que no existan vínculos con dinero real, pasos que Blizzard Entertainment y Riot Games han realizado con sus títulos. Además, la mayoría de los estados definen las leyes del juego basándose en recibir algo de valor al pagar por un juego de azar y, tradicionalmente, los artículos del juego se consideran sin valor en la jurisprudencia anterior. Sin embargo, con jueces de tribunales con más conocimientos técnicos que pueden considerar el \"valor\" más que un valor financiero, junto con una nueva percepción de cuánto valor pueden tener los elementos del juego, podría cambiar la forma en que el marco en los Estados Unidos clasificarían las cajas de botín.\nHawái\nLos representantes del estado de Hawái, Chris Lee y Sean Quinlan, emitieron un comunicado en noviembre de 2017 tomando una postura en contra de las cajas de botín. \"Este tipo de cajas de botín y micro-transacciones están explícitamente diseñados para aprovecharse de la psicología humana y explotarla de la misma manera que los juegos de casino están diseñados\". Planean introducir una legislación en el estado de Hawái, específicamente para bloquear la venta de Star Wars Battlefront II, y que han hablado con legisladores de otros estados para promulgar leyes similares, de modo que la legislación federal podría ser posible si suficientes estados toman medidas.[37]​\nEn lugar de aprobar una legislación que podría tener una pendiente resbaladiza de efectos dañinos en la industria, Quinlan declaró que preferiría que la industria se autorregulara, ya sea excluyendo mecánicas similares a las de los juegos de azar en los juegos comercializados para niños, o haciendo que la industria califique los juegos con estos mecanismos para audiencias más maduras, lo que afectaría la forma en que se venderían y comercializarían.  Lee más tarde describió cómo presentaría una ley, que prohibiría la venta de juegos a cualquier persona menor de 21 años si contuviera un elemento de juego, definida si los fondos del mundo real se utilizan para proporcionar un \"porcentaje de probabilidad\" de recibir un artículo del juego en lugar del artículo directamente, aplicado tanto en el comercio minorista como en la distribución digital. Para febrero de 2018, se presentaron dos proyectos de ley separados en la legislatura estatal de Hawái: un proyecto de ley requeriría que los juegos minoristas con mecanismos de caja de botín tuvieran un etiquetado claro que diga \"Advertencia: contiene compras dentro del juego y mecanismos similares a los juegos de azar que pueden ser dañinos o adictivos\" , mientras que un segundo proyecto de ley regularía la venta de estos juegos solo a los mayores de 21 años, la edad mínima para jugar dentro del estado.[38]​ Sin embargo, en marzo de 2018, los proyectos de ley no cumplieron con los requisitos necesarios para ser considerados en la legislación y fueron descartados.\nWashington\nEn enero de 2018, tres senadores del estado de Washington presentaron el Proyecto de Ley del Senado 6266 (S-3638.1) en la legislatura estatal, que, si se promulga, ordenaría a la Comisión de Juego del Estado de Washington que investigue las cajas de botín y su posible efecto sobre el juego de menores.[39]​\nMisuri\nA principios de mayo de 2019, el senador republicano Josh Hawley de Misuri anunció que tiene la intención de presentar un proyecto de ley llamado \"Ley para proteger a los niños de los juegos abusivos\" que prohibiría las cajas de botín y las micro-transacciones de pago para ganar en \"juegos jugados por menores\", utilizando calificaciones similares para determinar esto, como se definió anteriormente en la Ley de protección de la privacidad en línea de los niños . La Comisión Federal de Comercio sería responsable de hacer cumplir el proyecto de ley emitiendo juicios e imponiendo multas a los juegos que no sigan estos pasos.[40]​ \nEl proyecto de ley se presentó formalmente en el Senado de los Estados Unidos en el 116 ° Congreso el 23 de mayo de 2019 como Proyecto de Ley del Senado 1629, con los copatrocinadores Ed Markey (Massachusetts) y Richard Blumenthal (Connecticut), ambos demócratas.  El proyecto de ley fue remitido al Comité Senatorial de Comercio, Ciencia y Transporte en ese momento, y no se tomaron más medidas al respecto, y el proyecto de ley expiró al final del 116.º Congreso de los Estados Unidos el 3 de enero de 2021.[41]​\nLa Junta de clasificación de software de entretenimiento (ESRB), como PEGI, proporciona clasificaciones voluntarias de contenido de videojuegos para juegos en los Estados Unidos. La ESRB no considera las cajas de botín como una forma de juego y no calificará dichos juegos con sus descripciones de contenido de \"Apuestas reales\". La ESRB considera que las cajas de botín son equivalentes a los paquetes de refuerzo de juegos de cartas coleccionables, y que el jugador siempre recibe algo de valor al abrir una compra de caja de botín, incluso si no es algo que el jugador desee. La Junta declaró además que los juegos que están etiquetados con \"Apuestas reales\" probablemente se clasificarán como \"AO\" (solo para adultos), para cumplir con las leyes de juegos de azar; los minoristas normalmente no almacenan estos juegos y, por lo tanto, dañarían a un editor. Además, la ESRB también se ve a sí misma como responsable de ayudar a guiar a los padres sobre el contenido de los videojuegos. Como ejemplo, encontraron que los padres estaban más preocupados por los niños que gastan dinero en el juego y no por los aspectos relacionados con el juego, y por lo tanto no incluyeron las cajas de botín como una de sus descripciones de contenido, aunque les gustaría agregarlas en el futuro si la legislación o otros estándares de la industria establecen el juego como un tema crítico.\nLa Entertainment Software Association, la organización matriz de la ESRB, afirmó que las cajas de botín no son una forma de juego, enfatizando que son un aspecto voluntario y opcional en estos juegos. Las principales editoriales Electronic Arts  y Take-Two Interactive también han declarado que no ven las cajas de botín como juegos de azar debido a su naturaleza voluntaria. Andrew Wilson, director ejecutivo de Electronic Arts declaró en mayo de 2018 que continuarán incluyendo cajas de botín en sus juegos.[42]​\nMientras que otros editores han accedido a las preocupaciones gubernamentales sobre las cajas de botín, Electronic Arts ha sido generalmente firme en el sentido de que no creen que su implementación de cajas de botín sea una forma de juego. En declaraciones realizadas en audiencias con el Comité Británico de Deportes, Medios, Cultura y Digital Digital, los representantes de EA compararon las cajas de botín con \"mecánicas sorpresa\" que uno encontraría con los huevos de Kinder Surprise, y creen que su implementación de cajas de botín es \"bastante ética y bastante divertido, bastante agradable para la gente \". \nA raíz de las críticas sobre Star Wars Battlefront II, los analistas financieros sugirieron que la industria de los videojuegos necesitará desarrollar principios de autorregulación para manejar mejor la monetización y los esquemas de caja de botín para evitar la intervención del gobierno en la industria.\nEn febrero de 2018, la senadora Maggie Hassan sacó a relucir el tema de las cajas de botín durante una audiencia del Comité de Comercio, Ciencia y Transporte del Senado a cuatro nominados de la Comisión Federal de Comercio , que la Comisión supervisa. Preguntó a los nominados si \"el hecho de que los niños sean adictos a los juegos y actividades como cajas de botín que podrían hacerlos más susceptibles a la adicción es un problema que merece atención\"; los cuatro nominados acordaron que sería necesaria la atención. El mismo día, Hassan escribió una carta a la JERS \"para revisar la integridad del proceso de calificación y las políticas de la junta en lo que respecta a las cajas de botín, y para tener en cuenta el daño potencial que este tipo de micro-transacciones pueden tener en los niños\" y \"examinar si el enfoque de diseño y marketing de las cajas de botín en los juegos dirigidos a los niños se está llevando a cabo de una manera ética y transparente que protege adecuadamente las mentes en desarrollo de los niños pequeños de las prácticas depredadoras\".  \nEn respuesta a la carta de Hassan, la ESRB anunció en febrero de 2018 que requeriría que cualquier juego calificado que ofrezca cualquier tipo de compra en el juego con fondos del mundo real, que abarquen cajas de botín, esté etiquetado como tal. La ESRB afirmó que el etiquetado estaba destinado principalmente a ayudar a los padres a ver los juegos de sus hijos y, debido a la brevedad del espacio que tienen en los envases minoristas, no optó por exigir a los editores que identificaran la forma específica de micro-transacción. Sin embargo, la junta aún afirmó que todavía no creen que las cajas de botín en sí mismas sean una forma de juego. Si bien la senadora Hassan calificó la decisión de la ESRB como un \"paso adelante\", seguía preocupada por \"el escepticismo de la ESRB con respecto a la naturaleza potencialmente adictiva de las cajas de botín y las micro-transacciones en los videojuegos\", y declaró: \"Trabajaré con todas las partes interesadas relevantes para continuar supervisar estos temas y garantizar que se realicen mejoras significativas para aumentar la transparencia y la protección del consumidor \".  La ESRB introdujo esta nueva etiqueta \"Compras en el juego (incluye elementos aleatorios)\" en abril de 2020 para ser utilizada en juegos que incluyen mecánicas de estilo caja de botín.[43]​\nDurante una audiencia del Congreso en noviembre de 2018 sobre problemas con la filtración de datos de Cambridge Analytica y asociados con Facebook y Google , Joseph Simons , presidente de la Comisión Federal de Comercio (FTC), prometió al Congreso que la FTC investigará las cajas de botín, considerando el mercado potencial. valor de las micro-transacciones.  Después de que el gobierno cerró a principios de 2019, retrasando la revisión de la FTC, Hassan presionó a la FTC para que proporcionara una actualización sobre su revisión de las cajas de botín. \nLa FTC celebró una audiencia pública sobre cajas de botín el 7 de agosto de 2019, dirigiéndose a representantes de la industria y revisando los comentarios públicos presentados antes de la reunión. Durante la reunión, los representantes de la ESA declararon que Microsoft, Nintendo y Sony están trabajando en el desarrollo de requisitos para juegos nuevos o actualizados utilizando cajas de botín, publicadas en sus respectivos sistemas de consola, para revelar las probabilidades de los artículos de las cajas de botín. Otros editores de la ESA, incluidos Activision Blizzard, Bandai Namco, Bethesda, Bungie, Electronic Arts, Take-Two Interactive, Ubisoft, Warner Bros y Wizards of the Coast, también declararon que están comprometidos a hacer lo mismo con otras plataformas de juego. como en computadoras personales, como para alinearse con los requisitos existentes para las plataformas móviles iOS App Store y Google Play. Se espera que estos esfuerzos estén en marcha antes de finales de 2020, según la ESA. Nintendo emitió una nueva política al día siguiente para reflejar la declaración hecha a la FTC, requiriendo que se publiquen las probabilidades de la caja de botín para todos los juegos nuevos y actualizados en sus sistemas, y asegurando que dichos juegos con compras dentro del juego puedan ser regulados por los padres.  Epic Games afirmó que también seguirían políticas similares adoptadas por la ESA y otros editores, ya que habían tomado medidas para eliminar las cajas de botín de Fortnite, Rocket League y otros juegos de su cartera.[44]​\n"}, {"name": "Europa", "text": "Unión Europea\nLa Unión Europea no tiene competencia en el área de los juegos de azar. Por lo tanto, no puede legislar sobre el tema de las cajas de botín directamente, y ha adoptado por lanzar varias comunicaciones y recomendaciones sobre la protección de los menores en el contexto de los juegos de azar. A nivel nacional, aunque las definiciones legales de juegos de azar varían entre los Estados miembros, las cajas de recompensas no se consideran juegos de azar en el sentido legal. Las excepciones son Bélgica y los Países Bajos, donde las autoridades han prohibido las cajas de botín en los videojuegos.\nUn informe de julio de 2020[45]​ preparado en nombre de la Comisión del Parlamento Europeo sobre el Mercado Interior y la Protección del Consumidor (IMCO) encargó un extensivo estudio acerca del efecto de las cajas de recompensas en los consumidores, poniendo el foco en los más jóvenes. El estudio destaca que los intentos de regular las cajas de recompensas como juegos de azar, es decir, meter estos sistemas dentro de la legislación del juego, son en su mayor parte infructuosos. Por ello, se sugiere que el tema debe ser tratado como una cuestión de protección al consumidor.\nEl informe identificó que las cajas de botín en los videojuegos tienen \"características de diseño problemáticas\" que crean un \"impulso irresistible de jugar\" y una \"tensión creciente que solo podría aliviarse jugando en un bucle adictivo\". Si bien el informe identificó que esto tenía similitudes con los juegos de azar, los autores también instaron a que el Parlamento Europeo considere el tema del botín en un punto de vista de protección del consumidor, ya que puede crear un comportamiento adictivo particularmente en los jóvenes. El informe incluía recomendaciones sobre como proteger al consumidor respecto a estos sistemas, como sensibilizar a los jugadores y padres sobre el riego de estos elementos, restringir la publicidad de juegos que contienen estos elementos, implementar sistemas de control parental, usar otros modelos de compras \"in-game\" en los que no obtengas objetos aleatorios, prohibirlas (siguiendo el modelo belga y holandés) o haciendo que estas cajas de botín no cuesten dinero real, sino que sean adquiridas a cambio de monedas del videojuego.\nEspaña\nEn una comparecencia del ministro Alberto Garzón en febrero de 2020 se habló del riesgo de estos elementos de los videojuegos y su propuesta de regulación, no a nivel español si no a nivel común europeo, puesto que ya existía regulación en otros países.[46]​\nEn octubre de 2021 se preparó la presentación de una reforma para la Ley del Juego de 2011 en la que no se recoge ninguna mención a las cajas de recompensa.[47]​\nOtra mención en noviembre del mismo año[48]​ ha diferenció entre 4 tipos de cajas, distinguiéndose mediante si hay que pagar para conseguirlas o no (con dinero real) y si ofrecen una recompensa  con valor económico o no. Según el artículo 5 título 2 de la ley del juego de 2011 únicamente se recoge el tipo en el que haya un pago con dinero real y reporten un beneficio económico siempre y cuando contenga un componente de azar, puesto que estas serían consideradas juego de azar, y al no estar reguladas se prohíben.\nLa reforma de la ley del juego está prevista para 2022. Sobre la regulación se diferenciará entre estos cuatro tipos de cajas y entre público menor de edad o mayor de edad según palabras del director general de Ordenación del Juego del Ministerio de Consumo Mikel Arana.\nPaíses Bajos\nEn abril de 2018, la Autoridad Holandesa de Juegos emitió una opinión legal de que los juegos con sistemas de cajas de botín que permiten el intercambio de los artículos obtenidos son ilegales. En un informe[49]​,la autoridad afirmó que cuatro juegos de los diez juegos involucrados en el estudio violaban la ley del juego de esta manera. Concluyó que, si bien el resto de sistemas de cajas de recompensas de los seis juegos restantes entraban en el marco de la ley, fomentaban la adicción por igual.\nLa autoridad dio a los desarrolladores de los cuatro juegos ocho semanas para corregir su sistema de caja de botín o enfrentarse a multas y posibles prohibiciones de venta de dichos juegos en los Países Bajos. Dichos juegos, según el medio holandés NOS,[50]​ eran Fifa 18, Dota 2, PUBG y Rocket League. Al parecer, el problema reside en el precio del contenido obtenido en las cajas de recompensas de estos videojuegos, el cual es negociable. Esto hace que los jugadores, al obtener artículos raros, tengan la posibilidad de obtener dinero, condición suficiente para catalogarse como juego de azar.\nPor otro lado, Valve deshabilitó el intercambio de artículos en Counter-Strike: Global Offensive, Team Fortress 2 y Dota 2 en Países Bajos, afirmando que la autoridad les dijo que tenían hasta el 20 de junio de 2018 para remediarlo.[51]​ El 11 de julio de 2018, Valve volvió a habilitar la capacidad de los jugadores para intercambiar elementos, pero restringió a los usuarios de los Países Bajos y Bélgica la apertura de las cajas de botín.[52]​ \nEA Sports no adaptó FIFA, lo que llevó a la autoridad a poner multas. EA presentó una demanda, pero perdió su caso en octubre de 2020. Se le ordenó eliminar la capacidad de vender cajas de botín dentro de tres semanas o ser multado con un total de 500.000 € semanales, hasta un máximo de 5 millones de euros hasta su retirada.[53]​\nEl 16 de abril de 2019, Psyonix, la desarrolladora de Rocket League, deshabilitó en los Países Bajos (y Bélgica) la posibilidad para abrir cajas de botín con llaves en Rocket League debido a las regulaciones gubernamentales.[54]​\nBélgica\nEn abril de 2018, tras la decisión de los Países Bajos sobre las cajas de botín, la Comisión de Juegos de Bélgica, ordenado por el Primer Ministro Belga Koen Geens completó un estudio[55]​ de los sistemas de cajas de botín en cuatro juegos: FIFA 18, Overwatch, Counter-Strike: Global Offensive y Star Wars Battlefront II. Este estudio determinó que los sistemas de caja de botín de los tres primeros videojuegos se consideraban juegos de azar, y estaban sujetos a las leyes de juego de Bélgica. El desarrollador de Star Wars Battlefront II hizo algunos ajustes poco después del lanzamiento y no se consideró un juego de azar.[56]​ \nEl estudio destacó que los desarrolladores utilizan cada vez más técnicas problemáticas para que los jugadores inviertan en estas cajas de botín. Algunas de estas técnicas son:\nGenerar expectativa de ganancias emocionales: el cuadro de botín de incertidumbre está vinculado a la expectativa de ganancias.\nUn jugador puede pensar que comprar una caja de botín proporciona una ventaja, lo cual no siempre es el caso.\nMezclando ficción y realidad: personas reales conocidas promueven las cajas de botín (siendo FIFA el principal ejemplo, ya que se obtienen atletas de la vida real en el videojuego).\nEsconder el generador aleatorio (técnica utilizada para no desanimar a los jugadores ante la baja probabilidad de obtener objetos raros).\nLa Comisión ordenó la eliminación de los sistemas de botines de estos tres juegos, o de lo contrario los editores podrían enfrentar delitos penales y multas de hasta 800.000 euros. \nA diferencia de Países Bajos, la resolución belga no considera la opción de vender o intercambiar el contenido de las cajas de recompensas como un factor importante al determinar si el sistema se considera juego de azar o no. La Comisión de Juegos de Bélgica considera el juego de azar como cualquier juego por el cual una apuesta puede conducir a la pérdida o la victoria de al menos uno de los jugadores. Tomando Overwatch como ejemplo: los jugadores, usando dinero real, pueden comprar cajas de botín que contienen artículos coleccionables al azar, lo que constituye una apuesta. La posibilidad de una victoria o una pérdida se refiere, en este caso, a obtener el artículo deseado. A pesar de ser completamente estéticos y no intercambiables fuera del juego (ya que el elemento se vincula a la cuenta del jugador), los cosméticos tienen un valor atribuido por el jugador. Por lo tanto, como no hay forma de obtener los artículos deseados directamente, se considera juego de azar.[57]​\nEn respuesta al anuncio, varias compañías anunciaron que las cajas de botín no estarían disponibles para los clientes belgas. Algunos ejemplos son:\nValve restringió a los usuarios de los Países Bajos y Bélgica la apertura de las cajas de botín.[54]​\n2K Games modificó NBA 2K para cumplir con la regla al eliminar la capacidad de comprar paquetes de cartas aleatorias con fondos del mundo real para jugadores belgas, pudiéndose comprar todavía con monedas que se obtienen jugando. Sin embargo, desde 2K afirmaron que las cajas de botín no violaban las leyes de juego de Bélgica, y alentó a los jugadores a ponerse en contacto con sus representantes locales con respecto a esta decisión de la Comisión de Juegos de Bélgica.[58]​\nBlizzard Entertainment impidió que los jugadores belgas de Overwatch y Heroes of the Storm compraran cajas de botín con dinero real, pudiéndose obtener únicamente a través de recompensas en el juego.[59]​\nKonami desactivó la capacidad de aquellos en Bélgica de comprar moneda en el juego en Pro Evolution Soccer 2019, que luego podría usarse para comprar cajas de botín. Los jugadores aún pueden ganar esta moneda en el juego y así poder obtener las cajas de recompensas.[60]​\nSimultáneamente con sus acciones en los Países Bajos, el desarrollador de Rocket League, Psyonix, deshabilitó la capacidad de los jugadores de Bélgica para abrir cajas de botín.[54]​\nNintendo cerró dos de sus juegos móviles, Animal Crossing: Pocket Camp y Fire Emblem Heroes, para usuarios de Bélgica, ya que ambos ofrecen la posibilidad de usar dinero del mundo real para comprar un artículo aleatorio del juego.[61]​\nLos juegos FIFA de Electronic Arts dejaron de vender las monedas del juego a los jugadores belgas, de tal forma que los sobres solo se podrían obtener jugando. Sin embargo, esta decisión no era del gusto de EA, y continuó discutiendo con las autoridades belgas para poder revertir esta decisión.[62]​\n"}, {"name": "Autorregulación en la industria", "text": "En la industria, los principales sistemas de clasificación de videojuegos, concretamente PEGI en Europa, y ESRB en EE.UU y Canadá, no consideran las cajas de recompensas como juegos de azar. Sin embargo, han considerado reconocer la existencia de estos elementos en los videojuegos que clasifican e informar al consumidor de ello.\nPEGI\nDesde PEGI, consideran que \"las cajas de recompensas no se consideran como juego de azar: siempre obtienes algo cuando las compras, incluso si no obtienes lo que esperabas. No depende de PEGI decidir si algo se considera juego o no, esto está definido por las leyes nacionales de juego de cada país\".[63]​ \nNo obstante, han introducido en su sistema de clasificación una nota específica para clasificar juegos que incluyen compras de contenido aleatorio, diferenciando así juegos con compras \"in-game\", de aquellos juegos con compras que siguen la mecánica de las cajas de recompensas.[64]​  De esta forma, los juegos con cajas de recompensas, o mecánicas similares, incluirán dicha nota informativa, pero no incluirán la etiqueta \"gambling\"[65]​ (la cual automáticamente clasifica el videojuego como recomendado a partir de la mayoría de edad). \nESRB\nESRB, al igual que PEGI, ha introducido una nota informativa indicando que un juego incluye compras de contenido aleatorio.[66]​ Del mismo modo que PEGI, descartan clasificar videojuegos que siguen esta mecánica como juegos con apuestas por la misma razón que PEGI: siempre vas a obtener algo (no como en las apuestas reales).[67]​\n"}]}, {"name": "Referencias", "text": "↑ a b Lawrence, Nathan (23 de abril de 2017). «La inquietante psicología de los sistemas de pago por recompensas aleatorias». IGN (en inglés estadounidense). Consultado el 13 de agosto de 2017. «En muchos aspectos, esos son los mismos mecanismos psicológicos que están en marcha con las recompensas aleatorias en otros juegos como tus Diablos del mundo... ya sea que lo obtengas jugando el juego durante tantas horas o ganando tantas partidas, o que obtengas un resultado de ese generador de números aleatorios al gastar cinco dólares para comprar un paquete de cartas o un cofre de botín, sigue siendo la misma emoción, la misma experiencia, la misma anticipación esperanzada.» \n↑ Statt, Nick (28 de mayo de 2017). «El sistema de cajas de botín de Overwatch es la verdadera obra maestra de Blizzard». The Verge. Consultado el 13 de agosto de 2017. \n↑ Kim, Gyuman (30 de abril de 2016). «Game Law and Policy Institute, \"Probable items, where to regulate?\"». Inven Global (en coreano). Consultado el 15 de junio de 2018. \n↑ a b c d e f Newman, Jared (14 de noviembre de 2017). «Cómo las cajas de botín llevaron a juegos interminables (y jugadores siempre pagando)». Glixel. Archivado desde el original el 14 de noviembre de 2017. Consultado el 14 de noviembre de 2017. \n↑ Koo, Shang (3 de abril de 2007). «El Ángulo de China: ¿Piratería de Wii, World Of Warcraft derrotado?». Gamasutra. Consultado el 24 de noviembre de 2017. \n↑ a b c Burns, Ben (24 de noviembre de 2017). «El problema de las cajas de botín: ¿cómo llegamos a este lío?». VG247. Consultado el 24 de noviembre de 2017. \n↑ Korda, Martin (31 de marzo de 2009). «FIFA 09: Ultimate Team». Eurogamer. Consultado el 16 de diciembre de 2020. \n↑ Lewis, Helen (12 de febrero de 2015). «The Videogame That Yanis Varoufakis Used to Study the Eurozone». The Nation (en inglés estadounidense). Consultado el 28 de octubre de 2023. \n↑ Olivetti, Justin (17 de mayo de 2012). «The Perfect Ten: The truth about lockboxes». Engadget. Consultado el 9 de octubre de 2017. \n↑ Shull, Terilynn (24 de diciembre de 2011). «Captain's Log: Dilithium, attack ships, and lightsabers, oh my!». Engadget. Consultado el 13 de agosto de 2017. \n↑ Dobra, Andrei (6 de marzo de 2012). «Mass Effect 3's Co-Op Multiplayer Mode Lets You Pay Real Money for Equipment». Softpedia (en inglés estadounidense). Consultado el 13 de agosto de 2017. \n↑ «La actualización del acuerdo de armas». Blog de Counter-Strike (Valve). 13 de agosto de 2013. Consultado el 13 de agosto de 2017. \n↑ Yin-Poole, Wesley (28 de mayo de 2014). «Ahora puedes comprar Battlefield 4 Battlepacks». Eurogamer (en en-UK). Consultado el 13 de agosto de 2017. \n↑ Ringall, Jaz (13 de enero de 2015). «La codicia es buena: Cómo el sistema de botín de COD: Advanced Warfare mejora el juego». USGamer. Archivado desde el original el 5 de noviembre de 2018. Consultado el 5 de noviembre de 2018. \n↑ McCarthy, Katy (22 de noviembre de 2017). «\"It's Awkward Right Now:\" What Some in the Games Industry Think of the Rise of the Loot Box in 2017». US Gamer. Consultado el 22 de noviembre de 2017. \n↑ Schreier, Jason (10 de octubre de 2017). «La avalancha de cajas de botín en otoño lleva a una alarma generalizada». Kotaku. Consultado el 10 de octubre de 2017. \n↑ Hood, Vic (12 de octubre de 2017). «¿Son las cajas de botín una forma de juego?». Eurogamer. Consultado el 12 de octubre de 2017. \n↑ Ore, Jonathan (29 de octubre de 2017). «Polémica de las cajas de botín: ¿los videojuegos se están volviendo demasiado parecidos a los juegos de azar?». CBC. Consultado el 30 de octubre de 2017. \n↑ Frank, Allegra (9 de octubre de 2017). «OpenCritic se une a la reacción contra las cajas de botín». Polygon. Consultado el 9 de octubre de 2017. \n↑ Sapieha, Chad (14 de diciembre de 2017). «El año en los juegos: cinco noticias y tendencias que dominaron la industria en 2017». National Post. Consultado el 18 de diciembre de 2017. \n↑ Graft, Kris (18 de diciembre de 2017). «5 tendencias que definieron la industria de los juegos en 2017». Gamasutra. Consultado el 18 de diciembre de 2017. \n↑ Horti, Samuel (21 de diciembre de 2017). «Cómo la controversia de las cajas de botín moldeó los videojuegos en 2017». PC Gamer. Consultado el 27 de diciembre de 2017. \n↑ https://es.ign.com/videojuegos/124485/feature/la-compleja-psicologia-de-los-pagos-por-botin\n↑ https://www.gamespot.com/articles/free-overwatch-loot-boxes-available-now-for-amazon/1100-6452448/\n↑ https://www.medium.com/the-cube/limited-edition-loot-boxes-problematic-gambling-and-monetization-756819f2c54f\n↑ Palomino, Anthony (2/5/17). «En China ya es un requerimiento mostrar la probabilidad del Loot Box». Consultado el 10/12/21. \n↑ Marquez, Ruben (05/05/2017). «China impone mostrar porcentajes». Consultado el 10/12/2021. \n↑ Tarreo, Staff (05/05/2017). [www.tarreo.com/noticias/421153/Revelan-probabilidades-de-cajas-de-loot-en-juegos-de-Blizzard-en-China «Revelan probabilidades de cajas de loot en juegos de Blizzard en China»] |url= incorrecta (ayuda). Consultado el 10/12/2021. \n↑ «Una ley en China obligó a Blizzard a “regalar” sus loot boxes». 06/06/2017. Consultado el 10/12/2021. \n↑ McKenzie, Backer (02/08/2018). «Cajas de recompensas en Japón: análisis legal y explicación de Kompu Gacha». Consultado el 10/12/2021. \n↑ Del Pino, David (03/10/2020). «Cerca de 1 millón de dólares de multa por las LootBoxes en Corea del Sur». Consultado el 10/12/2021. \n↑ TANK KENG YAM, TONY (18 de noviembre de 2014). «LEY DE JUEGOS DE AZAR A DISTANCIA DE 2014». Archivado desde el original el 17 de mayo de 2019. Consultado el 10/12/2021. \n↑ Sivananthan, Anan (10 de agosto de 2021). «Las posibles regulaciones podrían afectar los juegos en línea o los videojuegos con cajas de botín y \"minijuegos\" en línea gratuitos con fines de promoción comercial». Consultado el 10/12/2021. \n↑ Meah, Natasha (12/07/2021). «Leyes para regular las máquinas de garras, los juegos de arcade y las cajas de botín discutidas mientras MHA busca actualizar las reglas de los juegos de azar». Consultado el 10/12/2021. \n↑ «La investigación pública respalda la evidencia de que las cajas de botín son \"psicológicamente similares al juego\"». 17 de septiembre de 2018. Consultado el 11/12/2021. \n↑ «Nueva Zelanda dice que las cajas de botín \"no cumplen con la definición legal de juegos de azar\"». 11/12/2017. Consultado el 11/12/2021. \n↑ «Hawái se opone a las cajas de botín en Estados Unidos». 22 de noviembre de 2017. \n↑ «Hawái busca controlar la venta de juegos con cajas de botín». 13 de febrero de 2018. \n↑ «Washington reabre la investigación para regular las cajas de botín». 25 de enero de 2018. \n↑ «Senador del Partido Republicano presenta ley para prohibir cajas de botín y micro-pagos». 8 de mayo de 2019. \n↑ «Estados Unidos busca prohibir las cajas de botín en videojuegos dirigidos a menores». 24 de mayo de 2019. \n↑ «Electronic Arts (EA Sports) contundente sobre las cajas de botin: NO son apuestas». 11 de mayo de 2018. \n↑ «La Comisión Federal de Comercio investiga las cajas de botín». 28 de noviembre de 2018. \n↑ «La FTC llevará a cabo un taller de cajas de botín público el 7 de agosto». 7 de agosto de 2019. \n↑ «Loot boxes in online games and their effect on consumers, in particular young consumers». Julio de 2020. \n↑ Alberto Carlos Garzón Espinosa(ministro) (2020). Comisión de Sanidad y Consumo Sesión n° 3.  Escena en 2:55:00. \n↑ Aguiar, Alberto R. (1 de octubre de 2021 editorial= Business Insider). «Consumo ultima una reforma en la ley del juego para incluir la regulación de las cajas de botín en videojuegos». Consultado el 7 de diciembre de 2021. \n↑ Aguiar, Alberto R. (4 de noviembre de 2021 editorial= Business Insider). «El Ministerio de Consumo regulará todos los tipos de cajas de botín en videojuegos, pero no podrá hacerlo solo con la reforma de la ley del juego». Consultado el 7 de diciembre de 2021. \n↑ «Study into loot boxes A treasure or a burden?». Dutch Gaming Authority. 10 de abril de 2018. Archivado desde el original el 20 de abril de 2018. \n↑ «Los juegos populares violan las reglas del juego». NOS (Paises Bajos). 19 de abril de 2018. \n↑ «Dutch loot box threat forces Valve to pull CS:GO and Dota 2 item trading in the Netherlands». Eurogamer. 20 de junio de 2018. \n↑ «CSGO Release Notes for 7/11/2018». CSGO blog. 7/11/2018. \n↑ «Dutch judge rules that EA should be fined €500k every week until it removes FIFA loot boxes». videogameschronicle. \n↑ a b c «PATCH NOTES V1.61 [ESPORTS SHOP UPDATE]». Rocket League Patch Notes. \n↑ «Botines en tres videojuegos en violación de las leyes de juego». Koen Geens notas de prensa. 25 de abril de 2018. \n↑ «Revamped Progression is Coming Soon: A major Star Wars Battlefront II update is cleared for take off». Star Wars™ Battlefront™ II news. \n↑ «La Comisión Belga de Juegos recomienda el enjuiciamiento penal sobre las cajas de botín ilegales». GamesIndustry.biz. 10 de mayo de 2018. \n↑ «2K STATEMENT BELGIUM». 2K STATEMENT. \n↑ «Paid Loot Boxes and Loot Chests Disabled for Players in Belgium». Blizzard Forums. 27 de agosto de 2018. \n↑ «Important Notice for Players in Belgium». Konami noticias. 12 de febrero de 2019. \n↑ «Información importante para usuarios en Bélgica». Nintendo Bélgica. \n↑ «FIFA Points in Belgium». EA news. \n↑ «Are loot boxes gambling? PEGI opinion». Eurogamer. 23 de octubre de 2017. \n↑ «PEGI Introduces Notice To Inform About Presence of Paid Random Items». 13 de abril de 2020. \n↑ «PEGI gambling label». \n↑ «Introducing a New Interactive Element: In-Game Purchases (Includes Random Items)». \n↑ «Are loot boxes gambling? ESRB opinion». Eurogamer. 23 de octubre de 2017. ", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Cartucho_(inform%C3%A1tica)", "title": "Cartucho (informática)", "summary": "Un cartucho ROM, a veces denominado simplemente como cartucho, es una carcasa extraíble que contiene dispositivos de memoria de sólo lectura destinados a ser conectados a un dispositivo de electrónica de consumo, tales como un ordenador personal o una consola de videojuegos. Los cartuchos ROM se pueden utilizar para cargar software, tales como videojuegos, u otros programas de aplicación.\nLa ranura del cartucho podría ser utilizada para adiciones de hardware, por ejemplo síntesis de habla. Algunos cartuchos tenían memoria estática de acceso aleatorio respaldada por batería permitiendo al usuario guardar información, tales como puntuaciones de juegos cada vez que se usaban.\nLos cartuchos ROM permitían al usuario cargar y acceder rápidamente a los programas y datos sin la necesidad de una unidad de disco, que era un periférico caro durante la era del ordenador personal, y sin el uso de casetes, que eran secuencial, lentos, y a menudo poco fiables. Una ventaja para el fabricante fue la relativa seguridad de la distribución de software en forma de cartucho, el cual era difícil para replicar para los usuarios finales. Sin embargo, los cartuchos eran caros de fabricar en comparación con los disquetes o CD-ROM. Desde que las unidades de disco se hicieron más comunes y el software se ha expandido más allá de los límites prácticos de su tamaño, las ranuras para cartuchos desaparecieron de consolas posteriores y computadoras. Los cartuchos todavía se utilizan hoy en día con la consola de juegos híbrida Nintendo Switch\n", "sections": [{"name": "Uso", "text": "Un cartucho es un recipiente que normalmente aloja un tipo de memoria externa rígida, que se conecta a un dispositivo electrónico como: un teléfono móvil, una PDA, un ordenador, una videoconsola, una cámara digital, etc.  A diferencia del formato disco óptico, el formato cartucho no tiene partes móviles.\nEn un principio cada fabricante creaba un cartucho para su producto, hasta el nacimiento de los estándares como EEPROM, memoria flash o memory card. Existen varios estándares de encapsulados que contienen tarjetas de memoria, promocionados y fabricados por la mayoría de las multinacionales dedicadas a la producción de hardware.\nAlgunos dispositivos digitales leen más de un tipo de cartucho de tarjeta de memoria para asegurar la compatibilidad. Los cartuchos son resistentes a los rasguños externos, al polvo, y algunos al agua, que han afectado a las formas previas de almacenamiento portátil como: los disquetes, discos compactos y los DVD.\n", "subsections": []}, {"name": "Videojuegos", "text": "La utilización de cartuchos, frente a otras opciones como discos ópticos responde a una larga lista de factores.\nEl precio de fabricación, que una vez se llega a cierto nivel de unidades es muy bajo, en algunos casos, como las videoconsolas, el control sobre los distribuidores y los fabricantes del producto, que están obligados a utilizar la patente. El formato de cartucho en videoconsolas también permitía la inclusión de chips y piezas especiales dentro del propio cartucho que ampliaba las capacidades de la consola de serie para cada título que lo incluyera, caso del chip Super FX incluido en determinados cartuchos de Super Nintendo o el chip SCC de Konami en algunos de sus cartuchos para la plataforma MSX, por ejemplo. En general, los cartuchos suponen cierta garantía para controlar el software que aparece para una plataforma, al menos frente a los medios habituales como los discos CD o DVD. Además un cartucho no tiene piezas móviles, con lo que es menos probable que un programa sufra daños si recibe algún golpe mientras está en plena lectura. O se bloquee por un bache mientras se viaja en coche o simplemente al levantar los brazos para descansar unos segundos. Son muy apropiados para que los usen los niños.\nEste sistema se popularizó con los primeros computadores domésticos, como el Commodore 64, o el Atari 800XL, donde se incluía un puerto especial para la conexión de cartuchos con programas en una memoria ROM.[1]​ La ventaja de los cartuchos sobre otros medios es la disponibilidad instantánea, sin tiempo de carga, y su mayor resistencia a los daños.\nDesde los primeros años 1980 hasta la primera mitad de los años 1990, todas las consolas de videojuegos funcionaban con cartuchos (a excepción de las consolas de videojuegos portátiles). Cuando la tecnología en CD comenzó a ser usada como almacenamiento de datos, la mayoría de las compañías dejaron de usar los cartuchos y pasaron a los CD, ya que estos últimos eran mucho más baratos y tenían una capacidad mayor. Nintendo resistió en solitario, y no creó un sistema basado en discos ópticos hasta varios años después; en su lugar optó por fabricar su consola de \"próxima generación\" basada en cartuchos, la Nintendo 64. Esta actuación fue cuestionada por muchos empleados, que sostenían que los juegos en cartucho no podrían llegar a ser tan grandes o complejos como los juegos en CD de las consolas de la competencia como la Sony PlayStation. Las consecuencias económicas que sufrió la compañía producto de su osadía marcaron el fin de las consolas de cartuchos; de hecho, el siguiente lanzamiento de Nintendo, la GameCube, presentó un formato basado en DVD. Sin embargo, las consolas de bolsillo de Nintendo, la cual goza prácticamente de un monopolio, continuaron utilizando cartuchos. La Nintendo DS usa un formato específico de memory card, la SD card. Mientras tanto, Sony ha optado por combinar en su videoconsola portátil, la PlayStation Portable, las dos plataformas: usando formato óptico para los videojuegos, llamado UMD y desarrollado por Sony, y a su vez permitiendo descarga de juegos y actualizaciones para los mismos, así como todo tipo de contenido multimedia en un soporte de cartucho llamado Memory Stick.\n", "subsections": []}, {"name": "Música", "text": "El sistema de sonido de 8 pistas (8-track) está considerado como una variedad de cartucho. Aquí, el cartucho contiene una cinta de sonido; de este modo se proporcionan diferentes contenidos usando el mismo reproductor. El cartucho permite manejar más fácilmente la cinta, al tiempo que es un sistema más resistente que tener una cinta suelta. En 1998 se dejaron de fabricar.[cita requerida]\n", "subsections": []}, {"name": "Véase también", "text": "Cartuchos de videojuegos de Nintendo\nNintendo Optical Disc\nCasete\n", "subsections": []}, {"name": "Referencias", "text": "↑ Pollson, Ken (30 de octubre de 2008). «Chronology of the Commodore 64 Computer». Archivado desde el original el 19 de abril de 2009. Consultado el 26 de febrero de 2009. ", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Casco_de_realidad_virtual", "title": "Casco de realidad virtual", "summary": "Un casco de realidad virtual, también llamado gafas de realidad virtual, visor de realidad virtual o HMD (del inglés head-mounted display), es un dispositivo de visualización similar a un casco, que permite reproducir imágenes creadas por ordenador sobre una pantalla muy cercana a los ojos o proyectando la imagen directamente sobre la retina de los ojos. En este segundo caso el casco de realidad virtual recibe el nombre de monitor virtual de retina.\nDebido a su proximidad con los ojos, el casco de realidad virtual consigue que las imágenes visualizadas resulten mucho mayores que las percibidas por pantallas normales, y permiten incluso englobar todo el campo de visión del usuario.\nGracias a que el casco se encuentra sujeto a la cabeza, este puede seguir los movimientos del usuario.\n", "sections": [{"name": "Historia", "text": "El Sega VR, anunciado en 1991 y visto a principios de 1993 en el Winter CES, nunca fue lanzado. Uno de los primeros cascos VR, el Forte VFX1, se anunció en CES en 1994. El VFX-1 tiene pantallas estereoscópicas, seguimiento de cabeza de 3 ejes y auriculares estéreo.[1]​ Sony, otro pionero, lanzó el Glasstron en 1997, que tiene un sensor de posición opcional, que permite al usuario ver los alrededores, con la perspectiva en movimiento a medida que su cabeza se mueve, dando una profunda sensación de inmersión. Estos cascos VR dieron a los jugadores de MechWarrior 2 una nueva perspectiva visual de ver el campo de batalla desde el interior de la cabina de su nave. Sin embargo, estos primeros cascos fallaron comercialmente debido a su tecnología limitada[2]​[3]​ y fueron descritos por John Carmack como \"mirando a través de los tubos de papel higiénico\".[4]​\nEn 2012, comenzó una campaña de micromecenazgo para unos cascos VR conocidos como Oculus Rift; El proyecto fue liderado por varios desarrolladores prominentes de videojuegos, incluido Carmack,[2]​ que luego se convirtió en el CTO[5]​ de la compañía. En marzo de 2014, la empresa matriz del proyecto Oculus VR fue adquirida por Facebook por $ 2 mil millones.[6]​ El lanzamiento final orientado al consumidor de Oculus Rift comenzó a enviarse el 28 de marzo de 2016.[7]​\nEn marzo de 2014, Sony presentó un prototipo de casco para PlayStation 4,[8]​ que más tarde se denominó PlayStation VR.[9]​ En 2014, Valve presentó algunos prototipos de cascos,[10]​ que condujeron a una asociación con HTC para producir el Vive, que se centra en entornos de realidad virtual \"escala de habitación\" con los que los usuarios pueden navegar e interactuar de forma natural.[11]​ HTC Vive fue lanzado en abril de 2016[12]​ y PlayStation VR en octubre de 2016.[13]​\nLos cascos y visores de realidad virtual también se han diseñado para teléfonos inteligentes. A diferencia de los cascos con pantallas integradas, estas unidades son esencialmente cajas en las que se puede insertar un teléfono inteligente. El contenido de realidad virtual se ve desde la pantalla del dispositivo a través de lentes que actúan como un estereoscopio, en lugar de usar pantallas internas dedicadas. Google lanzó una serie de especificaciones y kits de bricolaje asociados para visores de realidad virtual conocidos como Google Cardboard; estos visores pueden construirse utilizando materiales de bajo costo, como el cartón (de ahí el nombre). Samsung Electronics se asoció con Oculus VR para desarrollar conjuntamente el Samsung Gear VR (que solo es compatible con dispositivos Samsung Galaxy recientes), mientras que LG Electronics desarrolló un casco con pantallas dedicadas para su teléfono inteligente LG G5 conocido como LG 360 VR.[14]​[15]​[16]​[17]​ Los fabricantes de hardware asiáticos como Xion y Kolke han desarrollado cascos de realidad virtual de bajo costo. En 2017, la compañía china Tencent anunció que se estaba preparando para lanzar su casco de realidad virtual ese año.[18]​\n", "subsections": []}, {"name": "Tipos", "text": "Según reproduzcan las imágenes sobre un ojo o sobre los dos, los HMD pueden ser:\nMonocular: las imágenes solo se reproducen sobre un ojo. Técnicamente es un HMD pero no es para realidad virtual. Es el caso de las Google Glass.\nBinocular: las imágenes se reproducen sobre los dos ojos, obteniendo así una imagen estereoscópica.\nPor otro lado, cabe distinguir también:\nCascos o gafas de realidad virtual: ocupan el campo de visión del usuario de modo que no tiene percepción del entorno que lo rodea, permitiendo así la completa inmersión de este en una realidad virtual, ya que solo percibirá las imágenes creadas por ordenador y reproducidas sobre la pantalla. Las gafas de realidad virtual constan de una pantalla que abarca todo el espectro visual generando dos imágenes distintas para cada ojo lo que reporta un Digital 3D o un efecto 3D, es decir, el espectador observa elementos tridimensionales. Los modelos más recientes usan cámaras incorporadas para permitir al usuario posicionarse en el entorno virtual de la simulación.[19]​\nCascos o gafas de realidad aumentada o realidad mixta: conocidos también como HMD óptico (u OHMD) permiten al usuario ver todo el entorno que lo rodea e introducen en este objetos virtuales o información, produciendo así lo que se conoce como realidad aumentada o realidad mixta. Dentro de esta categoría se incluyen las gafas inteligentes, cuyo principal uso es mostrar información disponible para los usuarios de teléfonos inteligentes sin utilizar las manos.La realidad mixta produce una fusión del mundo real con el mundo virtual, donde los objetos se relacionan entre sí ya sean reales o virtuales. El consumidor puede, por ejemplo, coger una herramienta ficticia y tirarla hacia un lugar u objeto real, como una pared, y este objeto ficticio actuará como si fuese real. La realidad mixta aborda dos dimensiones bien diferencias, por un lado la calidad de imagen y por otro el efecto de sumersión  que consigue el usuario.[20]​\nPor último, según su operatividad, se pueden distinguir:\nGafas de realidad virtual móvil: realmente son carcasas, que no tienen pantalla propia ni procesador sino que están preparadas para albergar un teléfono móvil, en el cual se reproducirán las imágenes. Ejemplos: Gear VR de Samsung, Cardboard de Google, y muchas otras de distintos fabricantes.\nGafas de realidad virtual sin procesador: incluyen pantalla propia y sensores pero se conectan a un aparato externo (típicamente un ordenador personal) para recibir las imágenes. Ejemplos: Oculus Rift, PlayStation VR, HTC Vive...\nGafas de realidad virtual autónomas: son las que incluyen todos los componentes necesarios, como la carcasa, pantalla, sensores y procesador. Ejemplo: Microsoft Hololens, Oculus Quest, Oculus Quest 2 , HTC Cosmos y otras en desarrollo como las Project Alloy de Intel, las Daydream Standalone de Qualcomm y Google, o las Exynos VR de Samsung.\n", "subsections": []}, {"name": "Modelos", "text": "Véase también:\nCascos o gafas\nGafas con pantalla incorporada (Rift, Playstation RV, HoloLens, VIve, StarVR, FOVE VR, Meta Quest)\nCarcasas o gafas de RV móvil (Gear VR, Daydream View, Cardboard, Caracasas de plástico y otros materiales)\nModelos antiguos (Virtual Boy, Forte VFX1, eMagin Z800 3DVisor)\nSensores de posición\nControladores (Leap Motion, STEM System, PrioVR, Gloveone, PowerClaw)\nOtros periféricos (Virtuix Omni, Cyberith Virtualizar)\nOtros sistemas (Sistema CAVE)\n", "subsections": []}, {"name": "Características", "text": "Existen varios conceptos clave en la tecnología que emplean los cascos de realidad virtual. Entre ellos podemos destacar:\nResolución de pantalla: es un parámetro muy importante pues de ella depende mayormente la definición de la imagen percibida por el usuario del HMD. Una resolución típica a día de hoy (principios de 2016) son los 1080x1200 píxeles para cada ojo del Oculus Rift y del HTC Vive.\nCampo de visión: es la amplitud del campo visual del usuario que es ocupada por la imagen virtual. Cuanto mayor sea, mejor será la sensación de inmersión. El Oculus Rift DK2 por ejemplo ofrece un campo de visión de 100º.\nLatencia de seguimiento: es el tiempo que transcurre entre momento en que el usuario mueve su cabeza y aquel en el que la imagen mostrada se reajusta a ese movimiento. Los fabricantes intentan reducirla al mínimo pues una excesiva latencia puede producir mareos en los usuarios, además de un menor realismo. PlaySation VR registra a una latencia de 18 ms.\nRefresco de pantalla: el número de imágenes mostradas por segundo. A partir de 60 Hz se considera un buen ratio. Así por ejemplo, el visor HTC Vive Pre y el Oculus Rift CV1 funcionan a 90 Hz, mientras el PlayStation VR alcanza los 120 Hz.\nSeguimiento de orientación: mediante sensores internos (giroscopio, acelerómetro, magnetómetro) el HMD detecta hacia dónde está orientada la cabeza del usuario.\nSeguimiento de posición: también conocido como posicionamiento absoluto, se logra mediante un sensor, normalmente externo a las propias gafas, que detecta dónde está situada exactamente la cabeza del usuario y cualquier cambio que se produzca en esa posición. Es una característica que solo incorporan los HMD más avanzados.\nSeguimiento ocular: mediante unos sensores infrarrojos dentro del casco se captan los movimientos del ojo. Esto permite cosas como replicar los movimientos de tus ojos en tu avatar virtual, o provocar reacciones de otros personajes según la manera en la que los miras. Pionero de esta funcionalidad es el modelo FOVE VR.\nVisión estereoscópica: característica presente en casi todos los aparatos de realidad virtual, que mostrando una imagen ligeramente diferente a cada ojo permite visualizar el entorno en tres dimensiones.\nEfecto rejilla: es un efecto visual que sucede en pantallas cuando las líneas que separan los píxeles de la misma se vuelven visibles en la imagen proyectada. El resultado es similar al de mirar a través de una tela anti mosquitos. Es un efecto frecuente en visores de realidad virtual no suficientemente avanzados.\n", "subsections": []}, {"name": "Usos en varios campos", "text": "", "subsections": [{"name": "Entrenamiento médico", "text": "Los auriculares de realidad virtual se están utilizando actualmente como un medio para capacitar a los estudiantes de medicina para la cirugía. Les permite realizar procedimientos esenciales en un entorno virtual y controlado.[21]​ Los estudiantes realizan cirugías en pacientes virtuales, lo que les permite adquirir las habilidades necesarias para realizar cirugías en pacientes reales. También les permite a los estudiantes revisar las cirugías desde la perspectiva del cirujano principal.\nTradicionalmente, los estudiantes tenían que participar en cirugías y a menudo se perdían partes esenciales. Ahora, con el uso de auriculares VR, los estudiantes pueden ver los procedimientos quirúrgicos desde la perspectiva del cirujano principal sin perder partes esenciales. Los estudiantes también pueden pausar, rebobinar y adelantar rápidamente las cirugías. También pueden perfeccionar sus técnicas en una simulación en tiempo real en un entorno libre de riesgos.\n"}, {"name": "Entrenamiento militar", "text": "Los cascos de realidad virtual han sido utilizados por las Fuerzas Armadas de los Estados Unidos. Es una herramienta particularmente útil para entrenar al personal militar sin ponerlo en peligro.[22]​\nEl casco de realidad virtual permite al personal militar interactuar con personas de realidad virtual para que se sienta real. Pueden hablar entre ellos y realizar diversas acciones para que el mundo de la realidad virtual parezca que realmente están en esa situación. También hay desventajas y ventajas cuando el personal militar usa los auriculares. La desventaja es que los auriculares están hechos para un área interior, con un ambiente fresco y lejos del calor, por lo que cuando el personal militar solo tiene los auriculares puestos, no equipos militares, no es como su entrenamiento básico. Las ventajas consisten en repetir las situaciones varias veces y el costo de tener el auricular es menor, ya que no se necesita equipo militar.[23]​\n"}, {"name": "Educación", "text": "La utilización de gafas de realidad virtual en educación potencia la motivación y la implicación de los estudiantes en su autoaprendizaje. La visualización tridimensional de distintos contenidos curriculares facilita la comprensión, proporcionando la inmersión y la interacción del alumnado con los contenidos trabajados,[24]​ permitiendo la contextualización del aprendizaje en el entorno próximo de los estudiantes, mediante la producción y utilización de sus propios contenidos audiovisuales.[25]​  \nEn la educación primaria permite al estudiante asumir el papel protagonista en su aprendizaje mediante la experimentación directa, la contextualización y la interacción con los contenidos programados.[26]​[27]​[28]​\nAlgunos ejemplos de su uso en la educación secundaria son:[29]​[30]​\nEstudio de anatomía y fisiología animal.\nEstudio de biodiversidad.\nEstudio del universo.\nVisualización de monumentos, edificaciones y construcciones históricas.\nAnálisis de la geomorfología, de riesgos naturales geológico-geotécnicos, de fenómenos geológicos o atmosféricos naturales o de los efectos provocados por ellos.\nSu utilización en estudios de formación profesional es muy variado, intuitivo y práctico. Algunos campos de aplicación son:[31]​ \nSeguridad y salud laboral.\nElectricidad, madera, automoción, sanitario.\nCon la utilización de gafas virtuales de bajo coste como la Google Cardboard, la implementación de la realidad virtual en el aula es factible en la actualidad.[32]​\n"}, {"name": "Museos", "text": "Las gafas de realidad virtual han sido utilizadas en centros de educación no formal, como los museos, para mejorar la experiencia obtenida por los visitantes en exposiciones interactivas. \nExisten diversas maneras  de trabajar la incorporación de la realidad virtual en los centros de educación informal:  La utilización de sistemas de   visualización interactivos en los cuales se realiza una explicación de contenidos (paseos virtuales, “viajes en el tiempo”, etc.), y la utilización de apps novedosas que tienen como objetivo principal ensalzar en valor del patrimonio. \nOtra de las opciones es la realidad aumentada para que el visitante interactúe con el objeto virtual como si de uno real se tratase, mediante la activación de unos marcadores que posibilitan la inserción de objetos virtuales en las distintas salas del museo.[33]​\nLas posibilidades ofrecidas por este tipo de actuaciones se ven reflejadas en diferentes características que hasta la llegada de la realidad virtual sería poco probable de alcanzar, siguiendo los ritmos de trabajo tradicionales utilizados en el ámbito educativo. Gracias a los avances tecnológicos, como es la realidad virtual, hace posible viajar sin importar el espacio y/o en el tiempo. También permite que el visitante sea partícipe de la acción y de la exhibición, lo que posibilita que la experiencia se realice de manera dinámica con todas las ventajas que esto contiene a nivel pedagógico.[34]​\nUno de los museos que utiliza esta herramienta es el Museo Arqueológico Nacional (España) quien en 2017 incorporó la realidad virtual a su exposición permanente, facilitando así la visita virtual a sus 4 plantas. Un total de 3 km de exposición visible desde computadora personal, tableta o teléfono inteligente.[35]​\nOtro museo que también emplea la realidad virtual es el Museo Thyssen-Bornemisza quien ofrece una visita virtual inmersiva de sus salas.[36]​\nAdemás de los dos ejemplos citados anteriormente cabe mencionar los Museos Vaticanos quienes lograron una imagen panorámica de la Capilla Sixtina, creando una proyección tridimensional que permite observar todos sus frescos.[37]​[38]​ Además se deben añadir los museos que existen únicamente en internet un ejemplo de estos es el MUVA (Museo virtual de Artes).[39]​[40]​\n"}, {"name": "Psicoterapia", "text": "Los aparatos de realidad virtual facilitan la puesta en práctica de protocolos de evaluación e intervención psicológica, permitiendo en tiempo real llevar a cabo situaciones específicas con pacientes.\nLas investigaciones que dedica la rama de psicología cuentan con bases empíricas que incluyen protocolos de realidad virtual que han demostrado su eficacia y eficiencia terapéutica como son los estudios de la Doctora Cristina Botella, investigadora en el ámbito de la psicología clínica y las nuevas tecnologías.[41]​\nVentajas de la terapia mediante el uso de realidad virtual:[42]​\nSe obtiene más privacidad que un tratamiento en vivo.\nSe reduce el coste del tratamiento.\nNo es necesario que el paciente se esfuerce por imaginar una situación concreta.\nPermite al terapeuta controlar el contexto de exposición y por lo tanto seleccionar los estímulos que mejor se ajusten a las necesidades del paciente.\nPosibilita la creación de escenarios o situaciones distintas a la realidad.\nNo es necesario esperar a que se dé un suceso en la vida real ya que lo podemos simular en el momento que se desee.\nEl terapeuta puede controlar lo que está visualizando el paciente. Le permite detectar en el paciente los estímulos más relevantes.\nPosibilita la personalización de la jerarquización de la exposición.\nEs un medio seguro, ya que tanto paciente como terapeuta controlan lo que está sucediendo.\nEl paciente adopta una participación activa, lo que fomentará el re-aprendizaje y una modificación en la conducta.\nTipos de terapias:\nRealidad virtual aplicada al tratamiento de las fobias.[43]​\nTerapia de realidad virtual aplicada en el tratamiento de trastornos mentales.[44]​\nRealidad virtual en el tratamiento de personas con trastorno del espectro autista (TEA).[45]​\nRealidad virtual para el diagnóstico y tratamiento de trastornos de la conducta alimentaria.[46]​\nRealidad virtual aplicada en el trastorno por déficit de atención con hiperactividad.[47]​\n"}]}, {"name": "Véase también", "text": "Lente de contacto biónica\nVisualización head-up\n", "subsections": []}, {"name": "Referencias", "text": "↑ «VFX-1 VIRTUAL REALITY HELMET by Forte». www.ibiblio.org. Consultado el 3 de enero de 2020. \n↑ a b «Virtual reality kit secures funds» (en inglés británico). 1 de agosto de 2012. Consultado el 3 de enero de 2020. \n↑ «A Brief History Of Oculus». TechCrunch (en inglés estadounidense). Consultado el 3 de enero de 2020. \n↑ The Future of Gaming in Virtual Reality - IGN (en inglés), consultado el 3 de enero de 2020 .\n↑ «Doom’s John Carmack Leaves id Software To Focus On The Oculus Virtual Reality Headset». TechCrunch (en inglés estadounidense). Consultado el 3 de enero de 2020. \n↑ Welch, Chris (25 de marzo de 2014). «Facebook buying Oculus VR for $2 billion». The Verge (en inglés). Consultado el 3 de enero de 2020. \n↑ D'Orazio, Dante (2 de abril de 2016). «Oculus apologizes for shipping delays, will waive shipping fees for all orders to date». The Verge (en inglés). Consultado el 3 de enero de 2020. \n↑ McWhertor, Michael (18 de marzo de 2014). «Sony announces Project Morpheus, a virtual reality headset coming to PlayStation 4». Polygon (en inglés). Consultado el 3 de enero de 2020. \n↑ «Sony's Project Morpheus is now 'PlayStation VR'». Engadget (en inglés). Consultado el 3 de enero de 2020. \n↑ Warren, Tom (3 de junio de 2014). «Valve's VR headset revealed with Oculus-like features». The Verge (en inglés). Consultado el 3 de enero de 2020. \n↑ D'Orazio, Dante (1 de marzo de 2015). «Valve's VR headset is called the Vive and it's made by HTC». The Verge (en inglés). Consultado el 3 de enero de 2020. \n↑ Robertson, Adi (8 de diciembre de 2015). «HTC Vive VR headset delayed until April». The Verge (en inglés). Consultado el 3 de enero de 2020. \n↑ «Sony Corporation of America: PlayStation®VR Launches October 2016 Available Globally At 44,980 Yen, $399 USD, €399 And £349». web.archive.org. 22 de mayo de 2016. Archivado desde el original el 22 de mayo de 2016. Consultado el 3 de enero de 2020. \n↑ Savov, Vlad (21 de febrero de 2016). «LG's G5 is a radical reinvention of the flagship Android smartphone». The Verge (en inglés). Consultado el 3 de enero de 2020. \n↑ «IFA 2014: Samsung Galaxy Note 4, Note Edge, Gear VR and Gear S hands-on». GSMArena.com (en inglés estadounidense). Consultado el 3 de enero de 2020. \n↑ Bonnington, Christina (13 de marzo de 2015). «You Can Now Watch and Upload 360-Degree Videos on YouTube». Wired. ISSN 1059-1028. Consultado el 3 de enero de 2020. \n↑ Pocket-lint (17 de noviembre de 2019). «The best VR headsets to buy 2020». Pocket-lint (en inglés). Consultado el 3 de enero de 2020. \n↑ «Subscribe to read | Financial Times». www.ft.com. Consultado el 3 de enero de 2020. \n↑ Prendes Espinosa, Carlos (2015). «Realidad aumentada y educación: análisis de experiencias prácticas». Revista de Medios y educación 1. Consultado el 23 de marzo de 2021. \n↑ Milgram, Paul, Kishino; Fumio (12 de diciembre de 1994). A Taxonomy of mixed reality 77. Consultado el 23 de marzo de 2021. \n↑ Moreno, Noelia; Leiva, Juan; Matas, Antonio (2016). «Herramientas de Realidad Aumentada para la Enseñanza Superior en el Área de Medicina». Consultado el 24 de marzo de 2021. \n↑ «How VR is training the perfect soldier». Wareable (en inglés). 31 de diciembre de 2015. Consultado el 3 de enero de 2020. \n↑ Avatars, Virtual Reality Technology, and the U.S. Military: Emerging Policy Issues. \n↑ Escamilla, José; Venegas, Esteban; Fernández, Katiuska; Fuerte, Karina; Román, Rubí; Abrego, Gabriela; Murillo, Alejandro; Guijosa, Christian (diciembre de 2017). «Edu Trends (2017) Realidad aumentada y virtual». https://observatorio.tec.mx/. Archivado desde el original el 17 de noviembre de 2020. Consultado el 19 de marzo de 2021. \n↑ Barahona, Carlos (2019). «Realidad virtual en el aula». Consultado el 19 de marzo de 2021. \n↑ Hinojo-Lucena, Francisco Javier; Aznar-Díaz, Inmaculada; Cáceres-Reche, María Pilar; Romero-Rodríguez, José María (25 de junio de 2019). «Opinión de futuros equipos docentes de educación primaria sobre la implementación del mobile learning en el aula». Consultado el 29 de marzo de 2021. \n↑ Carrillo Villalobos, José Lino; Cortés Montalvo, Jorge A. (2016). «Secuencias didácticas con realidad virtual: En el área de geometría en educación básica». F@ro: Revista teórica del Departamento de Ciencias de la Comunicación. Consultado el 29 de marzo de 2021. \n↑ Samaniego, Jonathan Carlos (2016). «Realidad virtual en la Educación el próximo desafío». https://revistas.utb.edu.ec/index.php/sr/article/view/93. Consultado el 29 de marzo de 2021. \n↑ Miguélez-Juan, Blanca; Núñez Gómez, Patricia; Mañas-Viniegra, Luis (2019). «La Realidad Virtual Inmersiva como herramienta educativa para la transformación social: Un estudio exploratorio sobre la percepción de los estudiantes en Educación Secundaria Postobligatoria». Consultado el 30 de marzo de 2021. \n↑ López García, Marta; Morcillo Ortega, Juan Gabriel (2007). «Las TIC en la enseñanza de la Biología en la educación secundaria: los laboratorios virtuales». Consultado el 30 de marzo de 2021. \n↑ Aznar-Díaz, Inmaculada; Romero-Rodríguez, José María; Rodríguez García, Antonio (2018). «La tecnología móvil de Realidad Virtual en educación: una revisión del estado de la literatura científica en España». Consultado el 24 de marzo de 2021. \n↑ Reinoso, Raúl (2016). «Comunicación y Pedagogía.». Educación y Tecnología. Tecnotic. Consultado el 24 de marzo de 2021. \n↑ Ruiz, David (2012). La realidad aumentada: un nuevo recurso dentro de las tecnologías de la información y la comunicación (TIC) para los museos del siglo XXI. 3 (5). pp. 39-44. Consultado el 17 de marzo de 2021. \n↑ Franco, Antonio Otero; Flores González, Julián (2011). Realidad virtual: Un medio de comunicación de contenidos. Aplicación como herramienta educativa y factores de diseño e implantación en museos y espacios públicos. 9 (2). pp. 185-211. Consultado el 19 de marzo de 2021. \n↑ «Museo Arqueológico Nacional». Consultado el 19 de marzo de 2021. \n↑ «Museo Thyssen Bornemisza». Consultado el 18 de marzo de 2021. \n↑ «Museos Vaticanos. Capilla Sixtina». Consultado el 18 de marzo de 2021. \n↑ Gomis, Juan; Monzó, Juan Antonio; Santolaria, Anna (2016). \"Recursos web y enseñanza de la historia moderna: la capilla sixtina virtual.\" La edad moderna en Educación Secundaria. Consultado el 30 de marzo de 2021. \n↑ «Museo Virtual de Artes» (en español e Inglés). Consultado el 23 de marzo de 2021. \n↑ Melgar, María Fernanda; Chiecher, Analía Claudia (2016). De paseo por un museo virtual. Aprendizajes y valoraciones de estudiantes universitarios.. Consultado el 24 de marzo de 2021. \n↑ Botella, Cristina; García-Palacios, Azucena; Baños, Rosa María; Quero, Soledad (2007). «Realidad aumentada y virtual». Consultado el 21 de marzo de 2021. \n↑ Sánchez-Cabrero, Roberto; Peris, Montserrat; León, Ana (2019). «Posibilidades psicoterapéuticas de la realidad virtual desde el punto de vista de sus primeros usuarios en España». Consultado el 30 de marzo de 2021. \n↑ Cárdenas, Georgina; Botella, Cristina; Quero, Soledad; Baños, Rosa; Durán, Ximena; De la rosa, Anabel; Flores, Lorena; Molés, Mar (2016). «Efectividad del programa de tratamiento virtual flight con población mexicana». Consultado el 30 de marzo de 2021. \n↑ Cangas, Adolfo.J; Galván, Blanca (2020). «Estudio preliminar de la utilidad de un programa de realidad virtual contra el estigma en salud mental». Consultado el 31 de marzo de 2021. \n↑ Fernández, Jorge (2018). «Intervención con realidad virtual inmersiva y arteterapia en personas con trastorno del espectro autista (TEA) para el desarrollo de habilidades comunicativas y resolución de problemas». Consultado el 31 de marzo de 2021. \n↑ Martín, Ana; Castellano, Carmina (2020). «Realidad virtual para el diagnóstico y tratamiento de Trastornos de Conducta Alimentaria». Consultado el 31 de marzo de 2021. \n↑ Moreno, Inmaculada (2012). «Aplicaciones de la Realidad Virtual en el Trastorno por Déficit de Atención con Hiperactividad». Consultado el 31 de marzo de 2021. \n", "subsections": []}, {"name": "Enlaces externos", "text": "El primer casco de realidad virtual \"realmente inmersivo\" despierta cierta atención por parte de la industria Archivado el 28 de julio de 2014 en Wayback Machine.\nComparativa de las principales gafas de Realidad Virtual - Mundo-virtual.com", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Ciberadicci%C3%B3n", "title": "Ciberadicción", "summary": "Busca fuentes: «Ciberadicción» – noticias · libros · académico · imágenes\nEl uso problemático de Internet, se define generalmente como un uso problemático y compulsivo de Internet, que resulta en un deterioro significativo en la función de un individuo en varios aspectos de la vida durante un período prolongado. Es un fenómeno creciente que se da sobre todo en los grupos más jóvenes.[1]​\nEl uso problemático de Internet no ha sido reconocido como un desorden por la Organización Mundial de la Salud, el Manual diagnóstico y estadístico de los trastornos mentales  o la Clasificación Internacional de Enfermedades (CIE-11).  Sin embargo, el diagnóstico de Trastorno por videojuegos si ha sido incluido en el CIE-11.\nLas controversias sobre el uso problemático de Internet incluyen si el trastorno es una entidad clínica separada o una manifestación de trastornos psiquiátricos subyacentes. Los investigadores han abordado la cuestión desde una variedad de puntos de vista, sin definiciones universalmente estandarizadas o acordadas. Esto ha llevado a dificultades en el desarrollo de recomendaciones basadas en evidencia.\nOficialmente sólo se puede hablar de un uso excesivo de internet que, si afectara a la vida diaria, sería por otras causas y el uso excesivo sería una consecuencia y no una causa de patología.\n", "sections": [{"name": "Distintas posturas sobre la existencia o no del trastorno", "text": "", "subsections": [{"name": "Contra la existencia", "text": "Según la catedrática de psicología de la Universidad de Deusto Helena Matute[2]​ no existe la llamada \"ciberadicción\". La teoría se basa en:\nEl término \"adicción a Internet\" fue originalmente una broma de correo electrónico.[2]​\nLa adicción a Internet no figura en el DSM V (editado el 18 de mayo de 2013), el manual más utilizado para el diagnóstico de desórdenes mentales, editado por la Asociación Americana de Psiquiatría, y tampoco ha sido aceptada por la Asociación Americana de Psicología. Los defensores de su existencia se escudan en que la red Internet es aún muy nueva y por eso no ha sido aún aceptada la existencia de esta adicción por las principales asociaciones profesionales. Su inclusión en el DSM V (el DSM IV data del año 2000) se encontraba a debate.[3]​ Al parecer fue rechazada de nuevo, incluyéndose, que  tenga que  ver con Internet, sólo la adicción al juego por Internet, como variante de la adicción al juego y desestimando así de nuevo que exista algo llamado \"ciberadicción\" o \"adicción a Internet\".\n"}, {"name": "A favor de la existencia", "text": "Varías clínicas y algunos expertos insisten en su existencia como patología y/u ofrecen una terapia para tratarla. Oficialmente se considera que pueda existir un \"uso excesivo\", pero nunca una \"adicción\", y que sus causas vendrán motivadas no por Internet en sí, si no por causas externas que llevan al usuario a buscar una vía de escape en Internet y sus posibilidades. Una de las causas más valoradas son los problemas para establecer relaciones sociales, algo más sencillo de conseguir por Internet gracias al anonimato y desinhibición, aunque puedan resultar más efímeras.\nDe acuerdo a Aguilar y Octavio[4]​ los factores estresantes están relacionados en gran medida con las adicciones. Comenta Michael Kunar[5]​  que todas las drogas, el uso del Internet, y el chocolate afectan de forma similar al cerebro, por esta razón se puede decir que aunque el abuso del Internet no es considerado como una adicción tiene características similares a las de una persona adicta.\n"}]}, {"name": "Prevalencia", "text": "Según el informe sobre Adicciones comportamentales 2020 elaborado por ministerio de sanidad del gobierno español, en el año 2019/2020 un 3,7 % de la población española realizó un posible uso  compulsivo de internet, lo que supondría una cifra estimada de aproximadamente 1 100 000 personas solamente en España.[6]​\n", "subsections": []}, {"name": "Sociedad", "text": "", "subsections": [{"name": "Adictos a Internet y la Tecnología Anónimos", "text": "Adictos a Internet y la tecnología Anónimos  (ITAA), fundado en 2017, es un programa de doce pasos que apoya a personas que tienen problemas con el uso compulsivo de Internet y la tecnología.[7]​  Algunas de las sub-adicciones más comunes incluyen la adicción a los teléfonos inteligentes, la adicción a los videos en internet, la adicción a la información y la adicción a las redes sociales. De manera similar a otras confraternidades de doce pasos como Comedores Compulsivos Anónimos o Adictos al Sexo y al Amor Anónimos, la mayoría de los miembros no definen la sobriedad como abstenerse completamente del uso de Internet. En su lugar la mayoría de los miembros encuentran sus propias definiciones de abstinencia y de comportamientos problemáticos, como no usar la computadora o Internet a ciertas horas o ubicaciones, o no visitar ciertos sitios o categorías de sitios webs que han probado a ser problemáticos en el pasado. \nLas reuniones proveen una fuente de apoyo para las personas, donde pueden compartir dificultades, victorias, y herramientas para aprender a funcionar en la vida una vez que se invierte menos tiempo en el uso problemático de la tecnología.\n"}, {"name": "NoSurf", "text": "La comunidad de Reddit NoSurf[8]​ mantiene una lista de recursos y estrategias útiles para las personas que están tratando de reducir su uso de Internet. Esto incluye listas de software que los usuarios usan para controlar que sitios visitan y cuándo, y un subreddit dedicado a discutir la problemática del uso excesivo de Internet y distintas soluciones al mismo.\n"}]}, {"name": "Véase también", "text": "Adicción a los videojuegos\nWorkahólico\nJuego compulsivo\nCibersexo\nPhubbing\nNomofobia\nProcrastinación\nCyber Seduction: His Secret Life\nDetox digital\n", "subsections": []}, {"name": "Notas y referencias", "text": "↑ Fioravanti G, Dèttore D, Casale S. «Adolescent internet addiction: testing the association between self-esteem, the perception of internet attributes, and preference for online social interactions.». Cyberpsychol Behav Soc Netw. 2012 Jun;15(6):318-23. \n↑ a b Helena Matute (ed.). «La adicción a Internet no existe». La adicción a Internet no existe. \n↑ «La inclusión de la ciberadicción en el DSM V a debate». La inclusión de la ciberadicción en el DSM V a debate. Archivado desde el original el 26 de febrero de 2012. \n↑ «Algunos factores relacionados con las adicciones». \n↑ «Cerebro Adicto». \n↑ Observatorio Español de las Drogas y las Adicciones. Informe sobre Adicciones Comporta-mentales 2020: Juego con dinero, uso de videojuegos y uso compulsivo de internet en las encuestas de drogas y otras adicciones en España EDADES y ESTUDES. Madrid: Ministerio de Sanidad. Delegación del Gobierno para el Plan Nacional sobre Drogas, 2021\n↑ «Adictos a Internet y la Tecnología Anónimos». \n↑ «Comunidad de Reddit NoSurf». \n", "subsections": []}, {"name": "Enlaces externos", "text": "http://www.oocities.org/HotSprings/6416/ciberadiccion.htm\nhttp://revistas.uap.edu.pe/ojs/index.php/HAMUT/article/viewFile/1309/1287", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Clasificaci%C3%B3n_Internacional_de_Enfermedades", "title": "Clasificación Internacional de Enfermedades", "summary": "La Clasificación Internacional y Estadística de Enfermedades y Problemas Relacionados con la Salud (en inglés International Statistical Classification of Diseases and Related Health Problems), también conocida como Clasificación Internacional de Enfermedades (CIE; ICD, en inglés), es la lista oficial de enfermedades publicada por la Organización Mundial de la Salud que clasifica y codifica los padecimientos humanos y la amplia variedad de signos, síntomas, circunstancias sociales y causas externas de cada uno.[1]​\n", "sections": [{"name": "Historia", "text": "La CIE es publicada por la Organización Mundial de la Salud (OMS). Este sistema está diseñado para promover la comparación internacional de la recolección, procesamiento, clasificación y presentación de estas estadísticas. La CIE es la clasificación central de la WHO Family of International Classifications (WHO-FIC) (en castellano o español: la Familia de Clasificaciones Internacionales de la OMS).[2]​ \nLa CIE tiene su origen en la «Lista de causas de muerte», cuya primera edición editó el Instituto Internacional de Estadística (International Statistical Institute) en 1893. La OMS se hizo cargo de la misma en 1948, en la sexta edición, la primera en incluir también causas de morbilidad. \nLa CIE-10 se desarrolló en 1992 y su propósito fue rastrear estadísticas de mortalidad. La OMS publica actualizaciones menores anuales y actualizaciones mayores cada tres años.\nPosteriormente, algunos países han creado sus propias extensiones del código CIE-10. Por ejemplo, Australia presentó su primera edición, la «CIE-10-AM» en 1998; Canadá publicó su versión en el 2000, la «CIE-10-CA». Alemania también tiene su propia extensión, la «CIE-10-GM».\nEn los Estados Unidos se añadió el anexo con el sistema de clasificación de procedimientos o ICD-10-PCS.\nLa edición más reciente de la CIE (de 18 de junio de 2018) de la undécima o CIE-11, que entró en vigor en 2022 para sustituir a la vigente desde la década de los 1990.[3]​\n", "subsections": []}, {"name": "Véase también", "text": "CIE-11\nCIE-O\n", "subsections": []}, {"name": "Referencias", "text": "↑ WHO. Classifications. International Classification of Diseases (ICD). [1]\n↑ «OMS Familia de Clasificaciones Internacionales». OMS. Consultado el 24 de abril de 2007. \n↑ Borraz, Marta (18 de junio de 2018). «La OMS deja de considerar la transexualidad un trastorno mental». eldiario.es. Consultado el 18 de junio de 2018. \n", "subsections": []}, {"name": "Enlaces externos", "text": "Sitio web oficial (en inglés)", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Commodore_64", "title": "Commodore 64", "summary": "Commodore 64 (C64, CBM 64/CBM64, C=64,C-64, VIC-64[1]​) es una computadora doméstica de 8 bits desarrollada por Commodore International en agosto de 1982 a un precio inicial de 595 dólares. Sucede a la Commodore VIC-20 y a la Commodore MAX Machine, con 64 kilobytes (65 536 bytes) de RAM, con gráficos y sonido muy por encima de otros equipos contemporáneos.\nUtilizaba una unidad de casete (Datasette) además de una disquetera de 5 1/4 pulgadas (Commodore 1541). Disponía de un teclado profesional muy robusto, distintas tomas de conexión y poseía infinidad de videojuegos, aplicaciones y gráficos. Contaba con una paleta de 16 colores y un intérprete BASIC (el Commodore BASIC v2.0). Aceptaba la conexión directa de periféricos sin necesidad de una interfaz de conexión, (como alguno de sus más directos competidores) incorporando dos puertos de conexión de mandos de juego (joysticks), puertos serie IEC, RS232 y C2N, salida a televisión, salidas de vídeo compuesto y audio mediante conector DIN de alta fidelidad y un puerto de expansión para cartuchos. Algunos cartuchos incorporaban lenguajes de programación como COBOL, o un BASIC más avanzado, o expansión de RAM, más algunas utilidades para congelar los juegos y poder copiarlos. Su reloj funcionaba a menos de 1 Megahercio, pero sus excelentes capacidades gráficas y sonoras, hicieron de ella la computadora personal favorita de millones de usuarios caseros. Hoy en día existen programas que emulan su funcionamiento al completo, para GNU/Linux, Windows y otros sistemas operativos.\nEl Commodore 64 sigue siendo el modelo de computadora doméstica más vendida en el mundo. Se estiman sus ventas entre 22,5 y 17 millones de unidades[2]​\n", "sections": [{"name": "Orígenes", "text": "En enero de 1981, MOS Technology, Inc., diseñadora de circuitos integrados subsidiaria de Commodore, inició un proyecto para diseñar los circuitos gráfico y de audio para la nueva generación de videoconsolas. El diseño de los circuitos, llamados VIC-II (gráficos) y SID (audio) fue completado en noviembre de 1981.\nEntonces se comenzó un proyecto para una videoconsola de Commodore que usara ambos circuitos, llamada Ultimax o Commodore MAX Machine, creada por Yashi Terakura de Commodore Japón. Este proyecto fue cancelado después de fabricarse algunas unidades para el mercado japonés.\nAl mismo tiempo, Robert \"Bob\" Russell, programador de sistemas y arquitecto del VIC-20, y Robert \"Bob\" Yannes, ingeniero del SID, eran críticos para la línea de productos de Commodore, la cual era una continuación de la línea PET, dirigida a usuarios de negocios. Con el apoyo de Al Charpentier, ingeniero del VIC-II, y de Charles Winterble, gestor de MOS Technology, propusieron a Jack Tramiel, oficial ejecutivo en jefe de Commodore, una verdadera secuela de bajo coste del VIC-20. Tramiel dictaminó que la máquina debía tener 64 KB de RAM. Aunque 64 KB de DRAM costaban más de 100 dólares en ese momento, Tramiel sabía que los precios caían y que muy pronto tendrían un precio aceptable antes de iniciarse la producción. En noviembre, Tramiel fijó como fecha de entrega el primer fin de semana de enero, para coincidir con el Consumer Electronics Show de 1982.\nEl producto tenía el nombre en clave de VIC-40, al ser el sucesor del popular VIC-20. El equipo que lo construyó fue formado por Robert Russell, Robert Yannes y David A. Ziembicki. El diseño, los prototipos y algún software de prueba fue acabado a tiempo para el show, después de haber estado el equipo trabajando sin descanso incluso en los fines de semana del día de Acción de Gracias y Navidad.\nCuando el producto iba a ser presentado, el VIC-40 fue renombrado a C64 para ajustarse a las líneas actuales de negocios de Commodore, las cuales incluían el P128 y el B256, ambos nombrados con una letra y su respectivo tamaño de memoria.\nEl C64 tuvo una presentación impresionante, tal y como recuerda el ingeniero de producción David A. Ziembicki: \"Todo lo que veíamos en nuestro pabellón era gente de Atari con la boca abierta, diciendo '¿Cómo pueden hacer esto por 595$?'\". La respuesta era, según se vio, la integración vertical: gracias a ser Commodore la dueña de las plantas de fabricación de semiconductores de MOS Technology, cada C64 tenía un costo estimado de producción de solo 135 dólares.\n", "subsections": []}, {"name": "Los diferentes modelos de Commodore 64", "text": "Además del C64 con su diseño característico heredado del VIC-20, Commodore y otros fabricantes pusieron a la venta unos modelos derivados del C64 de base.\n", "subsections": [{"name": "Max Machine", "text": "En 1982, Commodore desarrolló el Commodore MAX Machine en Japón, llamado Ultimax en los EE. UU., y VC-10 en Alemania. El MAX fue pensado para ser una consola de juegos y se basó en una versión muy reducida del hardware del C64. El MAX se suspendió meses después de su introducción, a causa de las malas ventas en Japón.\n"}, {"name": "Educador 64", "text": "En 1983, para competir con Apple II en el sector de la educación en Estados Unidos, Commodore ponía en el mercado el Educator 64 que consistía esencialmente en un C64 y un monitor monocromático verde, dentro de una caja de un Commodore PET serie 4000. Las escuelas prefirieron las versiones todo-en-uno en metal de este modelo al estándar C64 con sus componentes separados, ya que podían ser fácilmente dañados, ser sometidos a actos de vandalismo y/o robo.\n"}, {"name": "SX-64", "text": "En 1984, Commodore proponía el primer ordenador portable con pantalla color, el Commodore SX-64, una versión portable del C64. Tenía una pantalla CRT color de 5\" (127 mm) e incluía solo una unidad de disquete 1541, no incluía la unidad de casete (Datasette).\n"}, {"name": "128", "text": "En 1985 aparece el Commodore 128 (y más tarde el 128D) que es retro-compatible con el C64. Es una versión mejorada del C64 con el doble de memoria (RAM), con posibilidad de mostrar en pantalla 80 columnas en modo texto, además de un diseño nuevo de la caja y del teclado. También incluya un procesador Zilog Z80 para usarlo en modo CP/M en alternancia con el Commodore BASIC 7.0.\n"}, {"name": "64C", "text": "En 1986, Commodore lanzó el Commodore 64C (C64C) que era funcionalmente idéntico al original, pero con un diseño más parecido al Commodore 128. Las modificaciones fueron más allá del simple cambio de look, ya que el C64C incorporaba nuevas versiones del chip de sonido SID, del chip vídeo Vic y del chip de entrada/salida (I/O), adaptados a un nuevo voltaje en el núcleo (Vcore) de 9V (en vez de 12V). A menudo, el C64C fue vendido con el sistema operativo GEOS. En paralelo, la nueva unidad de disco Commodore 1541C cambió su look para adaptarse al nuevo C64C, además de ser más silenciosa y más fiable.\n"}, {"name": "64GS", "text": "En 1990, el C64 fue re-editado en forma de una consola de juegos, llamado Commodore 64 Games System (C64GS). Se hizo una modificación simple de la placa base del C64C para orientar el conector del cartucho en posición vertical. Solo tenía las conexiones mínimas para conectar el audio, el vídeo, los mandos de juegos y el cartucho. Su ROM fue modificada para simplificar el arranque del sistema con una pantalla de inicio al estilo \"Inserte el cartucho de juego\". Fue diseñado para competir con la Nintendo Entertainment System y el Sega Master System, pero sus malas ventas comparadas con sus rivales fue un fracaso comercial para Commodore y nunca fue lanzado fuera de Europa.\n"}, {"name": "Otros", "text": "En 2000, el fabricante Tulip Computers propone un producto basado en el C64, el C64 Direct-to-TV. Este peculiar modelo del C64 está contenido dentro de un mando de juego, de tipo Joystick. A la base, es un sistema cerrado ya que solo propone 30 juegos clásicos del C64, 2 conectores RCA (audio/vídeo) y en su interior, un ASIC funcionando a 32 MHz emulando al procesador 6510, al VIC-II, al SID, al CIA y al PLA. Existen modificaciones para extender sus capacidades y mejorar su conectividad con lectores externos por ejemplo.\nOtros modelos del C64, muy específico al mercado alemán, aparecieron durante esos años, como el Commodore 64 \"Aldi\", el Commodore 64 Golden Edition y el Commodore 64G\n"}]}, {"name": "Características varias", "text": "La Commodore 64 fue la computadora que inspiró a muchos músicos y programadores y es posiblemente el ordenador de 8 bits de culto más importante. A día de hoy existe una comunidad de usuarios muy activa que siguen programando para el C64, haciendo auténticas filigranas. También existe una subcultura musical dentro del Commodore 64.\nTambién inspiró a otros empresarios como por ejemplo, la tecla Commodore, esta era una tecla especial que daba muchas funciones al presionarla combinada con otras teclas, al igual que los teclados compatibles con Windows tienen el logotipo del sistema operativo de Microsoft, y los teclados para Apple Macintosh, el logotipo de Apple Inc..\nLa interfaz gráfica GEOS se podía hacer arrancar desde una memoria EPROM en los cartuchos de expansión, con lo cual al encender la Commodore 64, esta iniciaba la interfaz gráfica vía hardware dándole una velocidad insuperable contra el Datasette y la disquetera. Con esto quedaba una computadora óptima para trabajo directo, incluso se logró mantener un reloj en la interfaz GEOS con lo cual mejoraba mucho sus capacidades.\nVale la pena hacer notar que la Commodore 64 tenía una excelente arquitectura de hardware dada su capacidad de expansión mediante cartuchos y una gran versatilidad.\nTambién tenía periféricos como mouse, impresora, disquetera, discos duros, módem telefónico, joysticks, lápiz óptico, teclado de música, monitores, casetes, etc.\nEn el año 2005 la compañía Creative Micro Designs lanzó al mercado la CMD SuperCPU, que se conectaba en el puerto de expansión proporcionado una CPU de 16 bits WDC 65C816 a 20 MHz, que además soporta expansión de 16 MB de memoria RAM y la conexión de un disco duro.\nActualmente se pueden descargar juegos de la Commodore 64 en la Consola Virtual de la Wii\n", "subsections": []}, {"name": "Especificaciones técnicas", "text": "Microprocesador:\nMOS Technology 6510/8500 (un MOS 6502 con un puerto integrado de entrada/salida de 6 bits)\nVelocidad de reloj: 0,985 MHz (PAL) / 1023 MHz (NTSC)\nVideo: MOS Technology VIC-II 6567/8567 (NTSC), 6569/8569 (PAL)\n16 colores\nModo texto: 40×25 caracteres; 256 caracteres definibles (8×8 píxeles, o 4×8 en modo multicolor); fondo definido por 4-bit\nModo mapa de bits: 320×200 (2 colores únicos en cada bloque de 8×8 píxeles),[3]​ 160×200 (3 colores únicos más un color común en cada bloque de 4x8)[4]​\n8 sprites por hardware de 24×21 píxeles, (12×21 en modo multicolor)\nSonido: MOS Technology 6581/8580 SID\nSintetizador de 3 voces con ADSR controlable\n8 Octavas\n4 Formas de onda: triángulo, sierra, pulso variable, ruido\nSincronización de osciladores, Modulación en anillo\nFiltros programables: paso alto, paso bajo, paso banda, elimina banda\nRAM:\n64 Kilobytes (65 536 bytes), de los cuales 38 KB menos 1 byte (38911 bytes) está disponible para programas en BASIC\n512 bytes de RAM para color\nROM:\n20 Kilobytes (9 KB BASIC 2.0, 7 KB KERNEL, 4 KB caracteres: dos juegos de 2 KB cada uno)\nEntrada/Salida:\nPuerto serie RS232C (para módem, consola, etc.)\nPuerto serie IEC (para unidades de disco, impresoras, etc.)\nPuerto serie C2N (para datasette)\nSalida de video compuesto y audio\nSalida modulada para TV\nConector de expansión para cartuchos (al BUS interno del C64)\n2 conectores para mando de juego (joystick u otros dispositivos como ratón, paddle, lápiz óptico, tableta gráfica).\n", "subsections": []}, {"name": "Clones de Commodore 64", "text": "Muchos países fabricaron clones de este modelo no siempre bajo licencia Commodore.\nEn Argentina la firma Drean, un fabricante de electrodomésticos argentino, compró en 1982 la licencia para fabricar localmente la C64, comenzando la producción en su planta en la provincia de San Luis en 1983. Luego, ante el éxito de ventas, fabricaría los modelos 16 en 1985 (con poco éxito de ventas), 64C a fines de 1986 (con la mayoría de sus partes fabricadas localmente) y 128 a inicios de 1986 (con unos pocos cientos de unidades producidas).[5]​\nEl modelo 64 se asemejaba a su par estadounidense, diferenciándose exteriormente en las siglas de encendido y en el anexo de la palabra Drean anteponiéndose a Commodore 64 en la carcasa de la máquina. Las mismas diferían de color en sus años de fabricación, algunas respetaban a las de Estados Unidos y otras no, ya que los plásticos se fabricaban localmente. Internamente la versión Argentina tenía salida de video PAL-N en lugar de NTSC; además, por este motivo, tenía una frecuencia de reloj mayor, lo que se podía notar en algunos juegos ya que estos fueron diseñados en su mayoría para la versión estadounidense. Otra diferencia destacable era la fuente de alimentación adaptada para 220V en lugar de los 110V originales. Estos clones legítimos eran de excelente calidad, aunque algunos usuarios se quejaban de la dureza del teclado, y 8 de cada 10 \"Commodores\" vendidas llegaron a ser de Drean. La Drean Commodore 64C era internamente igual al modelo 64. La diferencia radicaba en el formato de la carcasa, que era más ergonómica, similar al teclado del modelo 128. A diferencia de los otros modelos, incluía el disquete de GEOS. Drean también importó software, que era distribuido en forma de cartuchos, casetes y disquetes, con su marca o bajo la marca Peek.\nLa producción finalizó a mediados de 1988, cuando Commodore International le retiró la licencia a Drean, luego de haber producido unas 300 000 unidades.[6]​\n", "subsections": []}, {"name": "Véase también", "text": "Listado de emuladores de Commodore 64\nCommodore BASIC\nCommodore PET\nCommodore VIC-20\nCommodore 16\nCommodore 128\nCommodore Amiga\nCommodore International\nCommodore Educator 64\nCommodore serie MPS\nJack Tramiel (Fundador de la Compañía)\nHistoria de los computadores personales\nContiki (Sistema operativo)\n", "subsections": []}, {"name": "Referencias", "text": "↑ VIC 64 Användarmanual. Imagen de la edición sueca del manual del usuario del VIC 64.\n↑ [1] Archivado el 6 de marzo de 2016 en Wayback Machine. How many Commodore 64 computers were sold? (ing.)\n↑ Rautiainen, Sami. «Programmers_Reference». Consultado el 13 de septiembre de 2008. \n↑ Rautiainen, Sami. «Programmers_Reference». Consultado el 13 de septiembre de 2008. \n↑ http://www.compuclasico.com/argentinos.php?model=dreancommodore.html\n↑ http://www.retrocomputacion.com/e107_plugins/content/content.php?content.12\n", "subsections": []}, {"name": "Enlaces externos", "text": " Wikimedia Commons alberga una galería multimedia sobre Commodore 64.\nJuegos y Emuladores descargables de Commodore 64", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Compatible_IBM_PC", "title": "Compatible IBM PC", "summary": "Se denomina compatible IBM PC o IBM PC compatible a un tipo de ordenadores similares al IBM PC, IBM Personal Computer XT e IBM Personal Computer/AT. Estos ordenadores también llamados PC clones, IBM clones o clónicos, se denomina así porque casi duplican exactamente todas las características importantes de la arquitectura PC, hecho facilitado por la posibilidad de realizar legalmente ingeniería inversa de la BIOS mediante el diseño de sala limpia por parte de varias compañías. Columbia Data Products construyó el primer clon de un IBM PC mediante una implementación de sala limpia de la BIOS.\nMuchos de los primeros compatibles IBM PC utilizan el mismo bus que los IBM PC e IBM AT originales. El bus compatible IBM AT es posteriormente llamado Bus ISA por los fabricantes de ordenadores compatibles.\nLos descendientes de los compatibles IBM PC constituyen la mayoría de las computadoras personales del mercado actual, pese a que la interoperabilidad con la estructura de bus y periféricos de la arquitectura PC original sea limitada o inexistente. \n", "sections": [{"name": "Orígenes", "text": "Los orígenes de esta plataforma se inician con la decisión adoptada por IBM en 1980 de comercializar un ordenador personal de bajo coste lo antes posible en respuesta al éxito de Apple Computer en el creciente mercado. El 12 de agosto de 1981 se pone en venta el primer IBM PC. Había tres sistemas operativos disponibles para él, pero el más popular y menos caro fue PC DOS, una versión de MS DOS licenciada por Microsoft. En una concesión crucial, el acuerdo con IBM permitió a Microsoft vender su propia versión, MS-DOS, para las plataformas no-IBM. El único componente propietario del PC es la BIOS (Basic Input/Output System).\nSe fabricaron gran cantidad de ordenadores basados en los microprocesadores Intel 8086 y 8088, durante ese período, pero con arquitectura diferente a la del PC, y que desarrolló por ello sus propias versiones de DOS y CP/M-86. Sin embargo, el software que aborda directamente el hardware en lugar de hacer llamadas a nivel de MS-DOS es más rápido. Esto es particularmente relevante en los videojuegos. El IBM PC fue la única máquina que se vende en volúmenes lo suficientemente altos como para justificar el software escrito específicamente para ella, y esto motiva a otros fabricantes a producir máquinas que puedan usar los mismos programas, tarjetas de expansión y periféricos que el PC. El mercado de ordenadores 808x excluye rápidamente todas las máquinas que no fueran funcionalmente muy similares al PC. El límite de 640 Kilobytes de memoria RAM convencional disponible para MS-DOS es una herencia de este período; otras máquinas no clónicas no tienen ese límite.\nLos \"clones\" del IBM PC se crearon sin la participación o aprobación de IBM. Columbia imita estrechamente al IBM PC y produce el primer \"compatible\" PC (es decir, más o menos compatible con el estándar IBM PC) en junio de 1982, seguido al poco por Eagle Computer. Compaq Computer Corp. anuncia su primer compatible unos meses después en noviembre de 1982, el Compaq Portable. El Compaq fue el primer ordenador portable del tamaño de una máquina de coser que es esencialmente 100% compatible. La empresa no podía copiar directamente la BIOS, como resultado de la decisión judicial en el caso Apple v. Franklin, pero sí puede realizar ingeniería inversa de la BIOS de IBM y luego escribir su propia BIOS utilizando el diseño de sala limpia.\n", "subsections": []}, {"name": "Problemas de compatibilidad", "text": "Al mismo tiempo, muchos fabricantes, como Xerox, Hewlett Packard, Digital, Sanyo, Texas Instruments, Tulip, Wang y Olivetti lanzaron ordenadores personales que era compatibles MS-DOS, pero no completamente software o hardware compatibles con el IBM PC.\nLa intención de Microsoft, y la de la industria desde 1981 hasta mediados de los años 1980, era que los programadores de aplicaciones utilizaran las APIs en MS-DOS o el firmware de la BIOS, utilizando lo que hoy llamamos una capa de abstracción de hardware. Cada ordenador tendría su propia versión OEM de MS-DOS, personalizado para su hardware. Cualquier software escrito para MS-DOS podría ejecutarse en cualquier ordenador MS-DOS, a pesar de las variaciones en el diseño de hardware. Un camino similar se siguió con los ordenadores domésticos MSX.\nEsta expectativa parece razonable para el mercado de computadoras de la época. Hasta entonces, Microsoft se centra principalmente en lenguajes de programación como BASIC. El por entonces sistema operativo por excelencia para pequeños ordenadores era CP/M de Digital Research que se utilizaba tanto en el por usuarios aficionados como profesionales. Para lograr ese uso generalizado y, por tanto, hacer el producto económicamente viable, el sistema operativo tenía que poder funcionar en un rango de ordenadores de diferentes fabricantes con una amplia variedad de hardware. Aquellos clientes que necesitan otras aplicaciones más allá de los Starter Pack podría esperar razonablemente que los diferentes editores de software les ofrecieran sus productos para una amplia variedad de ordenadores, en el soporte adecuado para cada uno.\nEl sistema operativo de Microsoft estaba inicialmente orientado para ejecutarse en una variada gama de hardware, aunque todas basadas en el procesador 8086. Por ello, MS-DOS fue vendido durante muchos años solo como un producto OEM. No había MS-DOS con marca Microsoft: MS-DOS no podía adquirirse directamente a Microsoft, y cada versión OEM era empaquetada con la marca del fabricante de PCs licenciatario. Las diferentes versiones eran en general incompatibles con hardware diferente. Los errores debían notificarse al OEM, no a Microsoft. Sin embargo, cuando se extendieron los clones, pronto quedó claro que las versiones OEM de MS-DOS eran prácticamente idénticas, excepto tal vez por la presencia de algunos programas de utilidad.\nMS-DOS proporciona el soporte adecuado para aplicaciones orientadas a caracteres como las que se pueden implementar para un terminal de computadora de solo texto. La mayor parte del software con importancia comercial entraba en estos límites, donde el bajo nivel de compatibilidad hardware no tenía importancia. Sin embargo, con el fin de proporcionar el máximo rendimiento y aprovechar las características de hardware (o trabajar sobre los errores de hardware), las aplicaciones de PC evolucionaron muy rápidamente más allá del simple terminal de aplicaciones que MS-DOS soporta directamente. Hojas de cálculo, procesador de textos WYSIWYG, soft de presentaciones y software de comunicaciomes remotas establecieron nuevos mercados que explotaban los puntos fuertes del PC, pero requieren capacidades más allá de lo que proporciona MS-DOS. Por ello, desde muy temprano en el entorno de desarrollo de aplicaciones para MS-DOS, muchos productos de software comerciales importantes fueron escritos directamente para el hardware, por una variedad de razones:\nMS-DOS en sí no proporciona ninguna manera de colocar el cursor de texto (excepto para avanzar después de la impresión de cada carácter). Mientras que las rutinas de la BIOS para la interfaz de vídeo eran adecuadas par un manejo rudimentario, eran muy ineficaces; no había salida de cadena de caracteres (solo salida carácter a carácter) y esto añade períodos de retardo para compensar el efecto nieve del hardware CGA (cuando en las tarjetas CGA se escribía directamente en la VRAM se mostraban artefactos en la pantalla) algo especialmente malo cuando se llaman via IRQs, lo que hace muy difícil la multitarea. Un programa que escriba la salida directamente a la memoria de vídeo puede alcanzar tasas de 5 a 20 veces más rápido que utilizar llamadas estándar a la BIOS y MS-DOS. Turbo Pascal utiliza esta técnica desde sus primeras versiones.\nLa capacidad gráfica no fue tomada en serio en el diseño original de IBM, que se consideró una novedad exótica. MS-DOS no tenía un API para gráficos, y la BIOS solo incluía las funciones más rudimentarias de gráficos (por ejemplo, los cambios de modo de pantalla o el dibujo punto a punto). Para realizar una llamada de la BIOS por cada punto dibujado o modificado se incrementaba considerablemente el trabajo, haciendo la interfaz de la BIOS notoriamente lenta. Debido a esto, dibujar líneas o arcos, y el bit blit, tuvo que ser llevado a cabo por cada aplicación para lograr una velocidad aceptable, que se solía hacer ignorando la BIOS y accediendo directamente a la memoria de vídeo.\nLos videojuegos, incluso los primeros, en su mayoría requerían un modo gráfico verdadero. También se realizó algún truco dependiente de la máquina que los programadores podían utilizar para ganar velocidad. Aunque en un principio el principal mercado del PC fue el profesional, la capacidad de los juegos se convirtió en un factor importante en el impulso de las compras de PC cuando sus precios cayeron. La disponibilidad y calidad de los juegos podría significar la diferencia entre la compra de un PC compatible o una plataforma interoperable diferente como el Commodore Amiga.\nEl software de comunicaciones accedía directamente al chip UART, ya que el API de MS-DOS y el BIOS no proporcionaba soporte completo a las capacidades del chip y era demasiado lento para mantenerse al día con hardware que pudiera transferir datos a 19200 baudios.\nIncluso para las aplicaciones empresariales estándar, la velocidad de ejecución fue una ventaja competitiva significativa. Esto se demostró dramáticamente en el golpe de gracia de Lotus 1-2-3 a su rival Context MBA en el popular género del software integrado. Context MBA, ahora casi olvidado, precedió a Lotus en el mercado e incluía más funciones; fue escrito en lenguaje Pascal, lo que lo hacía altamente portable, pero, habida cuenta de los compiladores del momento, resultaba demasiado lento para ser realmente útil en un PC. Lotus fue escrito en lenguaje ensamblador puro y realizaba algunas tareas directamente en la máquina. Era mucho más rápido que el Context MBA, que desapareció tan pronto como Lotus llegó.\nLos sistemas de protección de copia de disco, de uso común en el momento, funcionaban buscando patrones de datos no estándar en el disquete para verificar la originalidad. Estos patrones eran difíciles o imposibles de detectar usando DOS estándar o llamadas a la BIOS, por tanto el acceso directo al hardware controlador de disco era necesario para la protección del trabajo.\nAl principio, pocos compatibles aparte del Compaq ofrecían compatibilidad más allá del nivel DOS/BIOS. Los evaluadores y los usuarios desarrollaron suites de programas para probar la compatibilidad; la capacidad de ejecutar el Lotus 1-2-3 o Microsoft Flight Simulator se convirtió en uno de los más importantes pruebas. Los vendedores no solo aprendieron gradualmente la manera de emular la BIOS de IBM, sino también dónde utilizar chips idénticos para desempeñar funciones clave dentro del sistema. Finalmente, el Phoenix BIOS y productos similares disponibles comercialmente permitieron a los fabricantes de computadoras la fabricación de clones prácticamente 100% compatibles sin necesidad de realizar ingeniería inversa de la BIOS del IBM PC. \nCon el tiempo, IBM perjudicó su propio mercado al no apreciar la importancia de la compatibilidad IBM, introduciendo productos como el IBM portátil (que fue superado en ventas por el anterior Compaq Portable) y el PCjr (que tenía importantes incompatibilidades con el PC original y se retiró en breve). \nDesde mediados de la década de 1980 hasta finales de la misma, los compradores comenzaron a considerar el PC como el producto básico, y dudaban de que el plus de seguridad de la marca IBM estaba garantizado por el precio más alto. Mientras tanto, los sistemas compatibles MS-DOS (pero no compatibles en hardware) no tuvieron éxito en el mercado. Su incapacidad para ejecutar los paquetes de software de alto rendimiento para IBM PC y compatibles verdaderos motivó sus bajas ventas y la extinción de esta categoría de sistemas. Por su incompatibilidad de hardware con el diseño del IBM PC, el procesador 80186, lanzado solo un año después del IBM PC, nunca fue popular en los ordenadores personales de uso general.\n", "subsections": []}, {"name": "La decreciente influencia de IBM", "text": "Después de 1987, los PCs compatibles IBM dominaron en el mercado de productos básicos, tanto en el campo doméstico como en el profesional,[1]​ con otras notables arquitecturas alternativas como los equipos Macintosh ofertados por Apple Inc., el Commodore 64 de 8 bits que finalmente se convirtió en el ordenador de mayor venta en el mundo, y la línea Commodore Amiga de 32 bits utilizada en la televisión y producción de vídeo. Sin embargo, la propia IBM perdió el liderazgo en el mercado de los compatibles IBM PC en 1990. Algunos pocos sucesos fueron probablemente los puntos de inflexión: \nLa introducción en 1982 del Compaq Portable, el primer ordenador 100% compatible con IBM PC (Columbia Data Products), un ordenador portátil del que IBM no disponía en ese momento. La compatibilidad y el rendimiento del portátil legitimó este clon de PC para muchas empresas.\nCompaq superó a IBM en el mercado en 1986 con el primer PC basado en 80386.\nLa introducción por IBM de tecnologías incompatibles en 1987, tales como su sistema patentado de Arquitectura de microcanal (bus MCA) para bus de computadora , en su línea IBM PS/2.\nLa introducción en 1988 por las empresas de la \"Banda de los Nueve\" de un bus rival, EISA , destinado a competir con MCA en lugar de copiarlo.\nEl duelo entre las normas de memoria expandida y memoria extendida en la década de 1980, ambas desarrolladas sin la participación de IBM.\nLa disponibilidad en 1989 de ordenadores compatibles con el PC-XT por debajo de 1000 dólares, incluyendo las tempranas ofertas de Dell Computer, reduciendo la demanda de la última tecnología de IBM.\nSin embargo, con la evolución del mercado, y a pesar del fracaso del bus MCA, IBM obtuvo un flujo de ingresos considerables por las tasas de licencia de empresas que pagaron por licencias de uso de las patentes de IBM que estaban en el diseño del PC, en la medida que los objetivos de IBM habían cambiado desde la disuasión de clones de PC hacia el aumento de ingresos por ventas de licencias. Paralelamente al desarrollo del PS/2, IBM también siguió vendiendo PCs compatibles, que esta vez incorporaban los estándares que habían sido desarrollados por sus competidores. IBM finalmente renunció a su papel como fabricante de PC en abril de 2005, cuando vendió su división de PC a Lenovo por 1750 millones de dólares. \nA partir de octubre de 2007, Hewlett-Packard y Dell Computer acapararon las mayores cuotas del mercado de PC en América del Norte. También son exitosos fuera de América, junto a Acer, Lenovo y Toshiba. A nivel mundial, un gran número de ordenadores son \"caja blanca\", sistemas ensamblados por un gran número de fabricantes de sistemas locales. A pesar de los avances en la tecnología informática, todos los actuales PC compatibles IBM guardan en gran medida cierta compatibilidad con las computadoras IBM PC originales, aunque la mayoría de los componentes implementan la \"compatibilidad hacia atrás\" con versiones anteriores en modos especiales, utilizados solo durante el arranque del sistema.\n", "subsections": []}, {"name": "Expansión", "text": "Uno de los puntos fuertes de la plataforma compatible PC es su diseño modular de hardware. Los usuarios finales pueden actualizar fácilmente los periféricos y, hasta cierto punto, el procesador y la memoria sin necesidad de modificar la placa base del equipo o reemplazar todo el equipo, como así ocurría con muchas de las microcomputadoras de la época. Sin embargo, a la vez que la velocidad del procesador y la cantidad de memoria fueron incrementándose, los límites del diseño de bus de la XT/AT original se alcanzaron en poco tiempo, sobre todo con las nuevas tarjetas gráficas. IBM introdujo un bus actualizado en el IBM PS/2, que superó muchos de los límites técnicos del bus de los XT/AT, pero rara vez se utilizó como base para computadoras compatibles con IBM, ya que requería el pago de licencias a IBM tanto para el bus PS/2 como para los diseños previos del bus AT que quedaban bajo licencia. Esto fue impopular entre los fabricantes de hardware, y varios estándares de bus en competencia fueron desarrollados por consorcios, con términos de licencia más asequibles. Se hicieron varios intentos de estandarizar las interfaces, pero en la práctica, muchos de estos intentos tuvieron fallos o bien fueron ignorados. Aun así, había muchas opciones de expansión, y la plataforma \"PC compatible\" avanzó mucho más rápidamente que otras plataformas competidoras de la época, incluso aunque sólo sea por su dominio del mercado. \n", "subsections": []}, {"name": "\"IBM PC compatible\" se convierte en \"Wintel\"", "text": "En la década de 1990, la influencia de IBM en la arquitectura del PC era cada vez más irrelevante. Un PC de marca IBM se convirtió en la excepción, no ya la regla. En lugar de centrarse en permanecer compatibles con el IBM PC, los vendedores comenzaron a centrarse en la compatibilidad con la evolución de Microsoft Windows. En 1993, fue puesta a la venta una versión de Windows NT que podía ejecutarse en procesadores distintos de los x86. (Esto requería que se volvieran a compilar las aplicaciones, un paso que la mayoría de desarrolladores no tomó.) Sin embargo, su independencia del hardware fue aprovechada por las estaciones de trabajo x86 de Silicon Graphics -gracias a la HAL de NT-, que podían funcionar con NT (y su vasta biblioteca de aplicaciones). Ningún vendedor de hardware de ordenador para el gran mercado se atrevió a ser incompatible con la última versión de Windows, y las conferencias anuales WinHEC de Microsoft sirvieron de marco en el que Microsoft podía ejercer presión a favor y en algunos casos dictar el ritmo y la dirección del hardware de la industria del PC. Intel y Microsoft se habían vuelto tan importantes para el continuo desarrollo del hardware de PC que los periodistas de la informática comenzaron a usar la contracción Wintel para referirse a la plataforma de hardware Intel y software Windows combinado. Este término se está convirtiendo en un término equivocado, ya que Intel ha perdido el control absoluto sobre la dirección del desarrollo de hardware, y otros sistemas operativos como Linux han comenzado a establecer una presencia notable.\n", "subsections": []}, {"name": "Limitaciones de diseño y otros problemas de compatibilidad", "text": "Aunque el IBM PC fue diseñado para permitir su expansión, los diseñadores no podían anticipar el desarrollo del hardware de los años 80. Para empeorar las cosas, la elección de la CPU Intel 8088 por IBM presentaba varias limitaciones que fueron obstáculos para el desarrollo de software para la plataforma PC compatible. Por ejemplo, el procesador 8088 solo tenía un espacio de direccionamiento de memoria de 20 bits. Para poder expandir la memoria del PC más allá de un megabyte, Lotus, Intel y Microsoft crearon conjuntamente la memoria expandida (EMS), un esquema de conmutación de banco para permitir más memoria proporcionada por complemento de hardware, y visto a través de un conjunto de cuatro \"ventanas \" de 16 kilobytes dentro del direccionamiento de 20 bits. Más tarde, las CPUs Intel tuvieron mayor espacio de direcciones y podían ocuparse directamente de 16 megabytes (caso del Intel 80286) o más, lo que permitió a Microsoft desarrollar la memoria extendida (XMS), que no requería hardware adicional. \nLa memoria expandida y la extendida tienen interfaces incompatibles, por lo que cualquier software que utilizaba más de un megabyte tenía que mantener soporte para los dos sistemas. Para dar mayor compatibilidad, MS-DOS comenzó a incluir el programa EMM386, que simula la memoria EMS utilizando memoria XMS. Un sistema operativo en modo protegido también podía ser escrito para el 80286, pero su compatibilidad con aplicaciones DOS era más difícil de lo esperado, no solo porque la mayoría de aplicaciones para DOS accedían directamente al hardware, sino también porque la mayoría de llamadas al BIOS eran realizadas a través de IRQs marcadas como \"reservadas\" por Intel. \nLas tarjetas gráficas tuvieron sus propias incompatibilidades. Una vez que las tarjetas de vídeo evolucionaron hacia SVGA, el estándar para acceder a ellas ya no estaba claro. A la vez, la programación para PC utilizaba un modelo de memoria por segmentos de 64 KB. El más común modo de pantalla VGA quedaba alojado en un único segmento de memoria. Los modos SVGA requerían más memoria, por lo que el acceso a la memoria completa de pantalla era complicado. Cada fabricante desarrolló sus propias formas de acceso a la memoria de pantalla, incluso sin enumerar los modos de forma coherente. Se hizo un intento de crear un estándar, llamado VBE, pero no todos los fabricantes se adhirieron a ella. \nDebido al gran número de adaptadores de terceros y no estándar para ellos, la programación para PC resultaba difícil. Los desarrolladores profesionales debían someter sus programas a prueba con un gran conjunto de combinaciones de hardware diferentes. Incluso el propio PC no tenía una clara interfaz de la aplicación al modelo de memoria plana que los 386 y superiores podrían proporcionar en modo protegido. \nCuando llegó el 386, de nuevo se podía programar un sistema operativo en modo protegido para él. Esta vez, la compatibilidad con MS-DOS era mucho más fácil, pues este procesador incluía modo virtual 8086. Desafortunadamente los programas no podían cambiar directamente entre ellos, así quese desarrollaron nuevos modelos de memoria API, VCPI y DPMI, este último se hizo el más popular. \nMientras tanto, los consumidores se vieron desbordados por los diferentes estándares incompatibles y las diferentes combinaciones de hardware que se ofrecían. Para dar una idea de qué clase de PC que necesitarían para ejecutar sus programas, se estableció el estándar PC Multimedia (MPC) en 1990. Un PC que cumplía el mínimo estándar MPC podía ser considerado, y comercializado como, un MPC. El software que podía ejecutarse en un PC con la más mínima compatibilidad MPC estaría garantizado para funcionar en cualquier MPC. Las normas de MPC nivel 2 y MPC nivel 3 se crearon más tarde, pero el término \"MPC compatible\" nunca tuvo éxito. Después del nivel 3 MPC en 1996, no se establecieron más normas MPC.\n", "subsections": []}, {"name": "Los desafíos al dominio de Wintel", "text": "A principios del siglo XXI, el éxito de Microsoft Windows había llevado a casi todos los otros sistemas operativos a casi la extinción, y se aseguró que la plataforma \"IBM PC compatible\" fuese el equipo informático dominante. Esto significó que si un programador solo desarrollaba su software para la plataforma Wintel, sería capaz de llegar a la gran mayoría de usuarios de computadoras. A fines de 1980, el único competidor importante para Windows fue el Macintosh de Apple Inc.. El Mac fue presentado como \"el ordenador para el resto de nosotros\", pero la pujanza del conjunto DOS/Windows/Intel redujo rápidamente a los Macintosh al nicho de la educación y el diseño gráfico, del que sólo recientemente ha comenzado a surgir. A mediados de 1990, la cuota de mercado de Macintosh se había reducido a cerca del 5%, y la introducción de un nuevo sistema operativo rival se había vuelto demasiado arriesgada comercialmente. La experiencia había demostrado que incluso si un sistema operativo era técnicamente superior a Windows, sería un fracaso en el mercado (BeOS y OS/2, por ejemplo). En 1989, Steve Jobs lanzó su nueva plataforma NeXT, de la que dijo que \"será la última plataforma nueva de hardware en tener éxito, o la primera en fracasar.\" En 1993, NeXT anunció que ponía fin a la producción del ordenador NeXTcube y portaba NeXTSTEP a los procesadores Intel. En 1997, NeXT fue adquirida por Apple, que presentó a continuación el ordenador iMac en 1998. Después de este lanzamiento, los Mac han recuperado cuota de mercado, aunque muy lentamente. En agosto de 2009, la cuota de mercado de Mac OS era sólo de un 4,59%. {cita requerida} \nEn el mercado de hardware, Intel inicialmente licenció su tecnología para que otros fabricantes pudieran fabricar x86 CPUs. Como la plataforma \"Wintel\" consiguió el dominio del mercado, Intel terminó abandonando esta práctica. Compañías como AMD y Cyrix desarrollaron CPUs alternativas que eran funcionalmente compatibles con Intel. Hacia el final de la década de 1990, AMD estaba tomando una parte creciente del mercado de las CPU para PC. AMD incluso terminó jugando un papel importante en la dirección de la evolución de la plataforma x86, cuando su línea de procesadores Athlon siguió desarrollando la clásica arquitectura x86, de la que Intel se desvió con su arquitectura Netburst de las CPUs Pentium 4 y la arquitectura IA-64 para la línea de CPUs Itanium para servidores. AMD desarrolló el AMD64, el primer desarrollo importante no creado por Intel, que más tarde adoptó Intel. En 2006, Intel comenzó a abandonar Netburst con el lanzamiento de su línea de procesadores Intel Core, que representaba una evolución del anterior Pentium III.\n", "subsections": []}, {"name": "El PC compatible hoy", "text": "El término \"compatible con IBM\" no es de uso común para los ordenadores actuales, porque prácticamente todos los equipos principales se basan en la arquitectura PC. La mayoría de plataformas competidoras han desaparecido o han sido relegadas a los mercados minoritarios de entusiastas, como el Commodore Amiga. Una excepción notable fue el Apple Macintosh, que utilizó la arquitectura PowerPC hasta 2006, cuando Apple adoptó la arquitectura Intel x86 tal como se utiliza en el PC. La arquitectura x86 que Apple comercializa actualmente es, a todos los efectos, \"IBM PC Compatible\".\nLa velocidad del procesador y capacidad de memoria de los ordenadores modernos son muchísimo mayores de lo que eran en el original de PC de IBM y, sin embargo la compatibilidad hacia atrás se ha mantenido en gran medida. Un sistema operativo de 32 bits publicado en la década de 2000 todavía puede ejecutar muchas de los programas más simples escritos para los sistemas operativos de la década de 1980 sin necesidad de un emulador, aunque un emulador como DOSBox tiene ahora cerca de la funcionalidad nativa a toda velocidad. \n", "subsections": []}, {"name": "Véase también", "text": "Influencia del IBM PC\nIBM BIOS\nLlamadas de interrupción del BIOS\nDirecciones base de entrada/salida\n", "subsections": []}, {"name": "Referencias", "text": "↑ Reimer, Jeremy. «Total share: 30 years of personal computer market share figures». Ars Technica. Consultado el 13 de septiembre de 2008. \n", "subsections": []}, {"name": "Enlaces externos", "text": "https://web.archive.org/web/20090429210209/http://ibscorporation.com/pc2.htm", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Computadora", "title": "Computadora", "summary": "Computadora, computador u ordenador[1]​[2]​[3]​ es una máquina electrónica digital programable que ejecuta una serie de comandos para procesar los datos de entrada, obteniendo convenientemente información que posteriormente se envía a las unidades de salida. Una computadora está compuesta por numerosos y diversos circuitos integrados y varios elementos de apoyo, extensión y accesorios, que en conjunto pueden ejecutar tareas diversas con suma rapidez y bajo el control de un programa (software).\nLa constituyen dos partes esenciales, el hardware, que es su estructura física (circuitos electrónicos, cables, gabinete, teclado, ratón, etc.), y el software, que es su parte intangible (programas, datos, información, documentación, etc).\nDesde el punto de vista funcional es una máquina que posee, al menos, una unidad central de procesamiento (CPU), una unidad de memoria y otra de entrada/salida (periférico). Los periféricos de entrada permiten el ingreso de datos, la CPU se encarga de su procesamiento (operaciones aritmético-lógicas) y los dispositivos de salida los comunican a los medios externos. Es así, que la computadora recibe datos, los procesa y emite la información resultante, la que luego puede ser interpretada, almacenada, transmitida a otra máquina o dispositivo o sencillamente impresa; todo ello a criterio de un operador o usuario y bajo el control de un programa de computación.\nEl hecho de que sea programable le permite realizar una gran variedad de tareas sobre la base de datos de entrada ya que puede realizar operaciones y resolver problemas en diversas áreas de la actividad humana (administración, ciencia, diseño, ingeniería, medicina, comunicaciones, música, etc).\nBásicamente, la capacidad de una computadora depende de sus componentes hardware, en tanto que la diversidad de tareas radica mayormente en el software que admita ejecutar y contenga instalado.\nSi bien esta máquina puede ser de dos tipos, computadora analógica o sistema digital, el primer tipo es usado para pocos y muy específicos propósitos; la más difundida, utilizada y conocida es la computadora digital (de propósitos generales); de tal modo que en términos generales (incluso populares), cuando se habla de «la computadora» se está refiriendo a una computadora digital. Las hay de arquitectura mixta, llamadas computadoras híbridas, siendo también estas de propósitos especiales.\nEn la Segunda Guerra Mundial se utilizaron computadoras analógicas mecánicas, orientadas a aplicaciones militares, y durante la misma época se desarrolló la primera computadora digital, que se llamó ENIAC; ella ocupaba un enorme espacio y consumía grandes cantidades de energía, que equivalen al consumo de cientos de computadoras actuales (PC).[4]​ Las computadoras modernas están basadas en circuitos integrados, miles de millones de veces más veloces que las primeras máquinas, y ocupan una pequeña fracción de su espacio.[5]​\nComputadoras simples son lo suficientemente pequeñas para residir en los dispositivos móviles. Las computadoras portátiles, tales como tabletas, netbooks, notebooks, ultrabooks, pueden ser alimentadas por pequeñas baterías. Las computadoras personales en sus diversas formas son iconos de la llamada era de la información y son lo que la mayoría de la gente considera como «computadora». Sin embargo, los sistemas embebidos también constituyen computadoras, y se encuentran en muchos dispositivos actuales, tales como reproductores MP4, teléfonos inteligentes, aviones de combate, juguetes, robots industriales, etc.\n", "sections": [{"name": "Etimología", "text": "", "subsections": [{"name": "Computadora/Computador", "text": "En el español que se habla en América se utilizan términos derivados del inglés computer y este a su vez del latín computare 'calcular'. A partir de la raíz latina, también surgieron computator (lit., «computador»; c. 1600), ‘el que calcula’, y computist («computista»; finales del siglo XIV), ‘experto en cómputo calendárico o cronológico’.[6]​\nSegún el Oxford English Dictionary, el primer uso conocido de la palabra computer en la lengua inglesa se encuentra en el libro The Yong Mans Gleanings (1613), del escritor Richard Braithwait, para referirse a un arithmetician (aritmético): «I haue  [sic] read the truest computer of Times, and the best Arithmetician that euer  [sic] breathed, and he reduceth thy dayes into a short number». Este término aludía a un “computador humano”, una persona que realizaba cálculos o cómputos. Computer continuó con el mismo significado hasta mediados del siglo XX.[7]​ A finales de este período, se contrataban a mujeres como computadoras porque se les podían pagar menos que a sus colegas masculinos.[8]​ En 1943, la mayoría de las computadoras humanas eran mujeres;[9]​ para referirse a ellas existía la forma femenina computress (“computadora”), que con el tiempo se cambió a programmer (“programadora”).[10]​\nEl Oxford English Dictionary registra que, a finales del siglo XIX, computer empezó a utilizarse con el significado de «máquina calculadora».[7]​ El uso moderno del término para «computador electrónico digital programable» data de 1945, basándose en el concepto teórico de máquina de Turing publicado en 1937. ENIAC (1946), sigla de «computador e integrador numérico electrónico» (Electronic Numerical Integrator And Computer), generalmente se considera el primero de este tipo.[6]​\n"}, {"name": "Ordenador", "text": "En el español que se habla en España es predominante el uso del vocablo «ordenador», que proviene del término francés ordinateur y este a su vez del término latino ordinator.[11]​ La palabra «ordenador» fue introducida por IBM Francia en 1955, después de que François Girard, entonces jefe del departamento de publicidad de la empresa tuvo la idea de consultar a su antiguo profesor de literatura en París, Jacques Perret. Junto con Christian de Waldner, entonces presidente de IBM Francia, pidieron al profesor Perret que sugiriera un nombre en francés para su nueva máquina electrónica de tratamiento de la información (IBM 650), evitando la traducción literal de la palabra inglesa computer (‘calculadora’ o ‘calculatriz’[12]​), que en aquella época estaba reservada para las máquinas científicas.\nEn 1911, una descripción de la máquina analítica de Babbage utilizaba la palabra ordonnateur para describir su fuerza motriz:\nPerret propuso una palabra compuesta centrada en el ordonnateur: ‘el que pone orden‘[13]​ y tiene la noción del orden eclesiástico en la Iglesia católica (ordinant).[11]​ Sugirió, más precisamente, ordinatrice électronique, de manera que el femenino, según él, pudiese distinguir mejor el uso religioso del uso contable de la palabra.[14]​ IBM Francia conservó la palabra ordinateur e inicialmente trató de proteger este nombre como marca registrada, pero, como los usuarios adoptaron fácil y rápidamente la palabra ordinateur, la empresa decidió dejarla en el dominio público.[15]​\nEn 1984, académicos franceses, en el debate Les jeunes, la technique et nous, que el uso del sustantivo ordonnateur es incorrecto, porque la función del aparato es procesar datos, no dar órdenes.[16]​ Mientras que otros —como también el creador del término, Jacques Perret— conocedores del origen religioso del término, lo consideran el más correcto; se habló del hecho de que la palabra «ordenador» guarda más relación con la función ordenar que con dar órdenes lo que sería más correcto para la función moderna de estos aparatos.[11]​ El uso de la palabra «ordenador» se ha exportado a los idiomas de España: el aragonés, el asturiano, el gallego, el castellano, el catalán y el euskera.\n"}]}, {"name": "Historia", "text": "Artículo principal:\nLejos de ser un invento de una persona en particular, la computadora es el resultado evolutivo de ideas de muchas personas relacionadas con áreas tales como la electrónica, la mecánica, los materiales semiconductores, la lógica, el álgebra y la programación.\n", "subsections": [{"name": "Cronología", "text": "Los principales hitos en la historia de la computación, desde las primeras herramientas manuales para hacer cálculos hasta las modernas computadoras de bolsillo.\n500 a. C.: se utiliza el ábaco en antiguas civilizaciones como la china o la sumeria, la primera herramienta para realizar sumas y restas.\nHacia 830: el matemático e ingeniero persa Musa al-Juarismi desarrolló la teoría del algoritmo, es decir, la resolución metódica de problemas de álgebra y cálculo numérico mediante una lista bien definida, ordenada y finita de operaciones.\n1614: el escocés John Napier inventa el logaritmo neperiano, que consiguió simplificar el cálculo de multiplicaciones y divisiones reduciéndolo a un cálculo con sumas y restas.\n1620: el inglés Edmund Gunter inventa la regla de cálculo, instrumento manual utilizado desde entonces hasta la aparición de la calculadora electrónica para hacer operaciones aritméticas.\n1623: el alemán Wilhelm Schickard inventa la primera máquina de calcular, cuyo prototipo desapareció poco después.\n1642: el científico y filósofo francés Blaise Pascal inventa una máquina de sumar (la pascalina), que utilizaba ruedas dentadas, y de la que todavía se conservan algunos ejemplares originales.\n1671: el filósofo y matemático alemán Gottfried Wilhelm Leibniz inventa una máquina capaz de multiplicar y dividir.\n1801: el francés Joseph Jacquard inventa para su máquina de tejer brocados una tarjeta perforada que controla el patrón de funcionamiento de la máquina, una idea que sería empleada más adelante por los primeros computadores.\n1833: el matemático e inventor británico Charles Babbage diseña e intenta construir la primera computadora, de funcionamiento mecánico, a la que llamó la «máquina analítica». Sin embargo, la tecnología de su época no estaba lo suficientemente avanzada para hacer realidad su idea.\n1841 : la matemática Ada Lovelace comienza a trabajar junto a Charles Babbage en lo que sería el primer algoritmo destinado a ser procesado por una máquina, por lo que se la considera como la primera programadora de computadores.\n1890: el estadounidense Herman Hollerith inventa una máquina tabuladora aprovechando algunas de las ideas de Babbage, que se utilizó para elaborar el censo de Estados Unidos. Hollerith fundó posteriormente la compañía que después se convertiría en IBM.\n1893: el científico suizo Otto Steiger desarrolla la primera calculadora automática que se fabricó y empleó a escala industrial, conocida como la Millonaria.\n1936: el matemático y computólogo inglés Alan Turing formaliza los conceptos de algoritmo y de máquina de Turing, que serían claves en el desarrollo de la computación moderna.\n1938: el ingeniero alemán Konrad Zuse completa la Z1, la primera computadora que se puede considerar como tal. De funcionamiento electromecánico y utilizando relés, era programable (mediante cinta perforada) y usaba sistema binario y lógica boleana. A ella le seguirían los modelos mejorados Z2, Z3 y Z4.\n1944: en Estados Unidos la empresa IBM construye la computadora electromecánica Harvard Mark I, diseñada por un equipo encabezado por Howard H. Aiken. Fue la primera computadora creada en Estados Unidos.\n1944: en Reino Unido se construyen los computadores Colossus (Colossus Mark I y Colossus Mark 2), con el objetivo de descifrar las comunicaciones de los alemanes durante la Segunda Guerra Mundial.\n1946: en la Universidad de Pensilvania se pone en funcionamiento la ENIAC (Electronic Numerical Integrator And Calculator), que funcionaba a válvulas y fue la primera computadora electrónica de propósito general.\n1947: en Bell Labs, John Bardeen, Walter Houser Brattain y William Shockley inventan el transistor.\n1948: en Reino Unido se construye el primer computador del mundo con programa almacenado, el Manchester Baby, diseñado por Frederic C. Williams, Tom Kilburn y Geoff Tootill, de la Universidad de Mánchester.\n1949: el MESM fue la primera computadora en Rusia y la segunda programable en Europa continental, creada por un equipo de científicos bajo la dirección de Serguéi Alekseevich Lébedev.\n1950: Kathleen Booth, crea el Lenguaje Ensamblador para hacer operaciones en la computadora sin necesidad de cambiar los cables de conexión, sino a través de tarjetas perforadoras (programa u operación guardada para usarla cuando sea necesario) las cuales eran propensas a dañarse por esta razón, a finales de este año se comienza a desarrollar el lenguaje de programación.\n1951 BESM El desarrollo de las máquinas BESM comenzó en el Instituto de Mecánica de Precisión y Ciencias de la Computación de la URSS (ITM y VT) en Moscú bajo la supervisión de Serguéi Alekseevich Lébedev en 1950 como una continuación de sus trabajos en Kiev con la computadora MESM. Esta serie de máquinas se dejaron de fabricar en 1987.\n1951: comienza a operar la EDVAC, concebida por John von Neumann, que a diferencia de la ENIAC no era decimal, sino binaria, y tuvo el primer programa diseñado para ser almacenado.\n1953: IBM fabrica su primera computadora a escala industrial, la IBM 650. Se amplía el uso del lenguaje ensamblador para la programación de las computadoras. Las computadoras con transistores reemplazan a las de válvulas, marcando el comienzo de la segunda generación de computadoras.\n1957: Jack S. Kilby construye el primer circuito integrado.\n1961: en Reino Unido se construye la Calculadora Anita en dos modelos, siendo las primeras calculadoras electrónicas de escritorio del mundo.\n1964: la aparición del IBM 360 marca el comienzo de la tercera generación de computadoras, en la que las placas de circuito impreso con múltiples componentes elementales pasan a ser reemplazadas con placas de circuitos integrados.\n1965: Olivetti lanza, Programma 101, la primera computadora de escritorio.\n1971: Nicolet Instruments Corp. lanza al mercado la Nicolet 1080, una computadora de uso científico basada en registros de 20 bits.\n1971: Intel presenta el primer microprocesador comercial, el Intel 4004, diseñado por Federico Faggin, Marcian Hoff y Masatoshi Shima.\n1975: Bill Gates y Paul Allen fundan Microsoft.\n1976: Steve Jobs, Steve Wozniak, Mike Markkula fundan Apple.\n1977: Apple presenta el primer computador personal que se vende a gran escala, el Apple II, desarrollado por Steve Jobs y Steve Wozniak.\n1981: se lanza al mercado el IBM PC, que se convertiría en un éxito comercial, marcaría una revolución en el campo de la computación personal y definiría nuevos estándares.\n1982: Microsoft presenta su sistema operativo MS-DOS, por encargo de IBM.\n1983: ARPANET se separa de la red militar que la originó, pasando a un uso civil y convirtiéndose así en el origen de Internet.\n1983: Richard Stallman anuncia públicamente el proyecto GNU.\n1985: Microsoft presenta el sistema operativo Windows 1.0.\n1990: Tim Berners-Lee idea el hipertexto para crear el World Wide Web (WWW), una nueva manera de interactuar con Internet.\n1991: Linus Torvalds comenzó a desarrollar Linux, un sistema operativo compatible con Unix.\n2000: aparecen a comienzos del siglo XXI los computadores de bolsillo, primeras PDA.\n2007: presentación del primer iPhone, por la empresa Apple, un teléfono inteligente o smartphone.\n"}]}, {"name": "Componentes", "text": "Las tecnologías utilizadas en computadoras digitales han evolucionado mucho desde la aparición de los primeros modelos en los años 1940, aunque la mayoría todavía utiliza la Arquitectura de von Neumann, publicada por John von Neumann a principios de esa década, que otros autores atribuyen a John Presper Eckert y John William Mauchly.\nLa arquitectura de Von Neumann describe una computadora con cuatro (4) secciones principales: la unidad aritmético lógica, la unidad de control, la memoria primaria, principal o central, y los dispositivos de entrada y salida (E/S). Estas partes están interconectadas por canales de conductores denominados buses.\n", "subsections": [{"name": "Unidad central de procesamiento", "text": "La unidad central de procesamiento (CPU, por sus siglas del inglés: Central Processing Unit) consta de manera básica de los siguientes tres elementos:\nLa unidad aritmética lógica (ALU: Arithmetic Logic Unit) es el dispositivo diseñado y construido para llevar a cabo las operaciones elementales como las operaciones aritméticas (suma, resta), operaciones lógicas (AND, OR, XOR, inversiones, desplazamientos y rotaciones).\nLa unidad de control (UC: Control Unit) sigue la dirección de las posiciones en memoria que contienen la instrucción que el computador va a realizar en ese momento; recupera la información poniéndola en la ALU para la operación que debe desarrollar. Transfiere luego el resultado a ubicaciones correspondientes en la memoria. Una vez que ocurre lo anterior, la unidad de control va a la siguiente instrucción, pudiendo ser la siguiente físicamente (procedente del Contador de Programa) u otra (a través de una instrucción de salto).\nLos registros: no accesibles (de instrucción, de bus de datos y bus de dirección) y accesibles, uso específico (contador programa, puntero pila, acumulador, flags, etc.) o de uso general.\n"}, {"name": "Memoria primaria", "text": "Véanse también:\n, \n y \nLa memoria principal, conocida como memoria de acceso aleatorio (RAM, por sus siglas del inglés: Random-Access Memory), es un conjunto de celdas de almacenamiento organizadas de tal forma que se pueden acceder numéricamente a la dirección de memoria. Cada celda corresponde a un bit o unidad mínima de información. Se accede por secuencias de 8 bits. Una instrucción es una determinada acción operativa, una secuencia que indica a la ALU la operación a realizar (suma, resta, operaciones lógicas, etc). En los bytes de memoria principal se almacenan tanto los datos como los códigos de operación que se necesitan para llevar a cabo las instrucciones. La capacidad de la memoria viene dada por el número de celdas que contiene, medido en bytes o múltiplos. Las tecnologías empleadas para fabricar las memorias han cambiado bastante; desde los relés electromecánicos de las primeras computadoras, tubos con mercurio en los que se formaban los pulsos acústicos, matrices de imanes permanentes, transistores individuales hasta los actuales circuitos integrados con millones de celdas en un solo chip. Se subdividen en memorias estáticas (SRAM) con seis transistores integrados por bit y la mucho más utilizada memoria dinámica (DRAM), de un transistor y un condensador integrados por bit. La memoria RAM puede ser reescrita varios millones de veces; a diferencia de la memoria ROM, que solo puede ser grabada una única vez.\n"}, {"name": "Periféricos de entrada, de salida o de entrada/salida", "text": "Los dispositivos de entrada permiten el ingreso de datos e información mientras que los de salida son los encargados de exteriorizar la información procesada por la computadora. Hay periféricos que son a la vez de entrada y de salida. Como ejemplo, un dispositivo típico de entrada es el teclado, uno de salida es el monitor, uno de entrada/salida es el disco rígido. Hay una gama muy extensa de dispositivos E/S, como teclado, monitor, impresora, ratón, unidad de disco flexible, cámara web, etc.\n"}, {"name": "Buses", "text": "Las tres unidades básicas en una computadora, la CPU, la memoria y el elemento de E/S, están comunicadas entre sí por buses o canales de comunicación:\nBus de direcciones : permite seleccionar la dirección del dato o del periférico al que se quiere acceder,\nBus de control : controla el funcionamiento externo e interno de la CPU.\nBus de datos :contiene la información (datos) que circula por el sistema.\n"}]}, {"name": "Otros datos y conceptos", "text": "En los computadores modernos, un usuario tiene la impresión de que los computadores pueden ejecutar varios programas «al mismo tiempo», esto se conoce como multitarea. En realidad, la CPU ejecuta instrucciones de un programa y después tras un breve periodo de tiempo, cambia la ejecución a un segundo programa y ejecuta algunas de sus instrucciones. Dado que este proceso es muy rápido, crea la ilusión de que se están ejecutando varios programas simultáneamente; en realidad se está repartiendo el tiempo de la CPU entre los programas, uno a la vez. El sistema operativo es el que controla el reparto del tiempo. El procesamiento realmente simultáneo se realiza en computadoras que poseen más de un CPU, lo que da origen al multiprocesamiento.\nEl sistema operativo es el programa que gestiona y administra todos los recursos del ordenador, controla, por ejemplo, qué programas se ejecutan y cuándo, administra la memoria y los accesos a los dispositivos E/S, provee las interfases entre dispositivos, incluso entre el computador y el usuario.\nActualmente se suele incluir en las distribuciones del sistema operativo algunos programas muy usados; como navegadores de Internet, procesadores de texto, programas de correo electrónico, interfaces de red, reproductores de películas y otros programas que antes se tenían que conseguir e instalar separadamente.\nLos primeros computadores digitales, de gran tamaño y coste, se utilizaban principalmente para hacer cálculos científicos. ENIAC se creó con el propósito de resolver los problemas de balística del ejército de Estados Unidos. El CSIRAC, el primer ordenador australiano, permitió evaluar patrones de precipitaciones para un gran proyecto de generación hidroeléctrica.\nCon la fabricación comercial de computadoras, los gobiernos y las empresas sistematizaron muchas de sus tareas de recolección y procesamiento de datos, que antes eran realizadas manualmente. En el mundo académico, los científicos de todos los campos empezaron a utilizar los computadores para hacer sus análisis y cálculos; el descenso continuado de los precios de estos aparatos permitió su uso por empresas cada vez más pequeñas. Las empresas, las organizaciones y los gobiernos empezaron a emplear un gran número de pequeños ordenadores para realizar tareas que antes eran hechas por computadores centrales grandes y costosos.\nCon la invención del microprocesador en 1970, fue posible fabricar ordenadores cada vez más baratos. Nació el microcomputador y luego apareció la computadora personal, estos últimos se hicieron populares para llevar a cabo tareas rutinarias como escribir e imprimir documentos, calcular probabilidades, realizar análisis y cálculo con hojas de cálculo, comunicarse mediante correo electrónico e Internet. La gran disponibilidad de computadores y su fácil adaptación a las necesidades de cada persona, han hecho que se utilicen para una variedad de tareas, que incluyen los más diversos campos de aplicación.\nAl mismo tiempo, los computadores pequeños de programación fija (sistemas embebidos) empezaron a abrirse camino entre las aplicaciones para el hogar, los automóviles, los aviones y la maquinaria industrial. Estos procesadores integrados controlaban el comportamiento de los aparatos más fácilmente, permitiendo el desarrollo de funciones de control más complejas, como por ejemplo los sistemas de freno antibloqueo (ABS). A principios del siglo XXI, la mayoría de los aparatos eléctricos, casi todos los tipos de transporte eléctrico y la mayoría de las líneas de producción de las fábricas funcionan con un computador.\nHacia finales del siglo XX y comienzos del XXI, los computadores personales son usados tanto para la investigación como para el entretenimiento (videojuegos), mientras que los grandes computadores se utilizan para cálculos matemáticos complejos, tecnología, modelado, astronomía, medicina, etc.\nComo resultado del cruce entre el concepto de la computadora personal y los llamados «supercomputadores» surge la estación de trabajo; este término, originalmente utilizado para equipos y máquinas de registro, grabación y tratamiento digital de sonido, ahora hace referencia a estaciones de trabajo, que son sistemas de gran capacidad de cómputo, normalmente dedicados a labores de cálculo científico o procesos en tiempo real. Una estación de trabajo es, en esencia, un equipo de trabajo personal con capacidad elevada de cálculo, rendimiento y almacenamiento, superior a los computadores personales convencionales.\n", "subsections": []}, {"name": "Véase también", "text": " Portal:Informática. Contenido relacionado con Informática.\nHardware\nSoftware\nFirmware\n", "subsections": [{"name": "Historia", "text": "Anexo:Historia de la computación\nHistoria del hardware\nHistoria del hardware de computadora (1960-presente)\nHistoria de las computadoras personales\n"}, {"name": "Tipos de computadoras", "text": "Computadora analógica\nComputadora híbrida\nSupercomputadora\nComputadora central\nMinicomputadora\nMicrocomputadora\nComputador de escritorio\nComputador personal\nComputadora doméstica\nMultiseat\nComputador portátil\nTableta (computadora)\nSubportátil\nPC Ultra Móvil\nPDA\nTeléfono inteligente\nTabléfono\nCliente (informática)\nCliente liviano\nCliente pesado\nCliente híbrido\nSistema embebido\n"}, {"name": "Componentes y periféricos", "text": "Placa base\nUnidad central de procesamiento\nMicroprocesador\nBIOS\nMemoria de acceso aleatorio\nMemoria de solo lectura\nMemoria flash\nBus (informática)\nEntrada/salida\nFuente eléctrica\nFuente de alimentación\nTeclado\nRatón (informática)\nTouchpad\nLápiz óptico\nPantalla táctil\nTableta digitalizadora\nMonitor\nImpresora\nTarjeta de sonido\nTarjeta gráfica\nUnidad de procesamiento gráfico\nDisco duro\nDisquete\nCD-ROM\nDVD\n"}, {"name": "Otros", "text": "Caja de computadora\nPuerto serie\nPuerto paralelo\nPS/2 (puerto)\nUniversal Serial Bus\nIEEE 1394\nTarjeta de red\nPeripheral Component Interconnect\nHardware\nSoftware\nPrograma informático\nAplicación informática\nSistema operativo\nSistema de archivos\nInternet\nVirtualización\nWorld Wide Web\n"}]}, {"name": "Referencias", "text": "↑ Real Academia Española. «computadora». Diccionario de la lengua española (23.ª edición). Consultado el 8 de abril de 2022. \n↑ Real Academia Española y Asociación de Academias de la Lengua Española (2023). «computadora». Diccionario panhispánico de dudas (2.ª edición, versión provisional). Consultado el 8 de abril de 2015. \n↑ Real Academia Española. «ordenador». Diccionario de la lengua española (23.ª edición). Consultado el 15 de julio de 2022. \n↑ En 1946, ENIAC requería alrededor de 174 kW. En comparación, una laptop moderna consume alrededor de 30 W; cerca de seis mil veces menos. «Approximate Desktop & Notebook Power Usage». University of Pennsylvania. Archivado desde el original el 3 de junio de 2009. Consultado el 29 de julio de 2014. \n↑ Las primeras computadoras tales como Colossus y ENIAC eran capaces de procesar entre 5 y 100 operaciones por segundo. Un moderno microprocesador puede procesar miles de millones de operaciones por segundo, y muchas de estas operaciones son bastante más complejas que en sus predecesoras. «Intel Core I7 Processor: Features». Intel Corporation. Consultado el 29 de julio de 2014. \n↑ a b Harper, Douglas. «computer». Online Etymology Dictionary. Consultado el 24 de abril de 2021. \n↑ a b «computer». Oxford English Dictionary (en inglés) (Segunda edición). Oxford: Oxford University Press. 1989. Archivado desde el original el 18 de octubre de 2022. Consultado el 24 de abril de 2021. \n↑ Evans, Claire L (2018). Broad band: the untold story of the women who made the Internet (en inglés). New York: Portfolio/Penguin. p. 23. ISBN 978-0-735-21175-9. OCLC 1080385286. \n↑ Smith, Erika E (2013). «Recognizing a collective inheritance through the history of women in computing». CLCWeb: Comparative Literature and Culture (en inglés) (Lafayette: Purdue University Press) 15 (1): 1-9. ISSN 1481-4374. OCLC 5135244784. doi:10.7771/1481-4374.1972. \n↑ Fagen, MD; Joel, Amos E; Schindler, GE (1975). A history of engineering and science in the Bell System. Communications sciences (1925-1980) (en inglés). Nueva York: Bell Telephone Laboratories. p. 367. ISBN 978-0-932-76406-5. OCLC 1070356364. «When they began using computers, their classification changed from computress to the more esteemed title of programmer. Computing expertise diffused throughout the company wherever it was needed. This arrangement, which differed markedly from what evolved in most commercial establishments, and even in some other research labs, sprang directly from the historically collaborative environment of Bell Labs.» \n↑ a b c «Ordinateur». presse-francophone.org. 1 de junio de 2009. Archivado desde el original el 1 de junio de 2009. Consultado el 1 de noviembre de 2022. \n↑ Savater, Fernando (3 de marzo de 1987). «Una piadosa calculatriz». El País. ISSN 1134-6582. Consultado el 1 de noviembre de 2022. \n↑ Napoléon Landais, Dictionnaire général et grammatical des dictionnaires français, Didier - 1849.\n↑ Jacques Perret. «Histoire de la création du mot Ordinateur : la lettre in extenso de J. Perret et son contexte expliqué par Gilles Zemor» [Historia de la creación de la palabra Ordenador : la carta in extenso de J. Perret y su contexto explicado por Gilles Zemor]. Archivado desde el original el 8 de febrero de 2009. Consultado el 4 de junio de 2022. .\n↑ Pierre Guiraud, Problèmes et méthodes de la statistique linguistique, (en francés) Springer, 1959, ISBN 9789027700254.\n↑ El uso de la palabra ordenador. El Mundo.es.\n", "subsections": []}, {"name": "Enlaces externos", "text": " Wikimedia Commons alberga una galería multimedia sobre Computadora.\n Wikcionario  tiene definiciones y otra información sobre computador.\n Wikiquote alberga frases célebres de o sobre Computadora.\n Wikilibro de Montaje y Mantenimiento de Equipos Informáticos.\nEl Diccionario de la Real Academia Española tiene una definición para computador.", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Computadora_anal%C3%B3gica", "title": "Computadora analógica", "summary": "Se denomina computadora analógica, computador analógico u ordenador analógico a un tipo de ordenador que utiliza dispositivos electrónicos o mecánicos para modelar el problema que se resuelve, utilizando un tipo de representación de cantidad física para expresar los valores que conforman el resultado. \nPara el modelado se utiliza la analogía existente, en términos matemáticos, de algunas situaciones que se dan en diferentes campos. Por ejemplo, la que existe entre los movimientos oscilatorios en mecánica y el análisis de corrientes alternas en electricidad. Estos dos planteamientos se analizan a través de ecuaciones diferenciales, planteando algún tipo de modelo que permite obtener una solución satisfactoria.\nEstos dispositivos se usan en contraposición a las computadoras digitales, en las cuales los fenómenos físicos o mecánicos son utilizados para construir una máquina de estado finito, que es usada después para modelar elementos llamados instrucciones, que a través de un programa (serie de instrucciones) permite calcular una solución al problema que se desea resolver. Hay un grupo intermedio de computadoras llamadas los computadoras híbridas, en el que un ordenador digital es utilizado para controlar y organizar entradas y salidas hacia y desde dispositivos analógicos anexos; por ejemplo, los dispositivos analógicos podrían ser utilizados para generar valores iniciales para iteraciones. Así, un ábaco sería una computadora digital, y una regla de cálculo un computador analógico.\nLos computadores analógicos ideales operan con números reales y son diferenciales, mientras que los computadores digitales se limitan a números computables y son algebraicos. Esto significa que los computadores analógicos tienen una tasa de dimensión de la información (ver teoría de la información), o potencial de dominio informático más grande que los computadores digitales (ver teorema de incompletitud de Gödel).[cita requerida] Esto, en teoría, permite a los computadores analógicos resolver problemas que son indescifrables con computadores digitales.[cita requerida]\nLos teóricos de la informática suelen usar también la denominación ordenador real como sinónimo de ordenador analógico, pues este tipo de máquinas utilizan magnitudes físicas para representar valores, los cuales se comportan como números reales, y no como números naturales (los cuales permiten representar cantidades discretas y no continuas).\n", "sections": [{"name": "Cronología de los computadores analógicos", "text": "Se cree que el mecanismo de Anticitera es el primer computador analógico mecánico conocido.[1]​\nEl astrolabio fue inventado en el período helenístico en el primer o segundo siglo antes de Cristo, y a menudo es atribuido a Hiparco de Nicea. Como una combinación del planisferio y de la dioptra, el astrolabio fue efectivamente un computador analógico capaz de resolver diferentes tipos de problemas en astronomía esférica. Posteriormente, astrónomos musulmanes produjeron muchos tipos diferentes de astrolabios y los usaron para más de mil problemas diversos relacionados con la astronomía, astrología, horóscopos, la navegación, agrimensura, medición del tiempo, la alquibla (dirección de La Meca), Salat (rezo), etc.[2]​ Al-Biruni inventó el primer astrolabio mecánico de engranajes para el calendario lunisolar,[3]​ una máquina de procesamiento de conocimiento[4]​ con un tren de engranaje y ruedas dentadas,[5]​ alrededor del 1000 AD. El planisferio  también fue inventado por Al-Biruni a comienzos del siglo XI.[6]​[7]​\nEl equatorium fue un instrumento calculador astrométrico inventado por Azarquiel en la España islámica alrededor de 1015.\nEl \"reloj del castillo\", un reloj astronómico inventado por Al Jazarí en 1206,[8]​ es considerado ser el primer computador analógico programable.[9]​ Exhibía el zodiaco, las órbitas solares y lunares, un indicador con forma de luna creciente viajando a través de una entrada que hacía que puertas automáticas abrieran cada hora,[10]​[11]​ y cinco músicos robóticos que tocaban música cuando eran golpeados por las palancas operadas por un árbol de levas atado a una rueda de agua. La longitud del día y la noche podían ser reprogramadas cada día para llevar la cuenta de las longitudes cambiantes del día y la noche a través del año.[9]​\nEn 1235, Abi Bakr, de Isfahán, inventó un astrolabio que incorporaba un computador mecánico de calendario y ruedas dentadas.[12]​\nLa regla de cálculo es un computador analógico manual para hacer la multiplicación y la división, inventada alrededor 1620-1630, poco después de la publicación del concepto del logaritmo.\nEntre 1831 y 1835, el matemático e ingeniero Giovanni Plana creó una máquina de calendario perpetuo que, a través de un sistema de poleas y cilindros, era capaz de calcular el calendario de cualquier año entre el 0 (es decir, el 1 a. C.) y el 4000, tomando el consideración los años bisiestos y la variación en la longitud del día.[13]​\nEl predictor de mareas inventado por William Thomson en 1872 fue de gran utilidad para la navegación en aguas poco profundas. Utilizaba un sistema de poleas y cables para calcular automáticamente el nivel de marea de una determinada ubicación durante un determinado período.\nEl analizador diferencial, un computador analógico mecánico diseñado para solucionar ecuaciones diferenciales por integración, usando mecanismos de ruedas y discos para realizar la integración. Inventado en 1876 por James Thomson, le siguieron otros sistemas similares, particularmente los diseñados por el ingeniero español Leonardo Torres y Quevedo, quien construyó varias máquinas para resolver raíces reales y complejas de polinomios; y Michelson y Stratton, cuyo analizador armónico realizaba análisis de Fourier, pero mediante un sistema de 80 muelles en lugar de integradores Kelvin.\nHacia 1912, Arthur Pollen había desarrollado un computador analógico mecánico dirigido eléctricamente para el sistema del control de disparo, basado en el analizador diferencial. Fue usado por la Marina Imperial Rusa de la Primera Guerra Mundial.\nEl integrador de agua fue desarrollado en la URSS en 1936 por Vladímir Serguéyevich Lukiánov para resolver ecuaciones diferenciales, en un principio para el cálculo de estructuras de hormigón y luego utilizado en multitud de disciplinas. Se desarrolló y mejoró con el tiempo, permaneciendo en servicio hasta 1984.\nDurante la Segunda Guerra Mundial, los apuntadores de armas y visores de bombas emplearon computadores analógicos mecánicos.\nLa calculadora de Curta era un dispositivo accionado por una pequeña manivela cilíndrica que podría realizar multiplicaciones, divisiones, y un número de otras operaciones.\nLa MONIAC Computer fue un modelo hidráulico de una economía nacional, revelado por primera vez en 1949.\nEl Computer Engineering Associates surgió de Caltech en 1950 para proporcionar servicios comerciales usando el \"Direct Analogy Electric Analog Computer\" (Computador Analógico Eléctrico de Analogía Directa) (\"la facilidad de analizador de propósito general más grande e impresionante para la solución de problemas de campo\") desarrollado allí por Gilbert D. McCann, Charles H. Wilts, y Bart Locanthi.[14]​[15]​\nEl Heathkit EC-1, un computador analógico educativo fabricado por la Heath Company, Estados Unidos, alrededor de 1960.\nEl computador analógico de Comdyna GP-6 introducido en 1968 y producido por 36 años.\n", "subsections": []}, {"name": "Computadores analógicos electrónicos", "text": "La semejanza entre los componentes mecánicos lineales, tales como resortes y amortiguadores hidráulicos. Sin embargo, la diferencia entre estos sistemas es lo que hace útil a la computación analógica. Si uno considera un simple sistema masa-resorte, construir el sistema físico requeriría la compra de los resortes y de las masas. Esto sería procedido a sujetarlos el uno al otro y un anclaje apropiado, recaudar equipo de prueba con la apropiada gama de entrada, y finalmente, tomar medidas (algo que es difícil).\nEl equivalente eléctrico puede ser construido con algunos amplificadores operacionales (Op amps) y algunos componentes lineales pasivos; todas las medidas pueden tomarse directamente con un osciloscopio. En el circuito, la \"masa (simulada) del resorte\" puede ser cambiada ajustando un potenciómetro. El sistema eléctrico es una analogía del sistema físico, por eso el nombre, pero es menos costoso de construir, más seguro, y más fácil de modificar. También, un circuito electrónico puede operar típicamente en frecuencias más altas que el sistema que es simulado. Esto permite que la simulación funcione más rápidamente que en tiempo real, para resultados más rápidos.\nLa desventaja de la analogía mecánico-eléctrica es que la electrónica es limitada por el rango sobre el cual las variables pueden variar. Esto es llamado rango dinámico. También son limitados por los niveles de ruido.\nEstos circuitos eléctricos también pueden realizar fácilmente otras simulaciones. Por ejemplo, el voltaje puede simular la presión de agua y los amperios pueden simular la corriente del agua en términos de metros cúbicos por segundo.\nUn sistema digital usa niveles de voltaje eléctrico discretos para representar códigos para los símbolos. La manipulación de estos símbolos es el método de operación del computador digital. El computador analógico electrónico manipula las cantidades físicas de formas de onda, (voltaje o corriente). La precisión de la lectura de la computadora análoga está limitada principalmente por la precisión del equipo de lectura usado, generalmente tres o cuatro dígitos significativos. La precisión del computador digital es prácticamente infinita (típicamente 15 dígitos de precisión), pero la precisión de su resultado está limitada solo por el tiempo. Un computador digital puede calcular muchos dígitos en paralelo u obtener el mismo número de dígitos realizando los cómputos en secuencia de tiempo.\n", "subsections": []}, {"name": "Computadores híbridos analógicos-digitales", "text": "Artículo principal:\nHay un dispositivo intermedio, un computador híbrido, en el cual un computador digital es combinado con un computador analógico. Los computadores híbridos se usan para obtener un muy exacto -pero no completamente exacto- valor de 'semilla', usando un computador analógico como la parte frontal (front-end), que es entonces alimentado dentro de un proceso iterativo del computador digital para alcanzar el grado final de precisión deseado. Con una semilla numérica altamente exacta de tres o cuatro dígitos, es reducido dramáticamente el tiempo total de cómputo digital necesario para alcanzar la precisión deseada, puesto que son requeridas muchas menos iteraciones. O, por ejemplo, el computador analógico puede ser usado para solucionar un problema no analítico de la ecuación diferencial, para el uso en una determinada etapa de un cómputo (donde la precisión no es muy importante). En todo caso, el computador híbrido generalmente es substancialmente más rápido que un computador digital, y, a su vez, puede suministrar un cómputo mucho más exacto que un computador analógico. Es útil para aplicaciones en tiempo real que requieren dicha combinación, por ejemplo, un radar phased array de alta frecuencia o un cómputo de sistema de tiempo.\n", "subsections": []}, {"name": "Mecanismos", "text": "En los computadores analógicos, frecuentemente los cómputos son realizados usando las propiedades de la resistencia eléctrica, de los voltajes y así sucesivamente. Por ejemplo, un simple sumador de dos variables puede ser creado por dos fuentes de corriente en paralelo. El primer valor es fijado ajustando la primera fuente de corriente (digamos x miliamperios), y el segundo valor es fijado ajustando la segunda fuente de corriente (digamos y miliamperios). La medición de la corriente a través de los dos en su juntura hacia la señal de tierra dará la suma como una corriente a través de una resistencia a la señal de tierra, es decir, x + y miliamperios. (Ver las leyes de Kirchhoff). Similarmente, otros cálculos son realizados usando amplificadores operacionales y circuitos especialmente diseñados para otras tareas.\nEl uso de las propiedades eléctricas en los computadores analógicos significa que los cálculos son realizados normalmente en tiempo real (o más rápido), a una fracción significativa de la velocidad de la luz, sin los retardos de cálculo relativamente grandes de los computadores digitales. Esta característica permite ciertos cálculos útiles que son comparativamente \"difíciles\" de realizar por los computadores digitales, por ejemplo la integración numérica. Los computadores analógicos pueden integrar una forma de onda de voltaje, usualmente por medio de un condensador, que acumula carga en el tiempo.\nLas funciones y los cálculos no lineales pueden ser construidos para una precisión limitada (tres o cuatro dígitos) diseñando circuitos de generador de funciones - circuitos especiales de varias combinaciones de capacitancia, inductancia, resistencia, en combinación con diodos (ej, diodos Zener) para proporcionar la no linealidad. Generalmente, una función no lineal es simulada por una forma de onda no lineal cuya forma varía con el voltaje (o la corriente). Por ejemplo, a medida que el voltaje aumenta, la impedancia total puede cambiar mientras los diodos sucesivamente permiten que fluya la corriente.\nCualquier proceso físico que modele algún cómputo puede ser interpretado como un computador analógico. Algunos ejemplos, inventados con el propósito de ilustrar el concepto de cómputo analógico, incluyen usar un grupo desordenado de espaguetis, como modelo de ordenamiento de números; un tablero, un conjunto de clavos, y una banda elástica de goma, como modelo para encontrar la envoltura convexa de un sistema de puntos; y cadenas enlazadas entre sí, como modelo para encontrar la ruta más corta en una red. Todos éstos son descritos por A. K. Dewdney.[16]​\n", "subsections": []}, {"name": "Componentes", "text": "Los computadores analógicos frecuentemente tienen un armazón complicado, pero tienen en su núcleo un conjunto de componentes clave que realizan los cálculos, que el operador manipula a través del armazón del computador.\nLos componentes hidráulicos clave pueden incluir pipas, válvulas o torres; los componentes mecánicos pueden incluir engranajes y palancas; los componentes eléctricos clave pueden incluir:\npotenciómetros\namplificadores operacionales\nintegradores\ngeneradores de funciones fijas\nLas principales operaciones matemáticas usadas en un computador analógico eléctrico son:\nadición\ninversión\nexponenciación\nlogaritmo\nintegración con respecto al tiempo\ndiferenciación con respecto al tiempo\nmultiplicación y división\nLa diferenciación con respecto al tiempo no es usada frecuentemente. Corresponde en el dominio de frecuencia a un filtro paso alto, lo que significa que el ruido de alta frecuencia es amplificado.\n", "subsections": []}, {"name": "Limitaciones", "text": "En general, los computadores analógicos están limitadas por efectos reales, no-ideales. Una señal analógica está compuesta de cuatro componentes básicos: Magnitudes de corriente continua y corriente alterna, frecuencia, y fase. Los límites reales de rango en estas características limitan a los computadores analógicos. Algunos de estos límites incluyen el piso de ruido, la no linealidad, el coeficiente de temperatura, y los efectos parásitos dentro de los dispositivos semiconductores, y la carga finita de un electrón. Para los componentes electrónicos disponibles en el comercio, los  rangos de estos aspectos de las señales de entrada y salida son siempre figuras del méritorafa.\n", "subsections": []}, {"name": "Investigación actual", "text": "Mientras que la computación digital es extremadamente popular, la investigación en la computación analógica está siendo hecha por un puñado de gente por todo el mundo. En los Estados Unidos, Jonathan Mills de la Universidad de Indiana, Bloomington, Indiana han estado trabajando en la investigación usando computadores analógicos extendidos. En el Laboratorio de robótica de Harvard, la computación analógica es un tema de investigación.\n", "subsections": []}, {"name": "Ejemplos prácticos", "text": "Estos son algunos ejemplos de computadores analógicos:\nMecanismo de Anticitera\nAstrolabio\nAnalizador diferencial\nPredictor Kerrison\nIntegrador mecánico\nMONIAC (modelo hidráulico de la economía de Reino Unido)\nNomograma\nMira Norden\nAmplificador operacional\nPlanímetro\nRangekeeper\nRegla de cálculo\nTermostato\nPredictor de mareas\nTorpedo Data Computer\nTorquetum\nIntegrador de agua\nComputador mecánico\nLos sintetizadores análogos también pueden ser vistos como una forma de computador analógico, y fueron basados originalmente en la tecnología del computador analógico electrónico.\n", "subsections": []}, {"name": "Computadores reales", "text": "Los teóricos de la computación refieren a menudo a los computadores analógicos idealizadas como computadoras reales (porque operan en un conjunto de números reales). Por el contrario, los computadores digitales deben primero cuantificar la señal en un número finito de valores, y así pueden trabajar solamente con el conjunto de números racionales (o, con una aproximación de números irracionales).\nEstos computadores analógicos idealizados en teoría pueden solucionar los problemas que son intratables en los computadores digitales; no obstante según lo mencionado, en realidad, los computadores analógicos están lejos de lograr este ideal, en gran parte debido a problemas de la minimización del ruido. Por otra parte, dado tiempo y memoria ilimitados, computador digital (ideal) puede también solucionar problemas de números reales.[cita requerida]\n", "subsections": []}, {"name": "Véase también", "text": "Señal\nSeñal analógica\nSeñal digital\nTeoría de conjuntos\nTeoría de la computabilidad\nEcuación diferencial\nSistema dinámico\nTeoría del caos\nRegla de cálculo\nMecanismo de Anticitera\nAmplificador operacional\nComputador digital\nComputador híbrido\nComputación basada en ADN\nComputador cuántico\nSimulador cuántico universal\n", "subsections": []}, {"name": "Referencias", "text": "↑ The Antikythera Mechanism Research Project Archivado el 28 de abril de 2008 en Wayback Machine., The Antikythera Mechanism Research Project. Retrieved 2007-07-01\n↑ Dr. Emily Winterburn (National Maritime Museum), Using an Astrolabe, Foundation for Science Technology and Civilisation, 2005.\n↑ D. De S. Price (1984). \"A History of Calculating Machines\", IEEE Micro 4 (1), p. 22-52.\n↑ Tuncer Oren (2001). \"Advances in Computer and Information Sciences: From Abacus to Holonic Agents\", Turk J Elec Engin 9 (1), p. 63-70 [64].\n↑ Donald Routledge Hill (1985). \"Al-Biruni's mechanical calendar\", Annals of Science 42, p. 139-163.\n↑ Khwarizm Archivado el 4 de enero de 2010 en Wayback Machine., Foundation for Science Technology and Civilisation.\n↑ G. Wiet, V. Elisseeff, P. Wolff, J. Naudu (1975). History of Mankind, Vol 3: The Great medieval Civilisations, p. 649. George Allen & Unwin Ltd, UNESCO.\n↑ Al-Jazari - the Mechanical Genius Archivado el 15 de enero de 2009 en Wayback Machine., MuslimHeritage.com\n↑ a b Ancient Discoveries, Episode 11: Ancient Robots, History Channel, consultado el 6 de septiembre de 2008 .\n↑ Howard R. Turner (1997), Science in Medieval Islam: An Illustrated Introduction, p. 184, University of Texas Press, ISBN 0-292-78149-0\n↑ Donald Routledge Hill, \"Mechanical Engineering in the Medieval Near East\", Scientific American, May 1991, pp. 64-9 (cf. Donald Routledge Hill, Mechanical Engineering)\n↑ Silvio A. Bedini, Francis R. Maddison (1966). \"Mechanical Universe: The Astrarium of Giovanni de' Dondi\", Transactions of the American Philosophical Society 56 (5), p. 1-69.\n↑ «An Amazing Perpetual Calendar, Hidden in an Italian Chapel». Atlas Obscura (en inglés). Consultado el 7 de septiembre de 2020. \n↑ Caltech NASTRAN history\n↑ Analog Simulation: Solution of Field Problems\n↑ A. K. Dewdney. «On the Spaghetti Computer and Other Analog Gadgets for Problem Solving», Scientific American, 250(6):19-26, junio 1984. Reimpreso en The Armchair Universe. An Exploration of Computer Worlds, por A. K. Dewdney, publicado por W. H. Freeman & Company (1988), ISBN 0-7167-1939-8 (traducido por Luis Bou: «Aventuras informáticas. Los mundos del ordenador», editorial Labor S. A., Barcelona (1990), ISBN 84-335-9297-1 [capítulo Mundo dos: Mateartilugios: Artilugios analógicos, pp. 41-52 y Artilugios analógicos II, pp. 53-66]).\n", "subsections": []}, {"name": "Enlaces externos", "text": "Large collection of electronic analog computers with lots of pictures and documentation\nSimulation of a car suspension system with an electronic analog computer\nIntroduction to Analog-/Hybrid-Computing (pdf)\nExample programs for Analog Computers (pdf)\nLarge collection of old analog and digital computers at Old Computer Museum\nA great disappearing act: the electronic analogue computer Chris Bissell, The Open University, Milton Keynes, UK Accessed February 2007\nGerman computer museum with still runnable analog computers\nAnalog computer basics Archivado el 6 de agosto de 2009 en Wayback Machine.\nLecture 20: Analog vs Digital (in a series of lectures on \"History of computing and information technology\")\nAnalog computer trumps Turing model\nJonathan W. Mills's Analog Notebook\nIndiana University Extended Analog Computer\nHarvard Robotics Laboratory Analog Computation\n[https://web.archive.org/web/20171201031302/http://www.comdyna.com/ (enlace roto disponible en Internet Archive; véase el historial, la primera versión y la última). Comdyna - a current manufacturer of analog computing hardware]\nThe Enns Power Network Computer - an analog computer for the analysis of electric power systems (advertisement from 1955)", "subsections": []}]}
